[
  {
    "courseCode": "AI2002",
    "courseDescription": "인공지능(AI) 학계 인사들과 AI기술 및 응용분야의 새로운 주제 또는 특정 내용을 필요에 따라 선정하여 강의한다. 인공지능 및 메타버스, 블록체인, ESG 등 응용분야의 동향에 대하여 외부 전문가를 초청하여 강의를 듣고 토론하는 시간을 가진다."
  },
  {
    "courseCode": "AI4001",
    "courseDescription": "인공지능 및 머신러닝 지식들을 활용하여 인공지능 기술을 배우고 응용해 새로운 서비스를 구축할 수 있는 실무 프로젝트 수행. AI 핵심기술인 인공지능 경험랩, 강화학습, 딥러닝, 음성인식, 자연어 처리 등"
  },
  {
    "courseCode": "AI4003",
    "courseDescription": "본 강좌에서는 인공지능의 기본 이해와 실세계 데이터셋을 이용한 인공지능 오픈소스 소프트웨어 실습을 제공한다. 머신 러닝과 딥러닝의 소개, 이미지 분류/세그먼트화, 객체 탐지, 합성곱 신경망, 비지도 학습, GAN(Generative Adversarial Networks)를 다룬다."
  },
  {
    "courseCode": "GS1401",
    "courseDescription": "컴퓨터 프로그래밍 과목은 대학과정 학생이 컴퓨터 프로그램에 대한 기초적인 지식과, 이를 이용한 문제해결 능력을 습득하도록 하는데 그 목적이 있다. 이를 달성하기 위해서 C 언어의 기본적인 문법을 소개하고, 배열, 포인터, 구조체 등의 심화된 내용을 학습하도록 한다. 아울러 실습시간을 통해 C언어를 이용한 프로그래밍을 통하여 실제 문제를 해결하는 능력을 배양하도록 한다."
  },
  {
    "courseCode": "AI4028",
    "courseDescription": "Machine Reading Comprehension을 활용한 현업 프로젝트를 실습하고 컨텐츠 생성 또는 처리 프로젝트를 수행한다. Mid Term 이전에는 개인 프로젝트를 수행하며, 이후에는 2~3인 구성의 팀 프로젝트를 수행한다. 팀프로젝트 수행을 통해 기술의 이해도를 높이고 현업에서의 이슈를 파악/해결하는 능력을 높인다."
  },
  {
    "courseCode": "AI4310",
    "courseDescription": "본 과목에서는 사람과 AI-infused system의 상호작용에 관한 PBL (Project-Based Learning)을 수행한다. 매년 선정되는 국가 special topics를 다루며, 올해는 최근 부상하는 메타버스와 연계하여 Extended Reality and Digital Twin에 관한 프로젝트를 기획 및 제작한다. 구체적으로, RDW, 차량 XR, SR, NFT 연계 응용을 수행하며, 그 결과물에 대한 IR pitching을 목표로 한다."
  },
  {
    "courseCode": "GS3015",
    "courseDescription": "대학 과정 이수에 필요한 정성적/정량적 자료 분석을 위한 통계적 사고의 기초를 학습한다. 도한 수학, 통계학, 또는 계량적 분석을 많이 요구하는 학문을 전공하고자 하는 학생들에게는 과학적 분석방법의 수리적 토대를 갖추도록 하여 상위 교과목을 수강할 수 있는 능력을 기르도록 한다."
  },
  {
    "courseCode": "GS2001",
    "courseDescription": "다변수 함수/벡터함수의 미적분학을 다루며, 기본개념 및 응용을 다룬다. 벡터함수의 연속성, 미분가능성, 방향미분, 기하학적 구조해석을 기본으로 하여 다중적분, 선적분, 면적분에 관한 이론을 이해한다. 학생들은 이 과목을 통해 추상적인 개념을 정립하고 수학적 엄밀성을 높인 기초적인 증명방법을 배울 수 있다."
  },
  {
    "courseCode": "GS2004",
    "courseDescription": "선형대수학은 수학교과의 기본 필수 과목이며 미적분학과 더불어 이공계 전공 학부의 필수 과목이다. 이 강좌에서는 선형대수의 기본 개념인 벡터 공간과 이들 사이의 선형변형 및 이를 나타내는 행렬에 관한 이론을 심도 있게 배우고 기하학, 미분방정식 외 신호처리, 제어이론 등 공학 전공에서의 응용과 활용을 배운다."
  },
  {
    "courseCode": "EC4213",
    "courseDescription": "본 과목은 기계학습에서의 여러 패러다임과 방법, 기계학습 응용, 딥러닝으로도 알려져 있는 심층 신경망의 최근 사례를 소개한다. 패러다임에서 지도학습, 비지도학습, 준지도학습, 액티브 학습 등을 다룬다. 본 과목은 기계학습 알고리즘을 이해하고 컴퓨터 비전과 자연어 처리 같은 여러 응용에 적용하는 것을 배운다."
  },
  {
    "courseCode": "EC4209",
    "courseDescription": "본 과목은 탐색과 지식 표현에서의 기본 개념뿐만 아니라 인공지능의 많은 여러 세부 영역에 관한 기본 개념을 소개한다. 인공지능에서의 필수 개념을 다루는 데 집중한다. 본 과목에서 다루는 내용은 다음과 같다. 지능 에이전트; 균등/블라인드 탐색: 너비 우선 탐색, 균등 비용 탐색, 깊이 우선 탐색, 깊이 제한 탐색, 반복적 deepening 탐색; Informed/휴리스틱 탐색: 탐욕 베스트-퍼스트 탐색, A* 알고리즘; 로컬 탐색: hill climbing and simulated annealing; 적대적 탐색: minimax 알고리즘과 알파-베타 프루닝; constraint satisfaction 문제: 백트래킹 탐색, first-order 논리, 논리적 추론; 불확실성: 베이즈 규칙, 베이지안 추론, 독립과 조건부 독립, 베이지안 네트워크; 퍼지 논리; 신경망; 기계 학습: 결정 트리 학습, 나이브 베이즈 분류."
  },
  {
    "courseCode": "GS1401",
    "courseDescription": "컴퓨터 프로그래밍 과목은 대학과정 학생이 컴퓨터 프로그램에 대한 기초적인 지식과, 이를 이용한 문제해결 능력을 습득하도록 하는데 그 목적이 있다. 이를 달성하기 위해서 C 언어의 기본적인 문법을 소개하고, 배열, 포인터, 구조체 등의 심화된 내용을 학습하도록 한다. 아울러 실습시간을 통해 C언어를 이용한 프로그래밍을 통하여 실제 문제를 해결하는 능력을 배양하도록 한다."
  },
  {
    "courseCode": "AI2002",
    "courseDescription": "인공지능(AI) 학계 인사들과 AI기술 및 응용분야의 새로운 주제 또는 특정 내용을 필요에 따라 선정하여 강의한다. 인공지능 및 메타버스, 블록체인, ESG 등 응용분야의 동향에 대하여 외부 전문가를 초청하여 강의를 듣고 토론하는 시간을 가진다."
  },
  {
    "courseCode": "AI4001",
    "courseDescription": "인공지능 및 머신러닝 지식들을 활용하여 인공지능 기술을 배우고 응용해 새로운 서비스를 구축할 수 있는 실무 프로젝트 수행. AI 핵심기술인 인공지능 경험랩, 강화학습, 딥러닝, 음성인식, 자연어 처리 등"
  },
  {
    "courseCode": "AI4003",
    "courseDescription": "본 강좌에서는 인공지능의 기본 이해와 실세계 데이터셋을 이용한 인공지능 오픈소스 소프트웨어 실습을 제공한다. 머신 러닝과 딥러닝의 소개, 이미지 분류/세그먼트화, 객체 탐지, 합성곱 신경망, 비지도 학습, GAN(Generative Adversarial Networks)를 다룬다."
  },
  {
    "courseCode": "AI4004",
    "courseDescription": "컴퓨터 비전 연구는 지난 20년에 걸쳐 급격히 증가하였으며, 자율주행, 증강현실, AI 시스템과 같은 여러 산업에 적용되어 왔다. 본 과목에서는 전통적인 방법에서부터 최근 기계학습 기반 접근방법까지의 중요한 컴퓨터 비전 알고리즘을 배운다. 본 과목의 목표는 학생들이 컴퓨터 비전 분야에서 연구 흥미를 갖도록 하고 중요한 알고리즘을 모티브로 하는 새로운 연구 주제를 설계하도록 하는 것이다. 모든 학생은 3개의 프로그래밍 숙제와 1개의 연구 프로젝트 발표에 평가를 받는다."
  },
  {
    "courseCode": "AI4011",
    "courseDescription": "This course covers the concepts, theories, and procedures of formal languages, automata, grammars, computational complexity that are fundamentals on the com -puter science and engineering. Main topics include finite automata, regular lan -guage, context-free grammar, push-down automata, pumping lamma, Turing ma -chines, recursively enumerable languages, and so on.아. SW/AI      연계강화      프로그램"
  },
  {
    "courseCode": "AI4012",
    "courseDescription": "Advanced discrete mathematics for computer science and engineering emphasizes  mathematical defi -nitions and proofs as well as in-depth understanding about discrete structures found in computer and engineering. It covers formal logic notation, methods of proof, relations, recursive relation, generating functions, elementary graph theory & tree structures, number theory, various counting principles, dis -crete probability and discrete optimization."
  },
  {
    "courseCode": "AI4014",
    "courseDescription": "This course aims at providing the fundamental concepts of random processes for electrical engineer -ing and computer science. Topics include probability and random variables; random processes and sequences; response of linear systems to random inputs; correlation; power spectral density; and spe -cific random processes such as Wiener process, Poisson process, and Markov process. Students are expected to be able to apply the fundamental concepts of random process to the problems related with communication, signal processing, and networking research areas, upon completion of this course."
  },
  {
    "courseCode": "AI4020",
    "courseDescription": "본 과목은 탐색과 지식 표현에서의 기본 개념뿐만 아니라 인공지능의 많은 여러 세부 영역에 관한 기본 개념을 소개한다. 인공지능에서의 필수 개념을 다루는 데 집중한다. 본 과목에서 다루는 내용은 다음과 같다. 지능 에이전트; 균등/블라인드 탐색: 너비 우선 탐색, 균등 비용 탐색, 깊이 우선 탐색, 깊이 제한 탐색, 반복적 deepening 탐색; Informed/휴리스틱 탐색: 탐욕 베스트-퍼스트 탐색, A* 알고리즘; 로컬 탐색: hill climbing and simulated annealing; 적대적 탐색: minimax 알고리즘과 알파-베타 프루닝; constraint satisfaction 문제: 백트래킹 탐색, first-order 논리, 논리적 추론; 불확실성: 베이즈 규칙, 베이지안 추론, 독립과 조건부 독립, 베이지안 네트워크; 퍼지 논리; 신경망; 기계 학습: 결정 트리 학습, 나이브 베이즈 분류."
  },
  {
    "courseCode": "AI4021",
    "courseDescription": "본 과목은 기계학습에서의 여러 패러다임과 방법, 기계학습 응용, 딥러닝으로도 알려져 있는 심층 신경망의 최근 사례를 소개한다. 패러다임에서 지도학습, 비지도학습, 준지도학습, 액티브 학습 등을 다룬다. 본 과목은 기계학습 알고리즘을 이해하고 컴퓨터 비전과 자연어 처리 같은 여러 응용에 적용하는 것을 배운다."
  },
  {
    "courseCode": "AI4028",
    "courseDescription": "Machine Reading Comprehension을 활용한 현업 프로젝트를 실습하고 컨텐츠 생성 또는 처리 프로젝트를 수행한다. Mid Term 이전에는 개인 프로젝트를 수행하며, 이후에는 2~3인 구성의 팀 프로젝트를 수행한다. 팀프로젝트 수행을 통해 기술의 이해도를 높이고 현업에서의 이슈를 파악/해결하는 능력을 높인다."
  },
  {
    "courseCode": "AI4030",
    "courseDescription": "본 과목은 최첨단의 과학기술이라 할 인공지능과 로봇기술을 둘러싼 윤리적 쟁점들을 다룬다. 우리가 현재 맞이하고 있고 향후 도래할 인공지능과 로봇의 사회에서 당면하게 될 여러 심각한 윤리적 쟁점들을 고민해 보는 중요한 기회를 가질 것이다. 학기 전반부에는 인공지능 로봇기술 및 그 윤리적 문제 전반을 개괄하는 한편 주요 \"개별적인\" 윤리적 문제들 다루고, 학기 후반부에는 인공지능 로봇기술을 둘러싼 \"일반적\" 문제들을 다룰 것이다."
  },
  {
    "courseCode": "AI4310",
    "courseDescription": "본 과목에서는 사람과 AI-infused system의 상호작용에 관한 PBL (Project-Based Learning)을 수행한다. 매년 선정되는 국가 special topics를 다루며, 올해는 최근 부상하는 메타버스와 연계하여 Extended Reality and Digital Twin에 관한 프로젝트를 기획 및 제작한다. 구체적으로, RDW, 차량 XR, SR, NFT 연계 응용을 수행하며, 그 결과물에 대한 IR pitching을 목표로 한다."
  },
  {
    "courseCode": "AI4311",
    "courseDescription": "This course is for students who do not have prior knowledge of deep learning. It covers basic math tools, artificial neural network, multilayered perceptrons, backpropagation, deep convolutional neural net -work. The algorithms are applied to linear regression and image classification."
  },
  {
    "courseCode": "AI4312",
    "courseDescription": "In this course, we study various AI techniques to design and develop intelligent systems in CT (culture technology) applications. In addition to fundamental theories of AI+HCI, many CT projects and applica -tions will be considered in practice."
  },
  {
    "courseCode": "CT2501",
    "courseDescription": "만화, 애니메이션, 게임, 라이트노벨 등 오늘날 대중문화의 새로운 영역들은 다수가 오타쿠계 서브컬쳐로 채워지고 있다. 일본에서 기원한 이러한 대중문화 현상은 국경을 넘어 현재 국내에서도 낯설지 않게 되었으며, 오타쿠라는 용어는 국내에서도 ‘오덕’이라는 용어로 변형되어 쓰이고 있다. 새로운 문화현상으로 주목되는 오타쿠 문화의 현상과 특징을 분야와 사례별로, 그리고 역사적으로 살펴보고, 이를 거시적인 사회 정치경제적 맥락과 연관 지어 이해하려는 것이 본 과목의 목표와 내용이다."
  },
  {
    "courseCode": "CT2502",
    "courseDescription": "19세기 중엽 이래 예술은, 예술가의 비판적 자의식과 미적 감수성, 작품을 둘러싼 비판적 담론의 급진성을 통해 도구적 합리성이 지배하는 자본주의적 사회에서 대항담론(counter-discourse)으로 기능해왔다. 모더니즘, 포스트모더니즘, 다원주의 문화와 같은 용어로 차별화되는 복잡다단한 예술의 경향, 특성 을 이해하고 감수성에 기초한 대안적 세계를 상상해보자."
  },
  {
    "courseCode": "CT2504",
    "courseDescription": "이 강좌는 플라톤의 『국가론』으로부터 토마스 모어의 『유토피아』를 거쳐 최신 공상과학소설 속 우주 유토피아에 이르기까지 서구의 사상과 문학적 상상력에서 ‘유토피아’의 이상이 나타나고 발전해온 양상을 탐구하는 강좌이다. 특히 존재하지 않는 (u-topic) 이상적 (eu-topic) 사회 속 인간의 행복 실현을 상상 (함으로써 동시에 존재하는 현실의 불의와 부조리를 비판)하는 서구의 유토피아 픽션에서 과학기술의 핵심적 역할에 중점을 두고 다양한 토론을 도모한다. 독서 목록은 모어의 『유토피아』(1516년)와 윌리엄 모 리스의 『유토피아에서 온 소식』(1890)과 같은 유토피아 픽션의 고전은 물론, 인종과 식민주의, 젠더와 생식기술, 노동과 사유재산, 시민적 자유와 통제 등 소위 포스트모던/포스트휴먼 시대의 쟁점들이 복잡하게 교차하는 지점을 다루는 최신 문제작들을 포함한다. 텍스트에 대한 심층 분석과 비평을 담은 심화 글쓰기를 요구하는 융합 강좌이다.CT2505 과학기술과 사회: 두 문화의 이해 Understanding Two cultures: Science(Technology) and Society [3:0:3] 불규칙한 자연 속에 존재하는 규칙성을 발견하면서 시작된 과학은 지난 2500년 기술과의 접목을 통해 우리사회를 획기적으로 변화 시켰다. 과학기술덕분에 인류는 그 어느 때보다 풍요롭고 편리한 삶을 누리게 되었지만 동시에 전혀 예측하지 못했던 기후변화, 물 부족, 에너지고갈, 식량부족, 새로운 질병 등의 글로벌 이슈들에 직면하게 되었다. 과학기술에 대한 역사적, 철학적. 문화적 접근 을 통해 다가올 미래사회에서 과학기술이 가야 할 방향성에 대해 고민하고 논의한다."
  },
  {
    "courseCode": "CT2506",
    "courseDescription": "이 강의는 신화를 이해하기 위한 기초적인 자료, 개념, 이론을 학습하는 것을 목적으로 한다. 특히 그리스 신화에서 보이는 여러 이야기 주제를 토대로, 신화에서 드러나는 인간의 꿈, 희망, 절망의 패턴을 독해하는 연습을 한다."
  },
  {
    "courseCode": "CT4101",
    "courseDescription": "주어진 과제의 목표와 현상을 분석하고 이 분석 결과를 토대로 무한한 상상을 하며 가상의 디지털 환경 안에서 기본적 원리를 이해하며 모든 사람들이 공감할 수 있도록 이에 대한 과정을 디지털로 시각화하여 표현한다."
  },
  {
    "courseCode": "CT4102",
    "courseDescription": "이 강의는 정보 시각화 방법 및 디자인 사고에 대한 이론 및 교육으로 구성되어 있다. 정보의 시각화 방법 교육에서는 색, 모양, 질감에 대한 기본적인 이론들을 배우게 되고, 정보를 분석하고 기본적 시각요소로 전환하는 방법을 통해서 정보를 체계적으로 시각화하는 방법들을 배우게 된다. 그리고 디자인 사고는 미래를 개선하기 위한 문제들이나 이슈들의 실용적이고 창조적인 해결 방법론이다. 디자인 사고 교육을 통해서 체계적 사고와 문제해결력을 개발할 수 있는 창의적이고 융합적인 사고를 배우게 된다."
  },
  {
    "courseCode": "CT4201",
    "courseDescription": "본 과목에서는 영화, 게임, 증강 및 가상현실 등 다양한 문화산업분야에서 핵심적으로 사용되는 컴퓨터 그래픽스의 기본 원리를 배운다. 3 차원 가상의 모델로부터 고품질의 이미지를 만들기 위해 사용되는 그래픽스 파이프라인(graphics pipeline), 변환(transformation), 쉐이딩(shading), 래스터라이제이션(rasterization), 광선추적법(ray tracing), 전역조명법(global illumination)등을 학습한다."
  },
  {
    "courseCode": "CT4202",
    "courseDescription": "이미지를 통해 커뮤니케이션하는 방식과 인간이 이미지와 시각적 커뮤니케이션의 다양한 형식을 해독하고 해석하는 방식을 공부하고, 영상 매체가 미치는 영향을 알아본다. 디지털 영상 및 영상제작에 필요한 전반적인 이론 및 실습을 바탕으로 영상 콘텐츠 제작을 위한 기본 소양을 쌓고, 영상미학 및 표현방안에 대한 폭넓은 기초적 지식 습득을 통하여 영상에 대한 이해를 돕는다."
  },
  {
    "courseCode": "CT4203",
    "courseDescription": "미디어 기술의 역사와 예술의 새로운 형태의 출현과 관계를 소개하고 뉴미디어의 새로운 기능에 대해 학습 한다. Art & technology는 기술, 비즈니스, 예술 감성이 어우러진 형태의 다학문적 기술로서 예술 및 기술 연구의 전체 구조를 이해하고 예술 감성이 어우러진 통합된 시스템을 연구 및 제작한다."
  },
  {
    "courseCode": "CT4301",
    "courseDescription": "본 과목에서는 인간-컴퓨터 상호 작용 (HCI) 분야에 대한 개요 및 소개를 제공한다. 인간중심 컴퓨팅의 개념, HCI의 세부연구분야 (가령, 모 바일 HCI/UI/UX, 웨어러블 컴퓨팅, 탠저블 인터페이스, Human-Robot Interaction, 센서기반 상황이해기술, 인공지능 기반의 인터랙션 설계 등), 최근 연구동향, 국내외 선도연구그룹에 대한 오버뷰를 한다. 코스는 학부생 및 대학원 수준의 비공식 전공자에게 개방되어 있다."
  },
  {
    "courseCode": "CT4302",
    "courseDescription": "최근 많은 관심을 받고 있는 인공지능 기술을 활용하여 자율적인 인공생명체를 개발하고 이를 게임, 디지털 아트 등의 문화기술 응 용 분야에 적용한다. 이를 위해, 인공생명체의 지능, 행동 양식을 설계하기 위한 인공생명기술, 진화기술, 행동네트워크 등의 인공 지능 기술을 학습하며, 자율 지능/행동 모델을 개발/평가하기 위한 게임과 디지털 아트 플랫폼을 설계하고 구현한다."
  },
  {
    "courseCode": "CT4303",
    "courseDescription": "본 강좌에서는 인공지능 기술이 게임에 어떻게 활용될 수 있는지 배우도록 한다. 세부 주제는 인공지능 플레이어 제작, 게임 콘텐츠 자동생성, 게임 플레이어 모델링을 포함한다. 본 강좌에서 수강생들은 게임 인공지능과 관련한 작은 규모의 프로젝트를 진행할 예정이다."
  },
  {
    "courseCode": "CT4304",
    "courseDescription": "본 교과목은 아두이노나 라즈베리파이 등 임베디드 시스템 중의 하나로 쉽게 개발할 수 있는 환경을 이용하여, 외부 전자 장치들을 통제함으로써 환경과 상호작용이 가능한 창의력과 논리적 사고의 향상을 목표로 한다. 하드웨어, 소프트웨어, 제작 및 디자인에 대한 다학문적 기술이 필요한 다양한 물리적 컴퓨팅 프로젝트를 직접 제작해본다."
  },
  {
    "courseCode": "CT4305",
    "courseDescription": "서비스러닝의 목적은 교과에서 배운 지식을 지역사회 문제에 적용함으로써 기존의 지식을 강화하고, 새로운 지식을 경험으로 습득하고자 하는 것을 목표로 한다. 융합 캡스톤 디자인 및 실험/실습 체험 기반의 수업으로 학생들의 전공 및 재능을 지역공동체와 나누고 나아가 세계의 사회적 문제를 함께 생각하고 이를 해결한 방법에 대한 아이디어를 도출하여 프로젝트를 직접 제작해 본다."
  },
  {
    "courseCode": "CT4310",
    "courseDescription": "인간-AI 상호작용: Special Topics on XR and Digital Twin Human-AI Interaction: Special Topics on XR and Digital Twin [3:0:3]본 과목에서는 사람과 AI-infused system의 상호작용에 관한 PBL (Project-Based Learning)을 수행한다. 매년 선정되는 국가 special topics를 다루며, 올해는 최근 부상하는 메타버스와 연계하여 Extended Reality and Digital Twin에 관한 프로젝트를 기획 및 제작한다. 구체적으로 RDW, 차량 XR, SR, NFT 연계 응용을 수행하며, 그 결과물에 대해 IR pitching을 목표로 한다."
  },
  {
    "courseCode": "CT4504",
    "courseDescription": "이 과목은 기본적인 프로그래밍 언어(C, C++ 언어 등)를 배운 후에, 계산과학을 수행하는 데 필요한 고성능 계산(High Per- formance Computing)을 위한 UNIX OS의 기본적 이해, 가시화, 등 과학계산 환경과 몇 가지 실례를 통해 과학계산 프로그래밍 기초를 배운다."
  },
  {
    "courseCode": "CT4506",
    "courseDescription": "이 과목은 과학계산 과목의 심화 과목으로 나노 시대에 필요한 (동력학적) 몬테카를로 방법론 기초, 그리고 그 방법론의 특성과 여러 실례를 통한 몬테카를로 과학 연구 응용에 대해 공부한다."
  },
  {
    "courseCode": "MM2001",
    "courseDescription": "다변수 함수/벡터함수의 미적분학을 다루며, 기본개념 및 응용을 다룬다. 벡터함수의 연속성, 미분가능성, 방향미분, 기하학적 구조해석을 기본으로 하여 다중적분, 선적분, 면적분에 관한 이론을 이해한다. 학생들은 이 과목을 통해 추상적인 개념을 정립하고 수학적 엄밀성을 높인 기초적인 증명방법을 배울 수 있다."
  },
  {
    "courseCode": "MM2002",
    "courseDescription": "이 교과에서는 수학 및 공학의 필수인 미분방정식의 정립 및 풀이와 자연과학 및 공학에의 응용에 대하여 공부한다. 상미분방정식의 해의 존재 및 단일성, 선형미분방정식 및 선형 연립 미분방정식, 라플라스 변환방법, 푸리에 시리즈; 편미분 방정식의 개요 및 수치 해석적 풀이 등에 대하여 배운다."
  },
  {
    "courseCode": "MM2004",
    "courseDescription": "선형대수학은 수학교과의 기본 필수 과목이며 미적분학과 더불어 이공계 전공 학부의 필수 과목이다. 이 강좌에서는 선형대수의 기본 개념인 벡터 공간과 이들 사이의 선형변형 및 이를 나타내는 행렬에 관한 이론을 심도 있게 배우고 기하학, 미분방정식 외 신호처리, 제어이론 등 공학 전공에서의 응용과 활용을 배운다."
  },
  {
    "courseCode": "MM2006",
    "courseDescription": "이 교과목은 기초수학 필수과목을 모두 수강한 학생들이 이후에 수학분야의 상위과목(선택과목)이나 추론과 추상화가 필요한 과목들을 수강하려는 경우에 선수과목으로 활용할 수 있다. 수학의 여러 분야의 가장 기초가 되는 개념과 엄밀한 증명 과정을 배움으로써 수학적 사고를 기르고 추상화 시키는 방법을 배운다. 공리, 정의, 정리, 증명 등의 정확한 의미, 증명의 방법, 추론 방법 등을 소개하고 이를 적용하는 훈련을 한다."
  },
  {
    "courseCode": "MM2007",
    "courseDescription": "수학적 사고를 기르고 공리체계에서 엄밀하게 증명하는 방법을 훈련한다. 논리력을 기르기 위해 수학 텍스트를 정확하게 해석할 수 있어야 하며 자신의 생각을 정확하게 언어로 표현할 수 있어야 한다. 이에 텍스트강독, 토론, 그리고 수학적 글쓰기(증명)를 배운다. 수학적 사고를 위해 필요한 기본방법을 배운다. (수체계, 함수, 귀납법을 기본으로 하며 정수론의 기초, counting, 실수의 연속성, 무한의 개념, 함수의 연속성, 복소수체계도 다룬다.)또한, 실생활이나 다른 학문의 다양한 분야에서 수학적 사고가 활용된 예를 찾아보고 분석한다. 제대로 쓰이는 예와 잘못된 예를 구분할 수 있는 사고력을 기른다."
  },
  {
    "courseCode": "MM2011",
    "courseDescription": "다변수 함수와 벡터함수의 미적분학을 다루는 강좌로 기본 개념 및 응용을 다룬다. 벡터함수의 연속성, 미분가능성, 방향미분, 기하학적 구조해석을 기본으로 하여 다중적분, 선적분, 면적분에 관한 이론을 학습하고 이를 기반으로 Fundamental Theorem of Calculus (미적분의 기본정리)의 다차원 일반화인 Green’s Theorem(그린의 정리), Stoke’s Theorem (스톡스의 정리)및 Divergence Theorem(가우스의 발산정리)의 증명과 물리적 의미를 학습한다. 학생들은 이 과목을 통해 추상적인 개념을 정립하고 수학적 엄밀성을 높인 기초적인 증명 방법을 배울 수 있다"
  },
  {
    "courseCode": "MM3001",
    "courseDescription": "실함수론의 체계적인 내용을 다루는 교과과정으로, 실수의 체계, 실함수의 극한, 연속, 미분, 적분과 리만적분 외의 내용을 배운다. ε - δ 을 이용한 정리의 증명을 이해하고 해석학의 근본 개념을 배운다. 이 교과를 통하여 수학적/해석적 논리를 전개하고 증명을 독해/ 작문의 능력을 키운다. 더불어, 실함수 해석학으로 가능한 응용을 학습한다."
  },
  {
    "courseCode": "MM3012",
    "courseDescription": "2016년 여름학기 미국 유수 Liberal Arts College 중 공학대학인 Harvey Mudd College 의 Rachel Levy 교수님을 초빙하여 수학-공학 융합 과목을 GIST 학부학생들을 대상으로 개설되었다.  현 Harvey Mudd College에서 개설되고 있는 Engineering Mathematics (E72) 과목을 바탕으로 설계된 이 강좌에서는 실질적인 공학문제의 demonstration 과 mathematical modeling 의 배경이 되는 수학논리의 mini-lecture 및 이해도를 높이기 위한 group work, 그리고 Matlab 프로그래밍을 통한 수치해석까지 공학에서 필수적인 내용을 포괄적으로 학습함. 수학적 기법과 응용성을 학습하며, 특히 이 과목을 통하여 ‘수학적  자신감, 공학 문제에 적절한 수리 도구 구별력, 계산적 해의 정확성에 대한 판별력, 해석적, 전산적 기량 습득, 복잡한 문제해결의 필수요소인 인내력’과 같은 덕목을 기르는 것을 목표로 한다."
  },
  {
    "courseCode": "MM3015",
    "courseDescription": "“확률과 통계” (또는 “기초통계학”) - 이 과목에서는 대학 과정 이수에 필요한 정성적/정량적 자료 분석을 위한 통계적 사고의 기초를 학습한다. 또한 수학, 통계학, 또는 계량적 분석을 많이 요구하는 학문을 전공하고자 하는 학생들에게는 과학적 분석방법의 수리적 토대를 갖추도록 하여 상위 교과목을 수강할 수 있는 능력을 기르도록 한다."
  },
  {
    "courseCode": "MM4002",
    "courseDescription": "이 과목은 복소수와 복소함수의 기초를 배우는 과정이다. 복소해석학은 수론, 응용수학을 포함한 수학의 여러 분야뿐 아니라 물리학에서도 응용을 찾을 수 있다. 이 과목에서는 복소수의 연산을 기반으로 여러 종류의 복소변수 함수와 그 연속성, 미분성, 해석적 등의 정의를 학습하며 테일러 급수, 로랑 급수, 리우빌의 정리, 코시 정리, 해석적 접속, 리만 사상 정리 등 복소해석학의 가장 중요한 결과들을 익히고 푸리에 변환등 복소함수의 적분과 의미, 응용에 대해 배운다."
  },
  {
    "courseCode": "MM4003",
    "courseDescription": "편미분 방정식은 수학, 과학 및 공학에서 널리 사용되어지는 분야로 미분과 미분방정식에 대한 지식을 기반으로 모델링과 시뮬레이션에 적용할 수 있는 능력을 기르는 것을 목표로 한다."
  },
  {
    "courseCode": "MM4004",
    "courseDescription": "이 과목은 현대대수학의 기본 개념이 되는 group theory, ring theory, 그리고 field theory에 대하여 배운다. 추상화를 좀 더 체계적으로 배우는 과목이며 여러 다른 분야에서 쓰이고 있는 group(군)이나 field(체)의 응용에 대해서 소개한다."
  },
  {
    "courseCode": "MM4005",
    "courseDescription": "이 과목은 기본적인 프로그래밍 언어(C, C++ 언어 등)를 배운 후에, 계산과학을 수행하는 데 필요한 고성능 계산(High Perfor -mance Computing)을 위한 UNIX OS의 기본적 이해, 가시화, 등 과학계산 환경과 몇 가지 실례를 통해 과학계산 프로그래밍 기초를 배운다."
  },
  {
    "courseCode": "MM4006",
    "courseDescription": "이 과목은 전통적인 기초정수론의 기본 개념과 응용,  그리고 소수정리의 바탕이 되는 해석적 정수론의 기초를 학습한다."
  },
  {
    "courseCode": "MM4007",
    "courseDescription": "미적분학과 선형대수학을 기반으로 하여 유클리드 기하와 비유클리드 기하의 이해를 목표로 한다. 특히 곡면 기하를 익히기 위해서는 미분방정식에 대한 기본적인 이해가 필요하며 등거리 변환의 이해를 위해서는 대칭군이 필요하다."
  },
  {
    "courseCode": "MM4008",
    "courseDescription": "이 과목은 과학계산 과목의 심화 과목으로 나노 시대에 필요한 (동력학적) 몬테카를로 방법론 기초, 그리고 그 방법론의 특성과 여러 실레를 통한 몬테카를로 과학 연구 응용에 대해 공부한다."
  },
  {
    "courseCode": "MM4009",
    "courseDescription": "이 과목에서는 컴퓨터이론과 네트워크 이론의 토대가 되는 그래프의 여러 가지 수학적 성질에 대하여 배운다. 그래프와 그에 관련한 여러 가지 기본 개념들, 트리구조, Matching, Factor, Connectivity, Coloring, Planar Graphs, Ramsey Theory등을 엄밀한 증명을 토대로 배우며 Algebraic method, probabilistic method와 같은 방법론도 공부한다. 또한, 실제로 응용되는 분야의 example도 다룬다."
  },
  {
    "courseCode": "MM4010",
    "courseDescription": "이 과목에서는 컴퓨터이론의 토대가 되는 이산구조의 원리와 이산구조를 다루는 다양한 방법을 다룬다. 또한, 수학적 사고가 필요한 기본 논리와 formal mathematical proof에 대한 개념, 방법을 배운다."
  },
  {
    "courseCode": "MM4015",
    "courseDescription": "본 강좌는 자연과학과 공학 전공 학생들 중 계산과학에 관심이 있는 학생들이 선택할 수 있는 수학 기초과목들 중 선택 과목이다. 과학계산 과목은 일명 수치해석이라고도 불린다. 계산과학의 수학적 언어인 과학계산의 소개로부터 시작하여 필수적 개념, 응용 문제들을 다룬다. 과학계산의 기본 문제들인 유한요소법의 초기치 문 제, 경계치 문제, 연립 선형방정식 풀이 방법, 비선형 문제 등에 대하여 학습한다. 추가로 유한요소법 외에 확률론적 방법론인 몬테카알로 (Monte Carlo)를 소개한다."
  },
  {
    "courseCode": "MM4016",
    "courseDescription": "The course is aimed to offer a basic introduction to topological properties of spaces, like continuity, con -vergence, compactness, metric spaces and metrizability. If time permits(although unlikely), the concept of the fundamental group will be discussed."
  },
  {
    "courseCode": "MM4017",
    "courseDescription": "이 과목에서는 Mathematica를 이용한 기호 계산과 이를 응용하여 수학, 과학 및 공학에서 흔히 접하게 되는 다양한 문제의 해법을 익힌다. 주요 주제로는 공식의 변환, 방정식 해법, 미분학, 벡터 해석, 이산 수학, 연산자 해석, 비쥬얼 및 그래픽스 등이 있다. 이를 바탕으로 기호 계산을 응용하여 연결된 시스템 이론, 전자기학, 신호 처리 등을 다룬다."
  },
  {
    "courseCode": "MM4018",
    "courseDescription": "The aim of the course is understanding the topics in mathematical sciences and the application of Math -ematica including the symbolica package.  At the end of each topic, students are required to solve given problems using Mathematica and present the solutions. The first topic is the modelling in mathematical biology, namely Keller Segel model in chemotaxis. The second topic is simple models in general relativity descibed using differential geometry.  The third topic is fluid dynamics, aiming to understand the Navier Stokes equation which is regarded as the most challenging PDE. To understand these topics, knowledges in vector calculus and differential equations are required."
  },
  {
    "courseCode": "MM4019",
    "courseDescription": "이 과목은 측도론을 기반으로 하여 확률 이론을 배우는 과정이다. 확률의 명확한 이해를 위해 측도론의 학습이 필수적이다. 기본적인 측도론을 먼저 배우고 이를 확률공간에 적용하여 다양한 성질들을 유도하고 관련된 응용을 소개한다."
  },
  {
    "courseCode": "FE2101",
    "courseDescription": "에너지 융합 및 신 기후체제를 맞이하여 지속가능 에너지 시스템의 핵심기술인 에너지 변환/저장/전력변환 및 전송/기기제어 분야의 중요성 및 기술적, 정책적 이슈, 또한 이를 통한 산업, 교통/수송, 주거환경의 에 너지 mix 변화에 대해 소개하고, 이러한 기술이 미래 수송 수단(전기차, 수소전기차) 그리고 드론, 로봇, 스마트기기, 사물 인터넷 등의 물류, 가정생활을 어떻게 바꿔 나갈지에 대해 소개한다."
  },
  {
    "courseCode": "FE2301",
    "courseDescription": "이 과목은 기초학부, EECS 및 기타 전공 학생들에게 전기 회로 이론의 기본 요소를 소개한다. 이 과정에 서 다루는 회로 요소 및 분석은 회로 및 시스템, 전력 전자 장치, 제어 및 통신의 고급 분야를 이해하는 기 본 배경이 될 것이다. 회로 변수 및 요소, 회로 분석 기법, RLC 회로, 정현 정상 상태 분석, 회로 분석을 위한 라플라스 및 푸리에 변환 등의 주제가 포함된다."
  },
  {
    "courseCode": "FE3101",
    "courseDescription": "원자력발전소는 정말로 위험한가? 신재생에너지는 얼마나 효율적인가? 전기차는 경제적인가? 정책은 어떻게 기술에 영향을 미치는가? 본 강의는 UC Berkely의 Richard A. Muller 교수 강의인 [대통령을 위한 에너지 강의]를 토대로 하고 있으며 최근 변화에 따라 일부를 수정하였고 새로운 주제들을 추가하였다. 본 강의를 통해 정치사회적으로 논점이 흐려진 에너지 문제를 바라보는 통찰력을 제공하고자 한다. \"대통령\"이라는 키워드를 사용한 이유는 수강생들에게 편향되지 않은 에너지 문제를 바라보는 관점을 제공하기 위함이다."
  },
  {
    "courseCode": "FE3301",
    "courseDescription": "이 과목에서는 산업응용에서 널리 사용되는 여러 가지 기본적인 회로 구성에 대해서 다룬다, 산업용 회로 동작을 이해하기 위해서 기본적인 구성과 관련된 기본 개념들에 대해서도 논의할 예정이다. 이 과목을 통해 배운 개념들은 다른 전력 관련 교과들에 대한 기본적인 배경을 제공할 수 있다."
  },
  {
    "courseCode": "FE4102",
    "courseDescription": "그린에너지 전문가로 갖추어야 할 최소한의 공학적 소양 및 기술적, 정책적 에너지 이슈들이 다룸. 에너지 개념 및 이슈, 열역학 및 반응 기초이론, 이용 가능에너지(석탄, 석유, 천연가스, 원자력 에너지) 및 주요 신.재생에너지(수소, 연료전지, 태양열 및 태양광, 풍력, Bioenergy)의 현황 및 개발 이슈, 주요 에너지 변환 및 저장기술( Battery), 고효율화 에너지 기술(히트펌프, LED,초전도), 기타 환경과 에너지 이슈(기후변화, CCS)등이 집중 학습 한다."
  },
  {
    "courseCode": "FE4201",
    "courseDescription": "다양한 에너지와 전기에너지간 상호 변환, 동종 에너지 간 특성 변환에 대한 이론적 기초를 공고히 하고, 효율적 에너지 변환 및 채집을 위한 재료, 소자, 회로, 및 집적 시스템에 대해 학습 한다."
  },
  {
    "courseCode": "FE4302",
    "courseDescription": "스마트그리드와 풍력, 태양광 등 신재생에너지에 대해 소개하고, 여기에 사용되는 정류기, 인버터, 사이클로 콘버터 등 다양한 콘버터를 설명한다. 그리고 교류회로를 중심으로 수백 가지 실용적인 전력전자기 술의 적용 예를 보인다. 또한 간단한 전력전자회로 설계실습을 해본다."
  },
  {
    "courseCode": "FE4303",
    "courseDescription": "본 강좌는 경영과학이론을 소개하고 이를 바탕으로 전력/에너지시스템의 경제적 특성을 다룬다. 특히, 전력/에너지산업의 전략적 의사결정 이론을 제공한다. 이를 위해 전력/에너지산업의 구조개편과 규제완화로 인한 전력/에너지시스템의 구조적 변화에 대해 경영과학 및 경제학 개념을 접목하여 설명한다. 수강생은 공학자의 전략적 의사결정 문제를 이해할 수 있으며 전력/에너지시스템의 합리적 투자/운영문제를 이해할 수 있다."
  },
  {
    "courseCode": "FE4304",
    "courseDescription": "전력전자공학은 전력반도체 제어를 통한 전력의 변환 및 제어를 다루는 분야로, 본 과목은 전력전자공학의 기본적인 회로 동작 이 해를 목적으로 한다. 널리 사용되는 기본적인 전력변환 회로들이 소개되고 그 동작원리는 정상상태 해석을 통해 이해하도록 한다."
  },
  {
    "courseCode": "FE4306",
    "courseDescription": "본 과목에서는 전력계통의 기본적인 개념에 대해 소개한다. 초반에는 전력시스템의 기본적인 특징인 페이저, 복소 전력, 그리고 삼상회로에 대해 학습한다. 송전계통 분석을 위해서는 변압기, 송전선로 파라미터, 조류계산을 학습한다. 또한, 전력계통의 경제적 운전에 관한 내용을 발전연료비용 최소화 관점에서 학습한다. 전력계통에 대한 물리적 특성에 대해 주로 다루게 되고 경제적 운전을 위한 수학적 기법에 대해서도 다룬다. 기본적인 모델링과 이론을 학습함으로써 더 복잡하고 새로운 시스템에 대해 문제를 확장해나갈 수 있다."
  },
  {
    "courseCode": "FE4307",
    "courseDescription": "본 강의에서는 배전시스템계획, 부하특성, 배전변압기, 선로설계, 배전변전소, 1차 및 2차 배전시스템에 대해서 다룬다. 전압 강하 및 전력손실계산, 커패시터의 적용 방안, 고조파, 전압규정, 시스템 보호, 신뢰도 및 전력 품질의 이슈들도 포함하고 있다. 관련된 이슈들을 이해하기 위해 새로운 주제, 예제, 문제들을 다룬다."
  },
  {
    "courseCode": "FE4308",
    "courseDescription": "이 과목은 전력변환시스템의 구성요소, 회로 및 제어에 대한 이해를 통해, 전력변환시스템을 구현하는 능력을 배양하고자 한다. 구체적으로 구현의 대상이 되는 전력변환시스템은 3상 인버터이다 보니, 회로이론을 배운 초급자가 내용을 이해하고 따라올 수 있도록 필요지식들을 단계적으로 제공할 예정이다. 이 과목의 결과물로서 개별 학생들은 각자 시뮬레이션 툴을 활용하여 인버터 시스템을 구현해보고, 관련 논의가 적힌 보고서를 시뮬레이션 파일과 함께 제출하는 형태로 평가를 받게 된다."
  },
  {
    "courseCode": "FE4310",
    "courseDescription": "본 과목에서는 사람과 AI-infused system의 상호작용에 관한 PBL (Project-Based Learning)을 수행한다. 매년 선정되는 국가 special topics를 다루며, 올해는 최근 부상하는 메타버스와 연계하여 Extended Reality and Digital Twin에 관한 프로젝트를 기획 및 제작한다. 구체적으로 RDW, 차량 XR, SR, NFT 연계 응용을 수행하며, 그 결과물에 대해 IR pitching을 목표로 한다."
  },
  {
    "courseCode": "FE4501",
    "courseDescription": "본 강의에서는 태양전지의 기본적인 원리 및 응용에 대한 내용을 다룰 것이다. 이를 위하여, 본 강의의 내용은 금속 및 반도체 물질 의 광학적, 전기적 특성을 포함할 것이다. 그리고 다양한 종류의 태양전지에 대한 현재 연구현황에 대한 내용도 다루어 질 것이다."
  },
  {
    "courseCode": "MD2101",
    "courseDescription": "본 과목은 학부 학생들을 대상으로 인체로부터 획득할 수 있는 생체 신호와 획득방법에 대해 설명하고 이 를 기반으로 임상에서 실제로 사용되는 진단 및 치료 기술에 대해 그 원리와 시스템에 대해서 소개한다."
  },
  {
    "courseCode": "MD4101",
    "courseDescription": "뇌과학의 발전은 새로운 방법론과 이미징 기술의 진보와 함께 더 가속화되고 있다. 본 과목은 다양한 신경 과학 연구방법론을 소개하고 뇌의 구조 및 기능을 영상화하고 조절하며 in vitro 신경 세포 수준에서부터 뇌절편 그리고 in vivo 동물의 대뇌에서의 연구방법뿐만 아니라 뇌졸중 등의 뇌질환 까지 신경기술 및 신 경광자학적 접근법을 총체적으로 다룬다."
  },
  {
    "courseCode": "MD4102",
    "courseDescription": "본 과목은 새로운 진단 및 치료 중재를 요구하는 일반적인 신경 장애에 대한 기본적인 이해를 학생들에게 제공한다. 더불어 기본적인 신경 해부학, 병리 생리학, 임상 증상, 진단 방법 및 치료 방법을 다루게 된다. 수강생은 신경 질환의 임상 관리를 위한 기본 메커니즘을 이해할 수 있다. 또한, 이 과정은 학생들 에게 일반적인 신경 학적 상태의 전통적인 진단 및 치료 방법을 혁신하는 데 아이디어를 제공할 수 있다."
  },
  {
    "courseCode": "MD4106",
    "courseDescription": "이 교과목은 인체와 감염질환 병원체 즉, 바이러스, 세균, 진균 등과의 상호관계를 소개하는 내용이다. 이 교과목에서는 인체 감염질환의 역사를 포함하여 병원체에 대한 방어기작, 여러 병원체의 특성, 및 새로운 치료제 개발을 위한 실험적 시도 등을 학습한다. 또한 이 교과목을 통하여 최근 인류의 생존을 위협하고 있는 코비드-19 같은 공중감염 질환에 관하여도 학습할 것이다."
  },
  {
    "courseCode": "MD4301",
    "courseDescription": "본 과목에서는 생체신호 및 신경과학 연구에 필수적인 신호처리의 기본적인 지식에 대하여 공부한다. 아 울러 매트랩과 같은 프로그램 언어를 이용하여 신호처리 이론을 실제 구현하여 생리시스템의 신호를 분석 하는 능력도 습득한다."
  },
  {
    "courseCode": "MD4302",
    "courseDescription": "본 과목은 학생들에게 현재 사용되고 있는 영상장비의 물리학적 기본 작동원리와 하드웨어, 그리고 임상 적 응용분야에 대해 소개한다."
  },
  {
    "courseCode": "MD4303",
    "courseDescription": "본 과목의 주된 내용은 생물실험과 의학 연구를 위한 광학현 원리, 광학 현미경의 디자인, 그리고 핵심 이미지 프로세싱이다. 광학 의 기초와 이미지 구성 원리를 시작으로 다양한 일반 광학현미경의 작동원리와 이용을 다룬다. 최근의 제안되고 사용되는 광학현미경을 이용해 얻은 정보(형광, second harmonic, raman signal 등)의 정량적 분석방법을 다룬다."
  },
  {
    "courseCode": "MD4401",
    "courseDescription": "이 강좌는 학부 3-4학년과 석, 박사 초기 과정의 대학원생을 대상으로 한다. 수업을 통해 학생들은 어떻게 생물의 중요한 원리와 기전들이 분자생물학 연구를 통해 밝혀져 왔는지를 학습한다. 이는 학생들이 실제 연구실에서 경험할 분자생물학 연구를 이해하고 설계하는 능력 향상을 돕기 위함이다."
  },
  {
    "courseCode": "MD4402",
    "courseDescription": "이 강좌는 학부 3-4학년과 석, 박사 초기 과정의 대학원생을 대상으로 한다. 수업을 통해 학생들은 어떻게 생물의 중요한 원리와 기전들이 분자생물학 연구를 통해 밝혀져 왔는지를 학습한다. 이는 학생들이 실제 연구실에서 경험할 분자생물학 연구를 이해하고 설계하는 능력 향상을 돕기 위함이다."
  },
  {
    "courseCode": "MD4501",
    "courseDescription": "뇌과학의 발전은 새로운 방법론과 이미징 기술의 진보와 함께 더 가속화되고 있음. 본 과목은 다양한 신경과학 연구방법론을 소개 하고 뇌의 구조 및 기능을 영상화하고 조절하며 in vitro 신경 세포 수준에서부터 뇌절편 그리고 in vivo 동물의 대뇌에서의 연구방법뿐만 아니라 뇌졸중 등의 뇌질환 까지 신경기술 및 신경광자학적 접근법을 총체적으로 다룬다."
  },
  {
    "courseCode": "MD4502",
    "courseDescription": "인간 유전학의 내용과 함께 의학에서 응용되고 있는 다양한 분야를 이해한다. 본 과목은 이와 관련된 유전학 최신 기술현황과 산업 적 특성을 파악하고, 이를 통해 환자에게 적용 가능한 진단, 치료 예방 분야를 개척할 수 있는 기반을 다진다."
  },
  {
    "courseCode": "MD4503",
    "courseDescription": "행동과학은 인간과 동물의 행동과 관련된 사항을 연구하는 과학의 한 분과이다. 본 교과목은 의학 영역에서의 행동과학에 초점을 맞추어 정상 성장 과정, 행동의 심리학적 기초, 정신병리, 의사-환자 관계 등을 살펴보며 인간 행동에 대한 이해를 제고하고자 한다."
  },
  {
    "courseCode": "MD4505",
    "courseDescription": "기본적인 생명현상의 이해를 바탕으로 생체 내 항상성을 조절에 관여하는 호르몬의 생성과 그 작용기전을 뇌, 간, 지방, 근육 등 대사 기관을 중심으로 학습한다."
  },
  {
    "courseCode": "MD4601",
    "courseDescription": "의학 분야에 사용되는 대부분의 용어(“의학용어”)는 라틴어와 그리스어의 어원을 가지고 있다. 의학용어 어원의 기본의미를 파악하며 용어구성 원리를 분석하고 이해하는 원칙을 소개하는 과목으로서 인체 해부학, 생리학, 병리학, 감염학, 약리학 및 임상의학에 서 사용되는 의학용어의 뜻을 이해하는 교육내용이다."
  },
  {
    "courseCode": "GS1001",
    "courseDescription": "일변수 함수의 미적분학을 다루며 기본 개념을 배우고 추상적인 개념의 이해와 응용으로 확장한다. 기본적인 미분방정식을 소개하고 미적분학과 연계된 내용을 다루며 무한수열과 무한급수의 수렴의 정의를 이해하고 무한급수로 나타내어지는 함수의 성질과 응용을 학습한다. 이는 미분방정식, 선형대수학, 다변수 함수에 필요한 다양한 기초 주제의 개념을 쌓기 위함이다."
  },
  {
    "courseCode": "GS1011",
    "courseDescription": "기본적으로 GS1001 과목인 미적분학과 응용과 동일한 주제를 다룬다. 일변수 함수의 미적분학을 다루며 기본 개념을 배우고 추상적인 개념의 이해와 응용으로 확장한다. 기본적인 미분방정식을 소개하고 미적분학과 연계된 내용을 다루며 무한수열과 무한급수의 수렴의 정의를 이해하고 무한급수로 나타내어지는 함수의 성질과 응용을 학습한다. GS1001 과목보다 좀 더 수학적 엄밀성을 추가하고 이공학 응용과 밀접한 연관성을 강조한다."
  },
  {
    "courseCode": "GS1101",
    "courseDescription": "고전 역학과 기본적인 열역학에 대한 개론. 공간, 시간, 힘, 운동량, 각운동량, 에너지, 운동량 및 에너지 보존법칙의 개념이 소개된다. 이러한 기본적인 물리학 개념들은 강체의 동역학, 중심력 문제, 그리고 이상기체의 동역학 이해에 적용된다."
  },
  {
    "courseCode": "GS1102",
    "courseDescription": "이 강좌는 전자기학과 현대물리학에 관한 개론이다. 전하, 쿨롱의 법칙, 전위, 전기 쌍극자, 정전기 에너지, 그 리고 전자기 유도 현상의 개념이 소개되며, 맥스웰의 방정식과 전자기파의 개념, 기하광학과 파동 광학도 다루어진다. 또한 양자역학과 응집물질물리학, 소립자물리학 등의 현대물리학의 기본 개념에 대한 소개가 이루어진다."
  },
  {
    "courseCode": "GS1103",
    "courseDescription": "고전 역학, 고전 전자기학, 특수 상대론, 일반 상대론과 양자물리학의 기본적인 아이디어를 다룬다. 먼저, 고전역학과 전자기학을 중심으로 힘, 운동량, 각운동량, 에너지, 보존법칙들의 개념을 깊이 있게 탐구한다. 또한 최소작용원리와 뉴턴법칙과의 관계, 수학과 물리학의 관계 등을 다룬다. 이후, 상대론/양자물리학을 중심으로 시간과 공간의 개념과 물질의 양자적 본질에 관하여 여러 각도에서 생각해 보고, 이를 바탕으로 고전적 물리 개념들이 어떻게 수 정 되는지 공부한다. 이러한 기본적인 물리 개념들을 중심력 문제, 조화진동자 문제, 강체의 동역학 등에 적용한다."
  },
  {
    "courseCode": "GS1104",
    "courseDescription": "이 강좌는 고급일반물리학I에 이어서 고전 전자기학을 보다 깊이 있게 다룬다. 다변수 함수론과 벡터 해석학의 기초 개념을 익히고 맥스웰 방정식의 의미와 응용을 공부한다. 이것은 자연스럽게 광학으로 이어지며 다양한 파동현상(역학적, 전자기적, 양자역학적)도 함께 다룬다. 열역학의 법칙들, 기체운동론과, 엔트로피를 중심으로 한 통계역학을 공부한다. 마지막으로 현대물리(입자물리, 핵물리, 원자/분자 물리, 응집물질물리, 천체물리, 우주론) 의 다양한 개념들을 간단히 소개한다."
  },
  {
    "courseCode": "GS1111",
    "courseDescription": "이 강좌는 폭넓은 실험을 통해 기본적인 물리학실험 기술과 일반적인 물리학의 원리를 소개하는 것을 목적으로 한다. 실험 주제는 일반물리학 및 연습 I(GS1101) 및 고급일반물리학 및 연습 I(GS1103) 강좌와 관련되며, 고전역학 관련 실험(포사체 운동, 진자운동, 1차원 및 2차원 충돌 등)을 중심으로 하여, 파동 실험, 열역학 실험 등이 포함된다. 데이터 분석과 실험결과의 해석이 특별히 강조된다."
  },
  {
    "courseCode": "GS1112",
    "courseDescription": "이 강좌는 폭넓은 실험을 통해 기본적인 물리실험 기술과 일반적인 물리의 원리를 소개하는 것을 목적으로 한다. 실험 주제들은 일반물리학 및 연습 II(GS1102) 및 고급일반물리학 및 연습 II(GS1104)와 관련된다. 전자기학 관련 실험(전기적/자기적 특성 실험 및 전자공학 관련 실험)과 광학을 주제로 한 실험을 중심으로 구성되어 있으며, 데이터 분석과 실험결과의 해석이 특별히 강조된다."
  },
  {
    "courseCode": "GS1201",
    "courseDescription": "이 과목은 우리 주변에서 일어나고 있는 현상들을 분자 수준에서 화학적으로 이해하기 위해 필요한 기본 원리와 개념들을 다룬다. 화학식과 화학 반응식, 고전역학 및 양자역학적 관점에서 본 원자와 분자의 구조 및 결합이론, 화학 결합, 전이금속 화학, 기체상과 응축상의 성질 등을 소개한다."
  },
  {
    "courseCode": "GS1202",
    "courseDescription": "이 과목은 일반화학1에서 다룬 기본 개념을 바탕으로 열역학, 화학 평형 및 반응 속도론을 체계적으로 배운다. 세분화된 화학의 분야로서 전기화학, 분광학, 재료화학, 고분자 화학, 생화학 등을 소개한다."
  },
  {
    "courseCode": "GS1203",
    "courseDescription": "원자론, 원소의 기원, 원자 구조, 화학 결합, 분자 구조, 분자 간 상호작용 등 화학의 핵심 내용을 하버의 암모니아 합성이나 DNA 이중나선 구조 등을 중심으로 하나의 스토리로 구성한다. 그리고 페랑(아보가드로수), 펜지어스(원소의 기원), 퀴리(방사성 원소), 러더포드(핵 구조), 폴링(화학 결합), 디바이(분자 구조) 반데르발스(기체) 등의 노벨상 수상 강연과 루이스(옥텟규칙), 밀러(화학적 진화) 등의 주요 논문을 읽으면서 발표, 토의식으로 수업한다."
  },
  {
    "courseCode": "GS1204",
    "courseDescription": "고급일반화학 및 연습 1에 이어 펜(화학 열역학), 하버(화학 평형), 허쉬박(화학반응속도), 에르틀(촉매), 아레니우스(산-염기), 왓슨-크릭(DNA), 칼빈(광합성) 등의 노벨상 수상 강연을 중심으로 1학기에 시작한 스토리를 완결한다. 예컨대 하버의 암모니아 합성에 관련된 화학 평형과 반응속도의 원리, 또 아미노산, 단백질 및 DNA의 산-염기 특성, 그리고 광합성에 들어있는 산화-환원의 원리 등을 발표, 토의식으로 수업한다."
  },
  {
    "courseCode": "GS1205",
    "courseDescription": ""
  },
  {
    "courseCode": "GS1211",
    "courseDescription": "화학은 실험이 중심이 되는 학문이다. 이 과목은 화학 실험의 기초가 되는 정량, 분석, 데이터 처리 외에 화학의 기본 개념을 실험을 통해 체 득하는 것을 목표로 한다. 분자 모델링을 통한 분자 구조의 이해, 분자의 극성을 이용한 추출, 유기반응, 크로마토그래피 (TLC, HPLC), 분 광학 (UV-vis, FT-IR) 등을 직접 실험해 봄으로써 화학 실험의 기초 및 최신 분석기기에 대해 배우도록 한다."
  },
  {
    "courseCode": "GS1212",
    "courseDescription": "이 과목은 일반화학 실험 I에서 배운 화학실험의 기초를 바탕으로, 열역학, 분석화학, 생화학, 전기화학, 합성화학 등의 각 분야에서 기초적인 실험을 진행한다. 분광학 및 크로마토그래피 분석 장비, 분자 모델링을 통한 단백질 및 핵산 구조의 이해, 산염기 적정, 화학전지, 태양전지 등을 다루어 봄으로써 화학의 기초 및 응용에 대해 배우도록 한다. 이 과목을 통해 학생들은 화학 및 관련 전공 실험에 필요한 기초를 습득하게 된다."
  },
  {
    "courseCode": "GS1301",
    "courseDescription": "Biology introduces the principles and fundamental concepts of Biology. The course is designed to emphasize on se -lected topics from Cell Biology and Molecular Biology. The topics for the first half will include: Biological Mol- ecules, Macromolecules, Cell Organization and Membranes, Enzymes and Energetics, Mitochondria and Cellular Respiration, and Photosynthesis. The second half of the course will cover the topics such as DNA, RNA and Pro- tein, Genome and Chromatin, Gene Regulation, and Recombinant DNA Technology."
  },
  {
    "courseCode": "GS1302",
    "courseDescription": "Human biology has two primary function to understand how the human body works; and, to understand the relationship of human organs to perform body works. This course briefly introduces the anatomy and physiology of human organs. This course will examine human diseases due to the defects of organ structure and function."
  },
  {
    "courseCode": "GS1303",
    "courseDescription": "이 과목은 앞으로 생물학관련 분야를 전공 또는 부전공으로, 혹은 생명과학분야를 융합적 사고로 다루기 원하는 학생들을 위하여 설계되었다. 생물학에서 다루는 근본적인 주제들은 유사하나 심화된 학습방법을 통해 학생들에게 맞춤형 교육을 제공하는데 목적이 있다. 세포생물학, 생화학, 유전학, 분자생물학 등의 과목에서 선택된 여러 주제들을 종합적으로 심도 있게 다루어 봄으로써, 학생들이 세부 전공 진입 전 에 최신연구의 예를 통해 생명현상의 원리를 이해하고 생명현상의 본질적 기능을 이해하는데 도움이 되도록 설계되었다. 연속된 과목으로 생명과학 실험이론(GS2311)을 추천한다."
  },
  {
    "courseCode": "GS1304",
    "courseDescription": "생명과학에 관심 있는 1, 2학년 및 타전공 대학생들을 위한 강좌로, 생명과학분야 최근 주목받는 연구주제들을 세미나 형식으로 알기 쉽게 소개하여, 현대 생명과학의 동향을 파악할 뿐만 아니라, 나아가서 생명과학의 확장성과 다른 분야와의 연계성에 대해 이해하도록 한다."
  },
  {
    "courseCode": "GS1311",
    "courseDescription": "일반생물학 실험(GS1311)은 생물학(GS1301), 인간 생물학(GS1302), 또는 고급일반생물학 I(GS1303)과 함께 동반하는 생물 필수 실험과목으로 기본적인 생물학 실험 방법과 모든 생명과학 연구실에서 표준으로 사용하는 기본적 테크닉 습득에 목적이 있다. 이 과목을 성공적으로 마침으로, 학생들은 앞으로 독립적 연구를 시작할 수 있는 기본적인 역량을 배양하게 되고, 동시에 고난도의 실험을 수행할 수 있는 기반을 가지게 된다."
  },
  {
    "courseCode": "GS1321",
    "courseDescription": "This course is only available to students who are not majoring in life sciences. The course provides basic concept and solid foundation of biology. Students are expected to demonstrate an understanding of applying biological concepts to their majoring fields after completing the course."
  },
  {
    "courseCode": "GS1401",
    "courseDescription": "컴퓨터 프로그래밍 과목은 대학과정 학생이 컴퓨터 프로그램에 대한 기초적인 지식과, 이를 이용한 문제해결 능력을 습득하도록 하는데 그 목적이 있다. 이를 달성하기 위해서 C 언어의 기본적인 문법을 소개하고, 배열, 포인터, 구조체등의 심화된 내용을 학습하도록 한다. 아울러 실습시간을 통해 C언어를 이용한 프로그래밍을 통하여 실제 문제를 해결하는 능력을 배양하도록 한다."
  },
  {
    "courseCode": "GS1431",
    "courseDescription": "첨단자동차, 항공기, 로봇, 가전기기, 의료기기와 같이 현대문명생활에서 자주 접하는 기기와 첨단제조 및 자동화 생산기계, 초정밀기계와 같은 고도 산업기계 등에서 광범위하게 적용되고 있는 기계공학의 주요 기술과 미래 나노기술, 우주기술, 에너지기술 등의 새로운 첨단기계 공학의 테마를 소개한다."
  },
  {
    "courseCode": "GS1451",
    "courseDescription": "신소재공학은 다양한 학문들 중에서도 미래 과학 기술을 선도하는 학문이라고 할 수 있다. 그 이유는 신소재가 뒷받침되지 않는 미래과학기술의 구현은 거의 불가능하기 때문이다. 본 과목에서는 신소재공학이라는 학문에 대해, 그리고 첨단의 신소재 및 최근의 관련 연구에 대한 동향 등이 다루어진다. 신소재공학부의 중점 연구 분야들인 Healthcare, Energy/Green Tech, Artificial Intelligence(AI), Connected Mobility(Infortainment) 등에 대해서 세계적인 연구 역량을 보여주고 있는 신소재공학부 교원들이 저학년 학부생들이 이해할 수 있는 입문 수준의 강의를 제공한다."
  },
  {
    "courseCode": "GS1471",
    "courseDescription": "환경연구현장의 최신 토픽에 대한 지식과 이해를 넓히는 것을 목적으로 주당 4시간의 현장실습으로 이루어지며 본교 지구환경공학부 대학원, 기업체, 및 국공립 환경연구소(국립환경과학원, 기상청 등)를 방문하여 환경연구 전문가들의 강의를 듣고 연구시설을 견학한다."
  },
  {
    "courseCode": "GS1490",
    "courseDescription": "본 교과목에서는 C언어 혹은 Python 등의 소프트웨어 프로그램의 기초 지식을 다루고, 해당 프로그래밍 언어에 대한 기본 코딩 기법들에 대 해 강의한다. 아울러, 이러한 소프트웨어 코딩 기술을 활용하여 다양한 실세계 문제의 해결 능력의 배양을 목표로 한다."
  },
  {
    "courseCode": "GS1491",
    "courseDescription": "Big-data가 축적되면서 Machine Learning과 Deep Learning 기술이 발전했고 개발자가 실제로 구현할 수 있는 Framework나 Library 가 등장하여 AI Service 구축이 용이해지고 있다. Machine Learning 분야의 표준 언어인 Python을 기반으로 Tensorflow를 이용해 Re- gression, Classfication, Convolutional Neural Networks(CNN), Recurrent Neural Networks(RNN), Long Short-Term Memory models (LSTM), Generative Adversarial Networks (GAN)등을 실습하며 Deep Learning의 기초를 익히고 AI를 이해한다."
  },
  {
    "courseCode": "GS1492",
    "courseDescription": "Computational thinking is the process of approaching a problem in a systematic manner and creating and expressing a solution such that it can be carried out by a computer. But you don't need to be a computer scientist to think like a computer scientist! In fact, we encourage students from any field of study to take this course. Many quantitative and data-centric problems can be solved using computational thinking and an understanding of computational thinking will give you a foundation for solving problems that have real-world, social impact. In this course, you will learn about the pillars of computational thinking, how computer scientists develop and analyze algorithms, and how solutions can be realized on a computer using the Python programming language. By the end of the course, you will be able to de -velop an algorithm and express it to the computer by writing a simple Python program. This course will introduce you to people from diverse professions who use computational thinking to solve problems. You will engage with a unique community of analytical thinkers and be encouraged to consider how you can make a positive social impact through computational thinking."
  },
  {
    "courseCode": "GS1496",
    "courseDescription": "In this course on Linear Algebra we look at what linear algebra is and how it relates to vectors and matrices. Then we look through what vectors and matrices are and how to work with them, including the knotty problem of eigenvalues and eigenvectors, and how to use these to solve problems. Finally  we look at how to use these to do fun things with datasets - like how to rotate images of faces and how to extract eigenvectors to look at how the Pagerank algorithm works. Since we're aiming at data-driven applications, we'll be implementing some of these ideas in code, not just on pencil and paper. Towards the end of the course, you'll write code blocks and encounter Jupyter notebooks in Python, but don't worry, these will be quite short, focussed on the concepts, and will guide you through if you’ve not coded before. At the end of this course you will have an intuitive understanding of vectors and matrices that will help you bridge the gap into linear algebra problems, and how to apply these concepts to machine learning."
  },
  {
    "courseCode": "GS1497",
    "courseDescription": "This intermediate-level course introduces the mathematical foundations to derive Principal Component Analysis (PCA), a fundamental dimensionality reduction technique. We'll cover some basic statistics of data sets, such as mean values and variances, we'll compute distances and angles between vectors using inner products and derive orthogonal projections of data onto lower-dimensional subspaces. Using all these tools, we'll then derive PCA as a method that minimizes the average squared reconstruction error between data points and their reconstruction. At the end of this course, you'll be familiar with important mathematical concepts and you can implement PCA all by yourself. If you’re struggling, you'll find a set of jupyter notebooks that will allow you to explore properties of the techniques and walk you through what you need to do to get on track. If you are already an expert, this course may refresh some of your knowledge."
  },
  {
    "courseCode": "GS1498",
    "courseDescription": "This course offers a brief introduction to the multivariate calculus required to build many common machine learning tech -niques. We start at the very beginning with a refresher on the “rise over run” formulation of a lope, before converting this to the formal definition of the gradient of a function. We then start to build up a set of tools for making calculus easier and faster. Next, we learn how to calculate vectors that point up hill on multidimensional surfaces and even put this into action using an interactive game. We take a look at how we can use calculus to build approximations to functions, as well as helping us to quantify how accurate we should expect those approximations to be. We also spend some time talking about where cal -culus comes up in the training of neural networks, before finally showing you how it is applied in linear regression models. This course is intended to offer an intuitive understanding of calculus, as well as the language necessary to look concepts up yourselves when you get stuck. Hopefully, without going into too much detail, you’ll still come away with the confidence to dive into some more focused machine learning courses in future."
  },
  {
    "courseCode": "GS1499",
    "courseDescription": "※International Students OnlyThis course introduces the basics of Python 3, including conditional execution and iteration as control structures, and strings and lists as data structures.  You'll also learn to draw reference diagrams as a way to reason about program executions, which will help to build up your debugging skills. The course has no prerequisites. It will cover Chapters 1-9 of the textbook \"Fundamentals of Python Programming,\" which is the accompanying text (optional and free) for this course. The course is for you if you're a newcomer to Python programming, if you need a refresher on Python basics, or if you may have had some exposure to Python programming but want a more in-depth exposition and vocabulary for describing and reasoning about programs. This is the first of five courses in the Python 3 Programming Specialization. This course covers all the basics of software programming, such as C and Python, and teaches the coding techniques relevant to the software programming. Also, this course focuses on fertilizing the ability to apply the software program -ing to tackling a variety of real-world problems."
  },
  {
    "courseCode": "GS1511",
    "courseDescription": "이 과목은 학생들의 논리적인 의사소통 능력을 함양하는 것을 목표로 한다. 논리적 글쓰기 과정이 사회적 상호 작용이라는 전제 아래, 수강생들은 논리적 글쓰기의 단계들을 차례로 학습하고 함께 토론한다. 따라서 이 과목의 학습은 ‘지식의 습득’이 아니라 글을 통한 ‘문제 해결의 과정’을 익히는 것에 중점을 둔다."
  },
  {
    "courseCode": "GS1512",
    "courseDescription": "이 과목은 학생들로 하여금 종합적인 한국어 능력을 갖추어 교양인다운 언어생활을 하는데 도움을 줄 뿐만 아니라, 대학 생활에서 꼭 필요한 학술적 글쓰기의 기본 이론을 배우고 실제 글쓰기 실습을 통해 대학에서 요구하는 학술적 글쓰기를 분석하는 독해 능력을 기르게 한다. 둘째, 글쓰기 실습과 교수의 첨삭, 대면지도를 통해 정확한 글쓰기 능력을 기른다. 셋째, 한 편의 완결된 보고서를 준비하고 완성하는 과정에서 발표와 토론 능력을 기른다."
  },
  {
    "courseCode": "GS1513",
    "courseDescription": "이 수업에서는 글쓰기에서 창의성의 개념과 의의, 창의성을 구성하는 제반 요소를 배우고, 이러한 지식을 다양한 내용과 형식의 글쓰기 실습에 활용함으로써 창의적인 글을 쓰는 훈련을 할 것이다. 수강생들은 이 수업을 통해 의사소통 능력을 함양하고, 창의적으로 사고하고 표현하는 능력을 신장시키게 될 것이다."
  },
  {
    "courseCode": "GS1531",
    "courseDescription": "이 수업은 과학기술분야의 지식을 일반 독자들에게 쉽고 명료하게 전달하는 글쓰기의 방법을 배우고 실습하는 것을 목표로 한다. 수강생들은 이 수업에서 최소한의 간단한 도구만을 사용하여 과학 이론을 설명하고, 어린이를 위한 과학 이야기를 쓸 것이며, 학기 마지막에는 과학 에세이를 작성하고 토론할 것이다."
  },
  {
    "courseCode": "GS1532",
    "courseDescription": "이 강의는 한국의 고전 텍스트들을 중심으로 심층적인 독해와 토론을 진행하고 이를 바탕으로 선인들의 글쓰기와 관련한 여러 가지 생각과 방법을 이해하는 데 목적이 있다. 아울러 이를 통해 오늘날 우리의 문제를 비판적이고 창의적으로 바라보며, 그 해결의 실마리를 마련하기 위하여 다양한 글쓰기를 시도해 본다."
  },
  {
    "courseCode": "GS1533",
    "courseDescription": "인간이 인식하고 사고하는 한, 비평은 자연스러운 행위이다. 비평적 글쓰기는 세계의 다양한 산물과 현상으로부터 질문을 발견하고, 이를 새로운 맥락으로 재배치하는 작업이다. 이 교과목에서 수강생은 스스로 문제를 생산하고, 이론적 탐구를 통해 다양한 담론과 접속한다. 나아가 그 결과물을 글쓰기를 매개로 타인과 공유함으로써, 비판적 감식안을 갖춘 해석적 공동체의 일원으로 성장한다."
  },
  {
    "courseCode": "GS1601",
    "courseDescription": "This course is an integrated skills course designed to improve English proficiency in all areas of usage, with a particular emphasis on writing skills. Students will practice writing paragraphs and simple essays in a variety of genres including, but not limited to, description, narration, process/sequencing, and opinion. Emphasis will be placed on experienc -ing the steps of the writing process as well as on introducing the concepts of paraphrasing/summarizing and citation."
  },
  {
    "courseCode": "GS1603",
    "courseDescription": "Presentation and Discussion forms an important part of students’ academic careers at GIST College. Therefore, it is important for the English program to support students in their advancement of English proficiency, which can be applied to all courses where academic discourse is required. In this course, students are given the opportunity to develop their English proficiency through monitored class discussions and feedback, structured presentations and individual and group activities and assignments."
  },
  {
    "courseCode": "GS1605",
    "courseDescription": "This course provides the foundations for verbal communication in order to effectively maneuver within an English aca -demic and professional environment. Key components of discourse such as asking questions, expressing opinions, compromising, contradicting, and generally navigating through English conversation will be introduced and further developed."
  },
  {
    "courseCode": "GS1606",
    "courseDescription": "As students at a science and engineering research institute, GIST undergraduates will certainly encounter peer-re -viewed research articles. This course is designed to prepare them for these advanced reading experiences and to give them confidence and familiarity with science article genres. The first half of the course focuses on articles from popular science magazines, emphasizing the structures that will be used in GS2652. The second half of the course introduces abstracts and IMRD, giving students tools to break-down and understand complex peer-reviewed articles. This work will prepare students for future lab research as juniors and seniors."
  },
  {
    "courseCode": "GS1902",
    "courseDescription": "※ International students onlyThe purpose of this course is to introduce students to the fundamentals of the Korean language. Students will learn how to recognize and write Korean characters (Hangul) before being taught basic phrases and expressions that will make their everyday lives in Korea easier."
  },
  {
    "courseCode": "GS1903",
    "courseDescription": "※ International students onlyIn this course, students will develop a more advanced ability to speak about everyday topics in Korean, while also learning more advanced grammar and vocabulary."
  },
  {
    "courseCode": "GS1904",
    "courseDescription": "※ International students onlyThis course challenges students to become more fluent in everyday Korean conversation and teaches students how to express their ideas and feelings more effectively."
  },
  {
    "courseCode": "GS1905",
    "courseDescription": "※ International students onlyThe purpose of this course is to provide more advanced students with the necessary skills to complete certain stages of the TOPIK (Test of Proficiency in Korean) or to prepare themselves for higher-level study of the Korean language in the future."
  },
  {
    "courseCode": "GS1906",
    "courseDescription": "※ International students onlyThis course aims to help students better understand technical terminology in science and engineering by exploring the details of technical vocabulary and their Pure Korean, Sino-Korean or foreign Korean origins. In practice, students learn the importance of Korean prefixes and suffixes, and how they can be used to better understand key terminology in their research fields."
  },
  {
    "courseCode": "GS2001",
    "courseDescription": "다변수 함수/벡터함수의 미적분학을 다루며, 기본개념 및 응용을 다룬다. 벡터함수의 연속성, 미분가능성, 방향미분, 기하학적 구조해석을 기본으로 하여 다중적분, 선적분, 면적분에 관한 이론을 이해한다. 학생들은 이 과목을 통해 추상적인 개념을 정립하고 수학적 엄밀성을 높인 기초적인 증명방법을 배울 수 있다."
  },
  {
    "courseCode": "GS2002",
    "courseDescription": "이 교과에서는 수학 및 공학의 필수인 미분방정식의 정립 및 풀이와 자연과학 및 공학에의 응용에 대하여 공부한다. 상미분방정식의 해의 존재 및 단일성, 선형미분방정식 및 선형 연립 미분방정식, 라플라스 변환방법, 푸리에 시리즈; 편미분 방정식의 개요 및 수치 해석적 풀이 등에 대하여 배운다."
  },
  {
    "courseCode": "GS2004",
    "courseDescription": "선형대수학은 수학교과의 기본 필수 과목이며 미적분학과 더불어 이공계 전공 학부의 필수 과목이다. 이 강좌에서는 선형대수의 기본 개념인 벡터 공간과 이들 사이의 선형변형 및 이를 나타내는 행렬에 관한 이론을 심도 있게 배우고 기하학, 미분방정식 외 신호처리, 제어이론 등 공학 전공에서의 응용과 활용을 배운다."
  },
  {
    "courseCode": "GS2006",
    "courseDescription": "이 교과목은 기초수학 필수과목을 모두 수강한 학생들이 이후에 수학분야의 상위과목(선택과목)이나 추론과 추상화가 필요한 과목들을 수강하려는 경우에 선수과목으로 활용할 수 있다. 수학의 여러 분야의 가장 기초가 되는 개념과 엄밀한 증명 과정을 배움으로써 수학적 사고를 기르고 추상화 시키는 방법을 배운다. 공리, 정의, 정리, 증명 등의 정확한 의미, 증명의 방법, 추론 방법 등을 소개하고 이를 적용하는 훈련을 한다."
  },
  {
    "courseCode": "GS2007",
    "courseDescription": "수학적 사고를 기르고 공리체계에서 엄밀하게 증명하는 방법을 훈련한다. 논리력을 기르기 위해 수학 텍스트를 정확하게 해석할 수 있어야 하며 자신의 생각을 정확하게 언어로 표현할 수 있어야 한다. 이에 텍스트강독, 토론, 그리고 수학적 글쓰기(증명)를 배운다. 수학적 사고를 위해 필요한 기본방법을 배운다. (수체계, 함수, 귀납법을 기본으로 하며 정수론의 기초, counting, 실수의 연속성, 무한의 개념, 함수의 연 속성, 복소수체계도 다룬다.) 또한, 실생활이나 다른 학문의 다양한 분야에서 수학적 사고가 활용된 예를 찾아보고 분석한다. 제대로 쓰이는 예와 잘못된 예를 구분할 수 있는 사고력을 기른다."
  },
  {
    "courseCode": "GS2013",
    "courseDescription": "기초 미분방정식의 정립 및 풀이와 응용을 학습한다. 그중에서도 선형대수학과 교집합에 놓여있는 선형미분방정식과 선형시스템을 중심으로 그에 관련된 선형대수학의 기본 정리를 응용 위주로 학습한다. This course is intended for engineering and science students who require basic/introductory knowledge of differential equations and essential linear algebra. Included are the introduc -tory techniques of solving, and applications of, ordinary differential equations with emphasis on linear equations and systems. The course also covers connected topics in linear algebra: matrix operations, vector spaces, linear trans -formations, eigenvalues and eigenvectors, inner products and norms, orthogonality, linear dynamical systems and applications."
  },
  {
    "courseCode": "GS2104",
    "courseDescription": "이 과목의 목적은 주요 물리학 이론을 역사적인 맥락에서 소개하고 관련된 철학적 쟁점을 이해하는 것이다. 먼저 역학, 전자기학, 통계역학과 같은 고전물리의 역사적 발전과정과 이에 기반한 결정론적인 세계관을 논의한다. 이어서 상대론과 양자물리 등 현대 물리의 태동과 발전, 철학적인 함의를 논의하고 이와 관련된 세계관을 다룬다. 마지막으로 물리학과 다른 과학과의 관련성을 이해하고, 빅히스토리의 관점에서 물리학을 조망한다."
  },
  {
    "courseCode": "GS2202",
    "courseDescription": "물리화학 1에서는 물질의 물리적 변화 및 화학반응을 거시세계의 입장에서 기술하기 위한 열역학 및 기초적인 통계역학을 다룬다. 열역학법칙과 자유에너지의 개념을 배우고, 이들을 사용하여 상평형, 화학반응, 이상용액과 같은 다양한 물리 및 화학적 현상을 이해한다. 또한, 화학평형을 분자수준에서의 이해하기 위한 기초적인 통계역학 개념들도 소개될 것이다. 다루어질 주요 주제는 평형과 가역성, 이상기체와 비이상기체, 에너지, 엔트로피, 자유에너지, 상변이, 화학반응 평형, 이상용액 등이다."
  },
  {
    "courseCode": "GS2206",
    "courseDescription": "화학연구에 관심이 있고 화학 기초과목을 수강한 2~3학년 학생들을 대상으로 하며, 2~3명의 학생이 하나의 소그룹을 이루어 합성화학, 물리화학, 생명화학 중 한 분야의 주어진 문제를 해결하기 위하여 문헌조사, 실험준비, 실험수행, 자료 분석, 결과 발표, 보고서 작성 등 일련 의 과정을 스스로 수행하도록 한다."
  },
  {
    "courseCode": "GS2311",
    "courseDescription": "생명과학실험이론은 앞으로 생명과학분야를 전공 또는 부전공으로, 혹은 생명과학분야를 융합적 사고로 다루기 원하는 학생들을 위하여 설계된 선택과목이다. 선수과목으로 학생들에게 생물학(GS1301) 또는 고급일반생물학(GS1303) 그리고, 일반생물학 실험(GS1311)의 이수를 요구한다. 생명과학실험이론은 심화된 생물학 실험 원리와 방법을 개인별 실습을 통해 습득함과 동시에 독립적 연구자로서 목적에 맞는 실험을 학생 스스로 계획하고 실행하는 방법을 학습하는데 목적이 있다. 이 과목을 성공적으로 마침으로, 학생들은 앞으로 독립적 연 구를 시작할 수 있는 능력과 가설을 세워 실험설계 및 수행을 스스로 할 수 있는 역량을 키우게 된다. 연속된 과목으로 유전자발현 및 분석(GS3311)을 추천한다."
  },
  {
    "courseCode": "GS2408",
    "courseDescription": "객체지향 프로그래밍 학습에 역점을 둔 자바 언어 교과목이다. 본 과정은 객체지향 프로그램의 기초 개념인 클래스, 캡슐화, 다형성, 상속을 포함하고, GUI 및 병행 프로그램 기초 기법을 포함한다. 자바는 모바일 응용 어플리케이션에서 가장 많이 사용하는 언어이다."
  },
  {
    "courseCode": "GS2420",
    "courseDescription": "컴퓨터 원리 수업에서 배운 원리에 기초하고, “알고리즘 기반 사고”의 수학적 개념과 과정에 대해 배우며, 파이썬에서 몇 가지 중요한 그래프 알고리즘을 구현한 다음 이 알고리즘을 사용하여 두 개의 큰 실제 데이터 세트를 분석한다. 주요 핵심은 알고리즘과 이러한 알고리즘에 의해 분석되고 있는 데이터 집합의 구조 사이의 상호작용을 이해한다."
  },
  {
    "courseCode": "GS2421",
    "courseDescription": "‘알고리즘 사고’의 수학적 개념과 과정 속에서 학생들을 훈련시키기 위해 마련되어 있어 계산 문제에 대한 더 간단하고 효율적인 해결책을 만들 수 있다. 파이썬에서 이러한 기법을 통합한 몇 개의 알고리즘을 구현한 다음 이 알고리즘을 사용하여 두 개의 큰 실제 데이터 세트를 분석해 본다. 주요 핵심은 알고리즘과 이러한 알고리즘에 의해 분석되고 있는 데이터 집합의 구조 사이의 상호작용을 이해한다."
  },
  {
    "courseCode": "GS2471",
    "courseDescription": "지구환경과학은 환경현상을 이해하기 위해서 특화된 물리, 화학, 생물, 지구과학 등의 기초과학을 기반으로 공업수학, 역학, 유·무기화학, 전기화학 미생물학에 이르는 다양한 환경매체의 현상을 해석할 수 있는 전문 교육에 중점을 두고 있다. 기후변화 대응, 환경오염 방지 등 지속가능한 사회 구현을 위한 지식과 경험을 보유할 수 있는 교육을 실시한다."
  },
  {
    "courseCode": "GS2472",
    "courseDescription": "Ever since the Paris agreement in 2015, every country around the world has started to deal with the current cli- mate change vigorously in order to comply with the Paris agreement and to regulate environmental impacts that are about to return to themselves. However, most of Koreans still don’t understand how the new climate regime can have impacts on them, or how to prepare for the climate change in the future. In this context, to stimulate students, this course is going to cover from the definition of climate change to promising 4th industrial revolution technologies which will be useful in the new climate regime. The current course is going to give us an opportunity to contemplate our future."
  },
  {
    "courseCode": "GS2473",
    "courseDescription": "대기학, 해양학, 생태학을 아우르는 지구과학 분야와 수처리 및 에너지 관련 환경공학 분야의 다양한 연구주제를 소개하여 지구환경과학 및 공학 분야에 대한 흥미를 유발하고 환경학의 중요성과 필요성을 강조하고자 한다."
  },
  {
    "courseCode": "GS2474",
    "courseDescription": "앞으로 인류가 만들어 가야하는 지속가능 발전의 세상에 대한 기본 개념을 소개하는 교과목이 필요하며, coursera에서 인기 있는 강의 자료를 이용한 온라인 수업과 오프라인 논의를 함께 하는 교과목을 만들고자 한다."
  },
  {
    "courseCode": "GS2475",
    "courseDescription": "This course provides students an introduction to major issues related to environmental pollution with emphasis on causes, pathways, risks, mitigation and prevention. By the end of this course, students will have a good and better understanding of the dynamic nature of human-environment relationships, and the multidimensional characteristics of environmental pollution, through the use of international examples. Special emphasis will be placed on issues related to climate change,  loss of biodiversity, soild and hazardous waste, and pollution prevention."
  },
  {
    "courseCode": "GS2503",
    "courseDescription": "이 교과목은 한국 현대 소설을 통하여, 수강생들의 미학적 윤리적 지평을 넓히는 것을 목적으로 한다. 동시대 한국 소설 텍스트의 이해를 통해 스스로의 삶을 반성적으로 사유하고, 자신이 속한 공동체를 바라보는 새로운 시각을 도모한다. 이와 아울러 한국 현대 소설을 감상하고 분석함으로써, 적극적이고 능동적인 독자가 되는 길을 찾는다."
  },
  {
    "courseCode": "GS2506",
    "courseDescription": "이 과목은 1950년 이전까지 한국 현대 시사에서 중요한 시인들인 한용운, 김소월, 정지용, 백석, 서정주, 윤동주에 대하여 다룬다. 수강생들은 각 시인들에 대하여 조사 연구하고 시집을 면밀히 읽고 토론할 것이다. 그리고 각 시인들의 시세계에 대한 온전한 이해를 위하여 수강생들은 시인들의 작품에서 영감을 받은 시를 창작할 것이다."
  },
  {
    "courseCode": "GS2507",
    "courseDescription": "수강생들은 이 수업을 통해 일반적인 시의 이론을 이해하고 동서고금의 다양한 시작품들을 읽어보게 될 것이다. 이를 통해 수강생들은 시란 무엇인지 스스로 생각해보며 자신의 삶을 시적으로 변화시켜 나갈 수 있을 것이다."
  },
  {
    "courseCode": "GS2509",
    "courseDescription": "수강생들은 이 수업을 통해 일반적인 이론을 이해하고 동서고금의 다양한 시작품들을 읽어보게 될 것이다. 이를 통해 수강생들은 시란 무엇인지 스스로 생각해보며 자신의 삶을 시작으로 변화시켜 나갈 수 있을 것이다."
  },
  {
    "courseCode": "GS2510",
    "courseDescription": "이 강의는 한국의 고전 텍스트들을 감상하고 그 사상적 맥락을 이해하는 데 목적이 있다. 이를 통해 문학과 사상의 관련 양상을 이해한다. 아울러 이러한 문학 사상에 대한 이해를 오늘날 우리 문제를 비판적이고 창의적으로 바라보는 데 적용해 보고자 한다."
  },
  {
    "courseCode": "GS2511",
    "courseDescription": "수강생들은 다양한 작품을 읽고 시의 구조와 언어에 대해 토론할 것이다. 다양한 시적 언어를 배우고 이해하게 될 것이며, 시적 사유의 전개 방식을 이해하게 될 것이다."
  },
  {
    "courseCode": "GS2512",
    "courseDescription": "20세기 이후 한국 소설이 상상/재현해온 ‘여성’은, 재래의 관습과 통념들에 문제를 제기하며 한국 문학의 지평을 확장해 왔다. 특히 이 교과목은 식민지 시기에서부터 현재에 이르기까지 한국 여성 소설이 발굴하고 개척해 온 문학의 새로운 주제, 감정, 형식 등을, 당대의 사회문화적 맥락 아래 검토한다. 수강생들은 결혼과 가족, 연애와 사랑 등 친밀성과 섹슈얼리티의 제반 영역들 뿐 아니라, 근대화, 민주화, 세계화 등 의 지각변동 속에서 한국 소설이 ‘여성이라는 문제’를 어떻게 발견해 왔는지를 탐구하게 될 것이다."
  },
  {
    "courseCode": "GS2521",
    "courseDescription": "이 강좌는 ‘영웅’과 ‘반영웅’의 개념을 중심으로 서구 근대문학의 특징을 고찰한다. 고대 서사시나 비극 혹은 중세 기사도 로만스의 정통 영웅과 달리, 서구 근대문학의 ‘영웅’은 전통, 계급적 질서, 사회적 가치와의 필연적 갈등 속에 존재하며, 그만큼 ‘반영웅’과의 경계에 가까이가는 주인공이다. 이 강좌에서는 우선 서구 근대문학의 가장 독특하고도 흥미로운 (반)영웅인 ‘돈키호테’의 재현양식을 통해 서구 근대문학의 특징을 살펴본 후, 이어서 현대에 이르는 다양한 영웅과 반영웅의 변형을 탐구한다."
  },
  {
    "courseCode": "GS2522",
    "courseDescription": "‘성장소설’ 혹은 ‘교양소설’은 서구 근대문학의 주요 장르로, 주제와 서사 양면에서 근대 소설의 발전에 핵심적 역할을 한 장르이다. 이 강의에서는 대표적인 백인 남성 서사인 19세기 성장소설과 비백인(과) 여성의 관점을 담은 현대의 성장소설을 함께 이해하고 토론한다."
  },
  {
    "courseCode": "GS2523",
    "courseDescription": "The primary purpose of this course is to provide students with first-hand experience of reading and discussing some of the most accomplished and celebrated short stories in the English language, and thereby to foster their interest and appreciative skills in literary reading. The stories select for this course range from nineteenth-century short-story clas -sics to robot/animal narratives of the recent decades. Students can choose to read the stories in the English original, in Korean translation, or both, and the extent of English use in class can be negotiated to accommodate students’ needs and preferences, with the possible exemption from curved grading as incentive for English-medium class."
  },
  {
    "courseCode": "GS2524",
    "courseDescription": "‘웃음’은 웃기는 사람에게서나 웃는 사람에게서나 유연하고 영리하고 창의적인 정신활동의 지표이며 (슬랩스틱이 아니고서는) 고도의 언어적 감수성을 요한다. 그러한 ‘웃음’의 근원적 의미와 힘을 이해하기 위해 이 강의는 영문학을 중심으로 희극의 다양한 하위 장르와 단편소설 작품을 선별하여 읽고자 한다. (영문학) 희극의 대표적 유형인 셰익스피어의 로맨틱 코미디, 익살극, 풍속 희극, 부조리극 작품들을 읽으며, 말장난, 위트, 아이러니, 벌레스크, 복장도착 등 웃음을 불러일으키는 다양한 수사적, 상황적 기법들을 살펴볼 것이다. 또한 일시적인 즐거움을 주는 데서 그치는 것이 아니라, 유연하고 자유로운 사고를 가능하게 하고 더 나아가서는 현실의 권력관계를 뒤집어 풍자와 축제적 전복까지 가능하게 하는 희극과 웃음의 다층적 역할에 관한 철학적 논의들을 함께 고찰할 것이다."
  },
  {
    "courseCode": "GS2525",
    "courseDescription": "‘모험’(adventure)은 근대적 기획의 표상이자, 대항해 시대 이후 서구의 근대를 가능하게 한 물리적, 경제적 동인이다. 이 강좌는 서구 근대문학의 중요한 장르인 ‘모험’ 문학의 주요작들을 그에 대한 현대의 ‘되받아쓰기’ 작품 또는 비판적 응답과 함께 읽음으로써 서구 근대(문학)에 대한 이해를 심화하고자 한다."
  },
  {
    "courseCode": "GS2526",
    "courseDescription": "이 강좌는 문학의 빼놓을 수 없는 주제인 ‘사랑’을 다룬 다양한 장르의 작품을 통해서, 단순한 연애의 차원이 아니라 각 개인으로 하여금 사회적 구속과 억압은 물론 현재의 불완전한 자신마저도 뛰어넘는 것을 꿈꾸고 이루게 하는 원천, 즉 낭만적, 해방적 열망으로서의 사랑을 탐구하고자 한다."
  },
  {
    "courseCode": "GS2541",
    "courseDescription": "음악의 기본구성과 기초적인 지식들을 이해하고, 이를 통해 서양음악의 각 시대를 대표하는 작곡가와 음악의 특성을 이해한다. 또한 시대의 대표적인 중요한 곡들의 감상을 통하여 서양음악의 다양한 흐름을 이해하고, 현대음악에 미친 영향 등을 살펴본다."
  },
  {
    "courseCode": "GS2542",
    "courseDescription": "서양 융합예술의 고전인 오페라 탄생의 원인과 발전양상, 형식과 구성요소를 이해하고 구비문학에 기반을 둔 한국의 전통 음악극인 판소리 양식의 특징은 무엇인지 살펴본다. 이를 통해 두 음악극 장르의 사회적 배경과 예술적 가치, 문화적 의의 등을 종합적으로 고찰한다."
  },
  {
    "courseCode": "GS2543",
    "courseDescription": "19세기 중엽 이래 예술은, 예술가의 비판적 자의식과 미적 감수성, 작품을 둘러싼 비판적 담론의 급진성을 통해 도구적 합리성이 지배하는 자본주의적 사회에서 대항담론(counter-discourse)으로 기능해왔다. 모더니즘, 포스트모더니즘, 다원주의 문화와 같은 용어로 차별화되는 복잡다단한 예술의 경향, 특성을 이해하고 감수성에 기초한 대안적 세계를 상상해보자."
  },
  {
    "courseCode": "GS2544",
    "courseDescription": "문화의 힘이 강조되는 디지털 시대에 이르러 문화산업의 중심으로 자리 잡은 문화콘텐츠는 문화의 범위만큼이나 다양한 분야를 포괄한다. 본 강의는 문화콘텐츠의 개념과 문화원형, 스토리텔링을 이해하고 매체들의 특징과 활용사례를 살펴봄으로써 문화와 기술, 상상력과 융합의 문제에 대한 고찰을 목적으로 한다."
  },
  {
    "courseCode": "GS2581",
    "courseDescription": "※ International students onlyThis course's aim is to help students gain awareness and understanding of Korean culture from its traditional roots to modern daily life, not only through books and lectures but also through practical lessons. In practice, students will learn the keys to understanding the Korean people and culture."
  },
  {
    "courseCode": "GS2582",
    "courseDescription": "※ International students onlyThe objective of this course is to help students understand the history of Hangeul, which was created under King Se -jong the Great, and the history of the people who contributed to its development and perseverance."
  },
  {
    "courseCode": "GS2601",
    "courseDescription": "오늘날 동아시아 지역(한국, 중국, 일본 등이 중심)은 정치, 경제, 문화적으로 세계를 움직이는 중심축의 하나가 되어가고 있다. 이에 따라 ' 동아시아 공동체'를 구성하기 위한 논의가 활발해지고 있다. 지리적, 문화적으로 과연 동아시아는 공동체를 형성할 만큼 공통적 성격이 있는가를 우선 살펴 볼 것이다. 다음으로, 근대 개항 이후 서양세력에 굴복 또는 위축되었던 이 지역이 어떠한 변화과정을 거쳐 오늘날과 같이 세계를 움직이는 세력으로 발전하여 왔는가를 역사적으로 검토할 것이다. 자연과학을 전공하려는 학생들에게 동아시아의 역사와 문화를 이해하게 하여, 동아시아의 정체성을 파악한 세계 속의 동아시아인이 되도록 한다."
  },
  {
    "courseCode": "GS2602",
    "courseDescription": "한국사의 흐름 가운데 현재까지 여전히 재해석이 이루어지고 있는 사건, 인물에 대해 다양한 시각으로 검토하는 것이 강의의 목표이다. 강의 중에는 사료(史料)와 박물관 유물을 감상하고, 여러가지 역사 창작물에 대한 의견을 나누어볼 예정이다. 학생들이 역사적 사건과 인물들의 삶을 검토하면서 현재의 자신을 돌아보고 미래를 계획할 수 있는 계기가 되기를 기대한다"
  },
  {
    "courseCode": "GS2603",
    "courseDescription": "한국과 중국, 일본을 대상으로 19세기 중엽 이후의 근대화 과정을 비교 검토한다. 서양에 대한 대응형태의 차이를 전통문화의 성격과 서양열강 의 개항요구의 차이에서 찾아보고, 개화에 대한 각국의 노력과 좌절의 과정, 그리고 오늘의 성취에 이르기 까지를 역사적으로 검토하여 본다."
  },
  {
    "courseCode": "GS2611",
    "courseDescription": "본 강좌는 근대 이후 국제관계의 역사적 흐름을 고찰하여, 21세기 세계와 한국이 당면하고 있는 국제정치의 여러 문제를 이해할 수 있는 토대를 마련하는 데 목표가 있다. 특히, 본 수업의 주요 내용은 17세기 30년 전쟁 이후의 베스트팔렌 체제로부터 출발하여, 18세기 본격적 인 국제관계의 성립, 19세기 열강 정치와 제국주의, 그리고 20세기 이데올로기 경쟁 및 냉전 종식까지의 국제관계의 변화가 될 것이다."
  },
  {
    "courseCode": "GS2612",
    "courseDescription": "본 강의는 서양의 고대와 중세사회의 주요 문제를 고찰하고, 그것이 서양문명의 형성에 끼친 영향에 대하여 이해하는 것을 목적으로 한다. 강의의 주요 내용은 크게 서양 고대와 중세 부분으로 나뉜다. 중간고사 이전까지는 고대 그리스의 주요 도시국가(아테네와 스파르타)의 발달과정과 정치체제(민주정-과두정)의 형성과정에서부터 공화정 시기 로마에서 제정 로마 시기 지중해 세계에 대해 설명한다. 중간고사 이후에는 고대에서 중세로의 이행이란 과연 무엇인지 설명하고 서양 중세의 개념과 서양 중세사 전반에 대한 개괄을 진행할 것이다."
  },
  {
    "courseCode": "GS2613",
    "courseDescription": "본 강의는 20세기 서양 현대사의 전개를 고찰함으로써 오늘날 우리가 살고 있는 시대적 현실에 대한 균형 잡힌 역사인식과 비판적 안목을 함양하는 데 목표가 있다. 강의 전반부에서는 근대화, 자본주의화, 산업화의 맥락 속에서 만들어진 19세기 서양 체제가 제 1차 세계대전과 더불어 변화해가는 모습이 주로 다루어질 것이다. 특히, 러시아 혁명, 세계경제대공황, 그리고 이에 따른 19세기 자유주의 질서의 붕괴 과정이 강의의 핵심적 주제를 이룰 것이다. 강의 후반부는 제 2차 세계대전 이후 형성된 전후 체제와 이의 변화, 그리고 이 체제 속에서 출현한 문화적 사회적 변동을 다룰 예정이다. 냉전, 제 3세계의 성장, 대중문화의 대두와 미국화 과정, 세계화된 경제 질서, 그리고 냉전의 해체와 사회주의권의 몰락 등이 강의 후반부에 중심을 이루게 될 주제들이다."
  },
  {
    "courseCode": "GS2614",
    "courseDescription": "본 강의는 16세기부터 18세기까지의 서양, 보다 구체적으로 유럽과 미 대륙의 역사를 다루는 데 목표가 있다. 수업의 진행은 먼저 중세사회의 해체 과정을 개관하고, 이후 신항로의 개척과 세계 체제의 형성, 종교 개혁과 유럽의 분열, 절대주의 국가의 대두, 계몽주의의 등장과 과학 혁명 등 초기 근대 시대 ‘근대성’을 만들었던 주요 역사적 사건 및 지적 성과들을 학습한다."
  },
  {
    "courseCode": "GS2615",
    "courseDescription": "이 강의는 자본주의 사회의 대안으로서 등장했던 다양한 사회주의 운동과 실험들을 역사적으로 접근하는 것이 목적이다. 인류 역사를 살펴보면 다양한 이상향에 대한 사고와 운동들이 등장한다. 특히 근대 이전의 이러한 유토피아 운동들은 종교적 색체를 강하게 지닌다. 하지만 근대 이후 사회운동의 주된 축은 이러한 유토피아 운동의 계보를 이어가지만 그와는 명백한 차이점을 가지는데, 그것은 바로 자본주의 체계와 밀접한 관련이 있기 때문이다. 유토피아주의의 세속화라고도 부를 수 있는 이러한 근·현대 사회주의 운동은, 따라서 근대 자본주의 체계와의 관계 속에서만 분석될 수 있다. 이 강의는 이러한 문제의식을 따라 근대 자본주의 분석을 중심으로 사회주의 사상과 운동의 전개과정, 특히 마르크스주의와 그 이념을 따른 운동의 전개과정을 살펴본 후, 최초로 성공한 현실 사회주의 국가들의 시도와 실패에 대해 접근해 볼 것이다."
  },
  {
    "courseCode": "GS2616",
    "courseDescription": "본 강의는 산업 자본주의와 자유주의 시대를 연 장기 19세기 서양의 역사에 대해 탐구하는 것을 목적으로 한다. 이 시대는 현대 자본주의의 기본 형태가 완성된 시기로서 프랑스 대혁명과 영국 산업혁명으로부터 시작되어 제국주의 시대를 거쳐 1차 세계대전으로 종결되는 연대기를 가지고 있다. 근본적으로 이 시대는 진보(진화)와 발전을 중심으로 한 근대성의 전반적 특징들이 전 세계적으로 확산되어 가던 시기이다. 또한 자본주의의 근본적 모순들이 구체화되어 그에 대한 대안적 사고들이 폭발하던 시기이도 하다. 본 강의는 이러한 장기 19세기 서양의 전반적 구조와 모순들 그리고 그것을 넘어서려는 흐름들에 대해 살펴볼 것이다."
  },
  {
    "courseCode": "GS2617",
    "courseDescription": "이 과목에서는 고대 에게해 문명에서부터 현재까지의 서구 문명의 역사를 살펴볼 것이다. 여기에서는 정치, 경제, 사회, 문화적 발전을 포함한 서양 역사의 주요 사건들과 문제들을 다룰 것이며 이를 통해 학생들은 서구 역사 발전의 주요한 특징들에 대한 기본적인 이해에 도달하게 될 것이다. This course examines Western Civilizations from the ancient Aegean Civilization to the present world. It reviews the major events and problems of Western history including political, economic, social and cultural developments and allows students to reach a basic understanding of the characteristic features of the Western historical development."
  },
  {
    "courseCode": "GS2618",
    "courseDescription": "본 강의는 유럽사의 또 다른 한 축인 중동부 유럽과 러시아의 역사를 다룬다. 중세 이래 유럽사 및 세계사적 변동에서 매우 중요한 지역이었음에도 많은 조명을 받지 못했다. 따라서 본 수업에서는 이 지역의 역사에 대한 포괄적인 이해를 위해 지역의 지리적 범위에서부터 경제, 사 회 및 문화 전반이 개괄적으로 다뤄질 것이다."
  },
  {
    "courseCode": "GS2620",
    "courseDescription": "철학이란, 혹은 철학을 한다는 것은, 무엇인가? 이 교과는 철학이라는 학문을 처음 접하는 학생들에게 철학을 한다는 것이 무엇인지, 혹은 철학적으로 사고한다는 것은 어떻게 사고하는 것인지를 소개하고 훈련하는 데에 목적이 있다. 이를 위해 본 강좌에서는 전통적으로 어떠한 중요한 철학적 문제들이 제기되었고, 또 실제로 철학자들이 그 문제들을 어떻게 다루는지를 비판적으로 살펴보고 토론한다."
  },
  {
    "courseCode": "GS2621",
    "courseDescription": "서양적 사유의 원형인 ‘철학자’ 소크라테스, 동아시아 사유의 원점인 공자, 불교와 기독교의 창시자 붓다와 예수의 사상을 살펴보고, 인류의 역사에 끼친 그들의 영향력을 생각해 본다. 흔히 차축(Axial Age) 시대라고 불리는 인류 정신사의 형성기를 이해하는 일은 현대 문화의 다양성과 문명 간의 소통 및 대화를 위해서도 반드시 필요하다. 신학적, 교리적, 신앙적 관점을 벗어나서, 인류 정신의 스승, 사유의 원형으로 서 각 인물의 사상을 이해하려고 노력할 것이다."
  },
  {
    "courseCode": "GS2625",
    "courseDescription": "본 강좌는 동양사상을 형성하는 주요한 두 학파, 특히 “유가-논어/맹자”와 “도가-노자/장자”를 직접 읽고 이해하는 것을 목표로 삼는다. 그 두 학파의 사상은 ‘질서’와 ‘자유’라는 언뜻 모순되는 것으로 보이는 보편적인 인간의 사유 활동을 대표한다. 수강생은 이 강좌를 통해, 동양사상의 깊이와 매력을 흠뻑 맛보고 느낄 수 있을 것이다."
  },
  {
    "courseCode": "GS2627",
    "courseDescription": "감성적이고 신체적인 존재로서 인간은 상징으로 사유한다. 상징 사유는 비논리적이고 모순적으로 보이지만, 그것이 없다면 인간은 로봇처럼 메마른 존재로 전락할 것이다. 상징은 논리적 언어를 보조하는 보조수단이 아니라 인간을 형성하는 조건이다. 그런 의미에서 인간은 호모 심볼리쿠스다. 인류의 중요한 문화유산인 신화는 그 자체가 상징이다. 상징을 이해하는 능력을 배양함으로써, 모든 이야기에 숨겨진 메시지와 문화를 해독하는 능력을 기를 수 있을 것이다."
  },
  {
    "courseCode": "GS2651",
    "courseDescription": "From the birth of democracy in Western civilization to the attainment of enlightenment in Tibetan Buddhism, debate plays an important role in shaping societies and in providing people with a better understanding of the world around them. By combining critical thinking with effective communication (both spoken and written), the focus of this course is to help students improve these critical skills by engaging in Tibetan debates, public forum debates, and congressional debates."
  },
  {
    "courseCode": "GS2652",
    "courseDescription": "Essays are the foundational genre of written academic discourse; therefore, they are the focus of this course. Through the use of group and individual work, students will be guided through the more basic steps of creating academic es -says before developing more advanced skills. Students will practice summarizing, paraphrasing and quoting; they will also incorporate source materials using formal citation standards. Finally, students will understand the importance of pre-writing, drafting, revision, and editing as essential steps in the writing process."
  },
  {
    "courseCode": "GS2653",
    "courseDescription": "This course provides a foundation to help students understand the various ethical issues affecting scientific research by: 1). surveying the historical origins of modern research ethics, 2). examining current issues and trends related to research ethics, and 3). reviewing case-studies of research misconduct. The purpose of the course is to provide a framework for students to make informed ethical decisions regarding their own research and publications."
  },
  {
    "courseCode": "GS2654",
    "courseDescription": "This course is meant for students who wish to have additional English writing practice. In this class, students will ex -press themselves through writing, learn about and practice a variety of creative writing techniques, as well as review fundamental grammar skills. This is an opportunity to build up your writing and learn the nuances of gram- mar in a much more informal and fun setting."
  },
  {
    "courseCode": "GS2655",
    "courseDescription": "This course is intended to help students improve and practice their writing and critical thinking skills by creating various science-related news stories for online digital media. Students have to use their scientific knowledge and expertise to communicate effectively with the general public on social media to inform, educate, and persuade. Students are also required to develop their creativity through their photojournalism skills because every social media post requires ac -companying photos."
  },
  {
    "courseCode": "GS2656",
    "courseDescription": "이 수업에서는 인간의 생존과 경제활동에 가장 필수적인 재화 및 상품의 생산과 교환, 그리고 그것을 둘러싼 정치적, 사회적, 문화적 교류와 경쟁 과정을 살펴볼 것이다. 이를 바탕으로 우리는 물질문명을 중심으로 인간과 인간 사회가 어떤 변화를 겪었고 또 앞으로 어떤 변화를 겪게 될 것인지에 대해 토론할 것이다. 이 수업을 통해서 강의를 듣는 학생들이 인류사에서 재화와 상품을 중심으로 일어나는 여러 가지 사건과 구조적 변동을 파악하고 동시대 세계의 문제들에 대한 이해를 심화할 수 있을 것이다."
  },
  {
    "courseCode": "GS2661",
    "courseDescription": "이 교과는 형식 논리학 입문 교과이다. 강의의 대부분은 현대 형식논리의 근간을 이루는 명제논리와 일차 술어논리의 언어 및 증명 방법을 익히는데 할애될 것이다. 강의를 통해 학생들은 논리학의 주요 개념 및 원리들을 이해하고, 이러한 원리들을 일상적 논증을 평가하는데 적용해봄으로써 논리적 분석력과 비판적 사고능력을 함양한다. 논리학에 대한 기본적 이해 이외에도, 일상의 영역 혹은 각 학문 분야에서 보다 나은 논증을 전개할 수 있는 능력을 함양하는 것이 본 강의의 목표이다."
  },
  {
    "courseCode": "GS2701",
    "courseDescription": "본 과목은 한국 사회를 이해함에 있어서 사회과학의 개념과 이론들을 분석적으로 적용하는 방법을 학습하는 것을 목표로 하고 있다. 사회화, 일상생활과 문화, 가족, 계급과 불평등, 섹슈얼리티와 젠더, 종교, 미디어, 기업과 노동, 교육, 범죄, 정치와 도시, 환경과 세계화 등의 주제들에 대한 학습을 통해 한국 사회에서 이러한 주제들이 어떤 방식으로 현실화되어 있는지를 또한 역사적이고 분석적으로 일상생활, 구조와 행위, 제도의 차원 각각에서 검토하고자 한다."
  },
  {
    "courseCode": "GS2702",
    "courseDescription": "이 수업은 학생들이 미국사회를 역사적이고 분석적으로 이해할 수 있도록 하는 것을 목표로 한다. 이를 위해 학생들은 다양한 사회과학적 이론과 개념들을 적용하여 미국사회를 이해하는 법을 배우게 될 것이다. 또한 미국과 한국 및 국제사회와의 관계를 살펴봄으로써 미국사회의 이해를 심화시키고자 한다. The goal of this course is to historically and analytically understand American society using the concepts and theories of social science. In the course, students will learn social-scientific concepts used in explaining social life, such as socialization, daily life and culture, family, health, class and inequality, sexuality and gender, religion, media, business and labor, education, crime, politics, city space, environment and safety. In addition, students need to un -derstand people's everyday life, organizations, institutions, and social structures in the US by applying those concepts. Students will also learn how to better understand American society in terms of its specific relationship with South Korea and international society."
  },
  {
    "courseCode": "GS2703",
    "courseDescription": "우리가 살아가고 있는 세상은 전 지구적으로 상호 연결되어있다. 지구 반대편의 사건들이 직접 우리의 일상에 영향을 미치기도 한다. 이러한 상황을 세계화 혹은 지구화라고 할 때, 세계화와 사람들의 생활조건 사이의 관계를 주로 살펴보는 본 과목은 다음과 같은 목표와 내용을 갖는 다. 첫째, 나라와 지역 간의 발전을 분류하는 이론적 설명들과 현실을 다루고, 둘째로 이에 더해 국제기구, 글로벌 기업, 글로벌 금융, 미디어, NGOs 등 세계화를 구성하는 주요 행위자/규칙들과 이들에 의해 규정되는 세계질서의 역사와 현실을 살펴보며, 마지막으로 글로벌 패권 경쟁, 지역주의, 이민과 인구, 과학기술과 환경, 분쟁, 테러리즘 등 세계적 이슈들을 이해하고자 한다."
  },
  {
    "courseCode": "GS2704",
    "courseDescription": "현대사회 변화의 가장 중요한 한 가지 축은 기업사회 혹은 조직사회(corporate society)로의 변화이며, 각각의 사회는 그 사회가 거쳐 온 발전경로, 계급구조, 금융시장의 특성, 엘리트연합의 특성, 가족구조 등 다양한 변수들이 상호작용하면서 특정한 형태의 기업사회를 만들어낸 다. 본 강좌는 자본주의 사회의 가장 핵심적인 역동성을 제공하고 있는 기업에 대한 사회과학적 분석을 시도한다."
  },
  {
    "courseCode": "GS2705",
    "courseDescription": "This course, first, deals with theoretical explanations of so-called ‘information society’, and examines technological and institutional aspects of information society, such as industrial organizations and media. This course also exam -ines such issues as interactions in cyber-space, e-government and governance, changes in corporate organization and work, democracy and education, information gap and inequality, intellectual property rights, popular culture and globalization."
  },
  {
    "courseCode": "GS2706",
    "courseDescription": "이 과목은 세계정치의 변환을 근대 초, 냉전 시기, 현재에 걸쳐서 살펴보되 특별히 세계정치와 한국의 관계에 초점을 맞추어 강의가 전개된다. 역사적인 사실의 전개과정에 대한 개관과, 국제정치이론의 발전, 그리고 안보질서, 무역 및 개발, 금융통화 질서, 문화, 정보, 환경과 에너지 질서와 같은 각론적 영역에서 세계정치과정의 변화를 살펴본다."
  },
  {
    "courseCode": "GS2707",
    "courseDescription": "만화, 애니메이션, 게임, 라이트노벨 등 오늘날 대중문화의 새로운 영역들은 다수가 오타쿠계 서브컬쳐로 채워지고 있다. 일본에서 기원한 이러한 대중문화 현상은 국경을 넘어 현재 국내에서도 낯설지 않게 되었으며, 오타쿠라는 용어는 국내에서도 ‘오덕’이라는 용어로 변형되어 쓰 이고 있다. 새로운 문화현상으로 주목되는 오타쿠 문화의 현상과 특징을 분야와 사례별로, 그리고 역사적으로 살펴보고, 이를 거시적인 사회 정치경제적 맥락과 연관 지어 이해하려는 것이 본 과목의 목표와 내용이다."
  },
  {
    "courseCode": "GS2708",
    "courseDescription": "현대사회 변화의 가장 중요한 한 가지 축은 기업사회 혹은 조직사회(corporate society)로의 변화이다. 본 강좌는 자본주의 사회의 가장 핵심적인 역동성을 제공하고 있는 기업에 대한 사회과학적 분석을 시도한다. 이 과목은 특히 2차 대전 이후의 시기를 다루며 <기업과 사회 I> 수강이수자로 수강을 제한한다."
  },
  {
    "courseCode": "GS2709",
    "courseDescription": "This course will overview modern Korean political history and treat major political issues from the President Lee Seung-man to Park Geun-hye period. The course will generally consist of videos, lectures and presentations. The themes include Ko -rean politics in history after the independence from Japan, important scenes and election results of Korean politics, profiles of political leadership, myth and reality of the developmental state and the South Korean economic miracle, the democrati -zation process during eight presidents’ ruling periods, and so forth. As a consequence, the course will expose students to contending views and empirical reality regarding the Korean political at first hand."
  },
  {
    "courseCode": "GS2724",
    "courseDescription": "이 과목은 국민소득, 실업, 이자율, 환율 및 인플레이션 같은 거시경제 변수의 결정 원리와 이들 변수 간의 상호관계를 이해하는 데 그 목적이 있다. 주요 내용은 국민소득 결정에 관한 기초이론, 경제성장에 영향을 미치는 요인, 개방경제의 거시경제, 재정정책과 통화정책, 인플레이션과 실업의 상충관계에 관한 것이다. The goal of this course is to understand the basic principles of determining macro-economic variables such as national income, unemployment, interest rate, exchange rate and inflation, and their interrelationships. It deals with basic theory on how to determine national income, factors which influence economic growth,macroeconomics in the open economy, fiscal and monetary policies, and trade-off relationship between infla -tion and unemployment."
  },
  {
    "courseCode": "GS2726",
    "courseDescription": "글로벌 경제에 대한 국제경제학을 학습하는데, 국제무역과 국제금융시장으로 나누어 국제무역이론, 신보호주의, 외환시장, 환율 메카니즘 및 국제통화제도를 집중적으로 다룬다. 이어서 2008년 미국 발 금융위기에 따른 유럽재정 위기의 발생원인 및 우리나라에의 파급효과와 파급경로, 지구의 남북 지역 간 빈부격차 확대 및 국가 간 무역분쟁해결제도 같은 국제경제 이슈를 배운다. 이를 통해 세계화된 환경에 필요한 국제경제 관련 지식을 습득하게 된다. In this lecture, students will learn international economics about the global economic system. It deals with theories of international trade, new protectionism, foreign exchange market, exchange rate mechanism, and international financial system. Issues of international economics such as European financial crisis caused by global financial crisis in America in 2008, are discussed. Furthermore, it's impact on Korea and transmission mechanism, poverty gap between countries in Southern and Northern part in the globe, and resolution system of trade dispute are discussed. It will be helpful for students wishing to learn about and understand international economics, as it is a \"must-know\" in a global world."
  },
  {
    "courseCode": "GS2727",
    "courseDescription": "이 과목은 동아시아 경제를 학습하는데 그 목적이 있다. 이를 위해 세계경제 질서와 경제통합의 기초이론을 학습한 후 동아시아의 지역주의와 경제통합을 배우게 된다. 이어서 동남아시아 국가 경제, 중국 경제 및 일본 경제를 학습하여 동아시아 지역 경제에 대한 이해를 높이도록 한 다. 또한 우리나라의 통상정책 기조와 FTA 정책을 학습하고 동북아시아 국가의 경제통합 가능성을 고찰하게 된다."
  },
  {
    "courseCode": "GS2730",
    "courseDescription": "본 강의는 세계경제의 작동방법을 학습하여 한국 경제의 국제 활동을 이해토록 하는데 그 목적이 있다. 국가 간 경제통합의 기본개념, 국제경제질서, 지역주의와 다자주의 및 신지역주의를 배운다. 이어서 지역연합체인 EU, NAFTA, MERCOSUR 및 ASEAN 주요 회원국의 경제를 배운 후 일본과 중국의 경제를 학습한다. 미중 무역분쟁을 포함한 다양한 국제통상 문제를 다루게 된다. The purpose of this lecture is to let students understand international activity of Korean economy by learning how the world economy works. It begins with basic concepts of economic integration between countries, international economic order, regionalism and multi -lateralism, and new regionalism. Associations of regional cooperation such as EU, NAFTA, MERCOSUR, and ASEAN are dealt with. Students will learn economic situation of Japan and China, and various trade issues including US-China trade conflict are dealt with."
  },
  {
    "courseCode": "GS2732",
    "courseDescription": "이 과목은 전통적인 경제학 교과서에서 이성적 경제주체로 간주되어 온 인간이 실제로는 어떻게 행동하는지, 왜 그렇게 행동하는지, 그런 행동의 결과로 어떤 일이 발생하는지를 탐구한다. 본 과목을 통해 인간의 심리와 행동이 내재된 다양하고 체계적인 오류들을 깨닫고, 이 오류들에 의해 경제가 움직이고 사회가 변화하는 현상을 이해하는 한편, 스스로의 감정, 판단, 행동, 인간관계를 보다 잘 조절할 수 있을 것이다. (※ 응용과 정책을 중심으로 한 후속 교과는 행동경제학 2)"
  },
  {
    "courseCode": "GS2733",
    "courseDescription": "이 과목은 행동경제학 1의 후속 강좌로서 인간의 심리와 행동패턴 및 이를 이용한 정책적용사례에 대한 이해를 바탕으로 사람들의 후생과 공공의 복리를 높이는 데 도움이 되는 아이디어들을 탐구하고 실천하는 것을 목적으로 한다. 이 강좌의 수강생들은 팀을 이루어 학교와 지역사회, 나아가 국가와 세계에 기여할 수 있는 다양한 넛지 아이디어들을 개발하여 실행하는 프로젝트에 참여하게 될 것이다."
  },
  {
    "courseCode": "GS2734",
    "courseDescription": "이 과목은 개인과 사회의 행복을 결정하는 요인들에 관해 탐구하는 행복경제학의 실증연구결과들을 바탕으로 삶의 질과 행복감을 높이기 위한 방법들을 탐구한다. 또한 인간심리의 긍정적 측면과 성장에 주목하는 긍정심리학의 발견과 행복에 관한 고전에서 길어 올린 지혜들을 살펴보고 토론한다. 이를 통해 행복의 조건과 의미에 대해 깊이 사고하며, 조화로운 삶과 내면의 성장 및 평화를 위한 일상적 실천방법을 공부한다."
  },
  {
    "courseCode": "GS2739",
    "courseDescription": "미시경제학은 개인, 기업, 정부 등 각 경제주체의 소비와 생산 등 희소한 자원의 배분에 관한 결정을 연구하는 학문이다. 이 과목은 경제학이 이런 문제들을 다루는 가장 기초적인 도구들과 공공정책에 대한 적용 사례를 소개한다. 다양한 시장구조와 환경에서 벌어지는 수요, 공급, 그리고 제도의 상호작용을 입문 수준에서 공부한다. Microeconomics is the study of how individuals, firms, governments, and other or -ganizations make decisions about how to consume, produce, and allocate scarce resources. In this course, students will be introduced to the very basic tools that economists use to answer these question, and will learn to apply them to public questions. We will study how demand, supply, and institutions interact in a wide array of market structures and circumstances in an introductory level."
  },
  {
    "courseCode": "GS2742",
    "courseDescription": "본 과목의 목적은 과학적 심리학의 본질을 소개하고, 인간의 기본적인 행동과 마음의 작용이 어떻게 이루어지는지를 이해하는 것이다. 특히, 수강생들은 신경 세포들의 의사소통 과정에서부터 기억, 언어처리와 같은 상위 인지 과정에 이르는 다양한 스펙트럼의 인간의 행동에 대해 배움으로써, 인간의 행동에 대한 이해의 깊이를 더할 수 있으며, 더 나아가 심리학의 중요한 특징 중 하나인 융합 연구의 사례들을 자연스럽게 접함으로써 통섭적 사고 능력을 배양할 수 있다."
  },
  {
    "courseCode": "GS2743",
    "courseDescription": "본 과목은 인간의 성격, 발달, 사회 속에서의 인간의 행동, 동기와 정서, 그리고 인간의 이상행동과 치료에 대해서 배움으로써 인간에 대한 보다 심층적인 이해를 도모한다. 또한 비교 문화 심리학을 통해서 한국인의 심리적 특성을 이해하며, 심리학이 실생활에서 또는 타 분야에서 어떻게 이용되는지를 소개한다."
  },
  {
    "courseCode": "GS2747",
    "courseDescription": "본 과목의 목적은 인간의 다양한 인간관계의 본질과 특징을 심리 과학적 관점에서 이해하는 것이다. 학생들은 인간관계와 관련된 사회 심리학의 기본 이론들을 학습하며, 이를 바탕으로 실제 우정, 사랑, 직장 (실험실), 가족 내에서의 인간관계에 이러한 이론들이 어떻게 적용되는지를 학습한다. 이를 통해 본 과목은 학생들에게 건강하고 성숙한 인간관계를 발전시킬 수 있는 토대를 제공할 수 있다."
  },
  {
    "courseCode": "GS2748",
    "courseDescription": "본 과목의 목적은 인간의 언어정보처리과정을 탐색함을 통하여 인간의 마음의 본질에 대해 이해하는 것이다. 언어 이해 및 산출 과정 동안의 대뇌 표상을 알아보고, 언어 발달, 이중 언어화자의 마음과 인지, 언어와 사고의 관계, 그리고 언어와 문화의 관계 등을 언어심리학적 관점에서 고찰한다."
  },
  {
    "courseCode": "GS2750",
    "courseDescription": "이 과목은 경영학의 입문과정으로서, 전략경영, 조직행위, 기업가정신 및 기술경영과 같은 경영학의 심화과정을 배우기 위한 기초가 된다. 이 과목에서의 학습은 경영과 경영자에 대한 다양한 이론과 실제사례들을 통하여 이루어지는데, 경영학을 처음으로 접하는 학생들은 이와 같은 새로운 정보들을 체계적으로 이해 및 습득할 수 있는 지식체계가 부족하다. 이 과목은 학생들이 이와 같은 경영학에 대한 전반적인 지식체계를 갖추도록 하는 데에 그 목적이 있다. This is an introductory course in management (and organization) which will serve as a springboard for learning such advanced studies as strategic management, organizational behavior, entrepreneurship, and technology management. While this class covers a bunch of theories and real world examples about manage -ment and managers, students new to this field often lack a cognitive schema into which they integrate this material. This class aims to help students develop a basic framework that may become the beginnings of their cognitive map of the actual world of business. In an effort to facilitate learning process, this class will encourage students to actively participate in discussion and debate over a variety of managerial issues. Since managerial issues may be complex, non-routinized, and unstructured, students are expected to develop well-grounded arguments that are persuasive and coherent enough to endure challenges. To be persuasive, the arguments need to be based on relevant data, sound logic, and pertinent theories. Lecture, case analysis, and team project together will serve the purpose of de -veloping that capability."
  },
  {
    "courseCode": "GS2751",
    "courseDescription": "전략경영은 기업이 어떻게 지속가능한 경쟁우위를 획득하는지에 대한 학문이다. 이 과목은 지속가능한 경쟁우위의 원천에 대한 천착을 그 목적으로 하며, 학생들로 하여금 사업전략 및 기업전략에 대한 개념과 이론을 효과적으로 습득할 수 있도록 하는 사례분석을 포함한 다양한 교과활동으로 이루어진다. 이 과목의 목표는 유수의 기업들의 전략적 행동들과 이의 경영학적 함의, 그리고 그 전략적 행동들이 기업들의 성패 에 기여하는 메커니즘에 대한 확실한 이해를 갖추는 데에 있다."
  },
  {
    "courseCode": "GS2752",
    "courseDescription": "최근 들어 거의 모든 기업들이 더 많은 기술혁신을 이루어내기 위하여 모든 노력을 경주하고 있으며, 이에 따라 기업 내에서 기술혁신 전략 및 관리를 제대로 이해하는 것이 그 기업의 생존을 결정짓는 매우 중요한 요소로 간주되기 시작하였다. 이 강좌는 공학을 전공하는 학생들에게 이와 같은 기술혁신 전략 및 관리에 대한 체계적이면서도 일관된 지식체계를 전달하는 데에 그 목적이 있다."
  },
  {
    "courseCode": "GS2753",
    "courseDescription": "As observed in the examples of Google, Tesla, and Apple, technological entrepreneurship and innovation have played a vital role in the development and growth of an economy. Nonetheless, technicians and engineers who should take up the central position in technological entrepreneurship typically lack managerial knowledge, information, and skillset required for it. This course is designed to offer systematic theoretical perspectives together with practical knowledge for technological entrepreneurship and innovation."
  },
  {
    "courseCode": "GS2762",
    "courseDescription": "본 과목은 현대 정의론의 정수(精粹)를 심화 학습할 수 있게 하기 위한 과목이다. 자유지상주의(libertarianism)와 공리주의(utilitarianism)를 포함하되, 특히 존 롤즈(John Rawls)와 마이클 샌델(Michael Sandel)의 정의론을 대비시켜 읽어나갈 것이다. 이러한 사회적 정의를 법적 정의의 일반 원리와 비교함으로써 그 의의를 새겨 보고자 한다. 나아가 이러한 다양한 정의론에 비추어 한국사회의 몇몇 사건(판례)들을 비판적으로 고찰한다."
  },
  {
    "courseCode": "GS2763",
    "courseDescription": "본 과목은 (현대의 한국 법을 중심으로) 법 및 법학 일반을 조망할 수 있게 하는 과목이다. 헌법, 형법, 민법 등 현대 법 및 법학의 핵심 영역 들을 중심으로 현대 법을 개괄적으로 이해할 수 있게 하고자 한다. 다른 법학 관련 과목들을 수강하기 위한 공통 기초로서 이 과목을 권장하고자 한다. (비록 이 과목에 대한 선이수가 필수는 아닐지라도.)"
  },
  {
    "courseCode": "GS2765",
    "courseDescription": "본 과목은 대한민국 헌법의 주요 내용이라 할 국가와 정치의 기능과 구조에 관한 이해를 얻기 위한 것이다. 국가와 정치가 어떻게 작동하는가와, 그 지배 원리가 어떠한가에 대한 이해는 현대를 사는 모든 시민의 필수 덕목이다. 대한민국의 현행 헌법은 모든 시민의 자유와 평등, 인권, 민주주의라는 이념이 정치제도를 통해 어떻게 구현될 수 있는가를 제시하고 있다. 그렇다면 이에 비추어 볼 때, 현 대한민국의 정치 현실 은 어떠한가? 본 수업을 통해 이 점을 비판적으로 성찰하는 기회를 갖게 될 것이다."
  },
  {
    "courseCode": "GS2787",
    "courseDescription": "이 과목은 한국정치를 비교정치역사적 그리고 비교정치경제학적 접근을 통해 이해하려는 교양과목이다. 먼저, 한국정치를 어떻게 읽어야 할 것인가를 논의할 것이다. 한국정치론이 우리 한국의 정치학 내에서도 주류의 위치를 차지하지 못하고 방법론과 내용에 있어서 혁신을 이루지 못하고 있는가를 반성한 뒤, 비교정치역사와 비교정치경제학적 방법론을 통해 한국의 근대정치를 일제 강점기부터 해방정국, 한국전쟁과 50 년대, 60년대와 70년대의 개발독재시대, 80년대의 군벌주의 독재시대, 민주화와 3김 시대, 세계화와 IT혁명시대의 신자유주의적 민주주의 와 박근혜 정권 하에서 민주주의의 후퇴와 탄핵, 그리고 촛불 혁명으로 부활한 한국 민주주의를 논의할 것이다."
  },
  {
    "courseCode": "GS2788",
    "courseDescription": "민주주의론은 먼저 현대 민주주의의 본질과 개념을 규명하고 난 뒤, 고대 아테네에서 탄생한 직접 민주주의, 로마의 공화주의에서 멈췄다가 1000년 후 근대 유럽의 도시국가에서 부활해서 근대 영토적 국민국가에서 꽃을 피운 자유주의적인 대의 민주주의에 이르는 민주주의 개념의 역사를 살펴본다. 현재 디지털 문면의 등장으로 대의 민주주의가 맞이하고 있는 위기의 양상을 살펴보고 대의 민주주의를 대체할 수 있는 대안적 민주주의에 관해 논의한다. 아울러 1970년대 중반 이후 글로벌하게 진행되고 있는 민주화에 관해 논의한다."
  },
  {
    "courseCode": "GS2794",
    "courseDescription": "오늘 우리가 알고 있는 많은 생각들은 위대한 사상가들의 견해에 기초한 것이 많다. 우리에게 큰 영향을 미친 사상의 대가들이 누구이며 그들은 어떤 환경에서 활동했고 무슨 주장을 했는지를 살펴보는 것이 이 과목의 목표다. 그들의 생애와 우리의 삶, 그들의 생각과 우리의 생각을 비교함으로써 생각의 폭을 넓히는데 기여할 것으로 기대한다."
  },
  {
    "courseCode": "GS2795",
    "courseDescription": "21세기는 격동의 시대다. 변화의 속도가 빠르고 앞날을 예측하기가 쉽지 않다. 과학기술의 변화속도가 너무 빠르고 전지구가 하나로 연결되면서도 갈등이 커진다.  인간-사물-기계가 서로 연결되는 네트워크의 시대이자만 그만큼 재난이나 위험도 지구화한다.  문명론의 큰 흐름 속에서 21세기를 어떻게 이해해야 할지를 다룬 중요한 저작과 관점들을 살펴보는 것이 이 수업의 핵심이다. 이를  통해 현재와 미래를 좀 더 이해하고 전망할 수 있기를 기대한다."
  },
  {
    "courseCode": "GS2796",
    "courseDescription": "21세기 한국은 놀라운 역동성과 함께 불안한 갈등을 내포한 사회다. Dynamic Korea를 가능케 한 바로 그 힘이 자칫 인생과 사회에 큰 문제를 야기할 수도 있다. 역동성의 긍정적인 측면을 살리면서도 그 파괴력을 유념하면서 지혜로운 균형감각, 조율능력을 키워야 할 시대다. 이 강좌는 여러 keyword를 중심으로 현대한국 다이나미즘의 특성과 그 심층적 동학을 이해함으로써 그런 역량을 함양하려는 수업이다. 다루려는 keyword는 열광, 출세, 시장,일, ID, 취향, 북한, 놀이, 땅 등이다."
  },
  {
    "courseCode": "GS2797",
    "courseDescription": "개인에게나 사회에게나 꿈이 있다. 꿈은 미래를 향한 설계이자 목표가 되지만 사회적으로 실현가능성이 없으면 허상이 되고 만다. 우리에게 어떤 꿈이 가능한지, 실현할 수 있는 방안은 무엇인지를 공부함으로써 시야와 상상력을 높이려는 과목이다."
  },
  {
    "courseCode": "GS2801",
    "courseDescription": "With growing public support for research, researchers have clear obligations to conduct their work in a responsible manner. Researchers who report their work honestly, accurately, efficiently, and objectively earn public trust and, therefore, are far more likely to obtain additional grant funds. This course seeks to provide a practical overview of the rules, regulations, and professional practices that define the Responsible Conduct of Research(RCR). We will discuss conflicts of interest, laboratory safety, responsible grants management, and research misconduct. While this course was designed for graduate students in all disciplines, special consideration has been given to the needs of students in bio-related fields. The curriculum has been designed to provide students with an overall understanding of the most important responsibilities they may have as future researchers."
  },
  {
    "courseCode": "GS2803",
    "courseDescription": "This course, first, examines the development of science and technology in history, and its social implications. The relationships between science and technology and other social arenas such as law, politics, economy, and culture are also examined. Next, the course discusses the social status and roles of scientists and engineers as well as compli -cated and controversial issues arising from the development of new technologies such as information technology and bioscience and biotechnology."
  },
  {
    "courseCode": "GS2804",
    "courseDescription": "화석연료에 기반한 풍부한 에너지원의 공급에 의지하고 있는 현대 산업사회는 현재 화석연료의 고갈과 온실가스 증가에 의한 지구 온난화라는 심각한 문제에 직면해 있다. 그러므로 차세대 과학기술자 및 리더로서 에너지 문제에 대한 깊이 있고 다각적인 이해가 필수적이다. 이 강좌는 에너지 문제를 부분적으로 이해하지 않고 수학, 물리학, 화학, 생물학, 철학, 사회학 등을 아우르는 통합적인 시각으로 이해하며, 미래 의 에너지 문제에 대한 대안을 비판적으로 모색할 수 있는 능력을 기르는 것을 목표로 하고 있다."
  },
  {
    "courseCode": "GS2809",
    "courseDescription": "우리의 삶의 유일한 터전인 지구가 최근 지구온난화, 오존층의 파괴 등 지구환경의 문제들로 심각한 몸살을 앓고 있다. 이 과목은 이들 문제들의 본질을 분명히 이해하고 이에 대한 적절한 과학적 대응방안을 제시할 수 있는 능력을 배양하는데 주목적이 있다. 이를 위하여 종래의 지구관련 지질학, 대기학, 해양학 및 천문학을 지구라는 하나의 키워드로 새로이 구성하여 지구를 종합적으로 이해시키는데 강의의 초점이 맞추어져 있다."
  },
  {
    "courseCode": "GS2810",
    "courseDescription": "This course deals with the important history from the beginning of the universe to the present day from macroscopic and convergent perspective. First, it considers the Big Bang cosmology, the Earth's birth, the synthesis of organic compound, and the birth and evolution of life, based on which the scientific and philosophical implications of the advent of mankind are studied. Next, the occurrence and development of human civilization (local civilizations and their global connection) and the development of economic systems are discussed, which lead us to understand the wide variation of human civilization. Finally, we view the present and future based on the globalization of the world and the state-of-the-art science. Emphasis is placed on convergent perspective on the history of mankind in the universe and the understanding of the various modern issues, which go beyond the paradigm for individual studies."
  },
  {
    "courseCode": "GS2811",
    "courseDescription": "생명의 행성 지구의 가장 중요한 구성요소의 하나로 지구가 물의 행성이 된 것을 꼽을 수 있으며, 물론 가장 중요한 물의 저장고는 바로 바다이다. 그러나 바다는 단순한 물 정적 저장고가 아니며 해수는 바다 내에서 그리고 대기와 끊임없는 교류를 이루면서 지구를 생명의 행성으로 만드는 중요한 역할을 담당하고 있다. 본 강의의 주요목적은 이런 해양의 동적 특성이 만들어내는 생명의 행성의 모습을 살피며 아울러 최근 사람의 활동과 연계되어 바다가 처하고 있는 환경문제의 과학적 근거를 살피며 그 대응방안에 대해 생각해볼 것이다."
  },
  {
    "courseCode": "GS2812",
    "courseDescription": "본 강의는 현대사회의 지적 교양이자 첨예한 사회적 관심사라 할 생명윤리의 여러 문제들을 특히 법적, 윤리적 쟁점들을 중심으로 이해하고자 한다. 생명윤리법, 의료법, 특허법 등 현행 관련 법률들은 물론, 구체적인 사례(판례)들과의 연관 속에서, 각 쟁점들에 대한 이해를 공유하고 함께 토론하고자 한다. 단순히 현행 법 실무를 살펴보는 것을 넘어, 윤리적, 법이론적 쟁점들까지도 비판적으로 고찰해 볼 것이다. 나아가 한국의 생명공학연구 및 의료현장에서 빚어지는 특수하고 생생한 현실을 고려함으로써, 본 주제에 대한 문제의식을 날카롭게 다듬고자 한다."
  },
  {
    "courseCode": "GS2814",
    "courseDescription": "이 강좌는 플라톤의 『국가론』으로부터 토마스 모어의 『유토피아』를 거쳐 최신 공상과학소설 속 우주 유토피아에 이르기까지 서구의 사상과 문학적 상상력에서 ‘유토피아’의 이상이 나타나고 발전해온 양상을 탐구하는 강좌이다. 특히 존재하지 않는 (u-topic) 이상적 (eu-topic) 사회 속 인간의 행복 실현을 상상(함으로써 동시에 존재하는 현실의 불의와 부조리를 비판)하는 서구의 유토피아 픽션에서 과학기술의 핵심적 역할에 중점을 두고 다양한 토론을 도모한다."
  },
  {
    "courseCode": "GS2821",
    "courseDescription": "이 강연에서는 대중 강연에 대한 학습을 통하여 명확하고 확실하게 소통하는 지도자의 소양을 배양하는 것을 목표로 한다. 특히 audience와 교감하고, 신뢰를 주며, 전달하는 내용에 대한 열정이 담긴 강연에 능통하기까지는 많은 학습과 연습이 필요하다. 이는 단순 factual pre- sen -tation을 능가하는 소통 방식이며, creativity와 communication을 기본 소양으로 하는 liberal arts education을 지향하는 GIST 대학의 교육 목적과 부합한다. 이 과목의 주요 내용은 대중강연(public speech)의 기본 원리를 충실히 학습하고, 주요 요소를 연습하여 실행하기까지의 training과 그 과정을 담고, 이와 같은 과정을 통해 학기말 수강자 개개인의 주제로 한 시간 길이의 대중강연 final speech를 완성시키는 것이다. Note: All presentations will be video recorded and reviewed by class members."
  },
  {
    "courseCode": "GS2822",
    "courseDescription": "4차산업혁명 시대의 핵심 기술 중 하나인 AI는 우리의 현실과 상상 속에 이미 다양한 형태로 침투해 있으나, 사실 우리는 AI 관련 기술에 대해 아는 것보다 모르는 것이 더 많다. 그럼에도, 인간 고유의 영역이라고 여겨지는 자율적 지성을 인공적으로 모방, 구현하는 AI기술의 성격상, 그것 은 우리의 상상을 끊임없이 자극한다. 분명한 것은 AI기술이 이미 그리고 점점 더 우리의 삶에 근본적이고 돌이킬 수 없는 변화를 가져올 것이며, 궁극적으로 인간의 고유성에 대한 휴머니즘의 신념도 그러한 변화를 피해갈 수 없으리라는 것이다. 이 강좌는 <AI와 나>라는 제목으로, 우선 AI 기술의 수학적 기초에서 출발하여, AI 기술발전이 각자(‘나’)에게 미칠 영향을 다학제적으로 접근해보고, 더 나아가 AI가 자아 (‘나’)를 가질 수 있 는가, 인간과 로봇의 경계는 (어디에) 있는가 등의 물음에 대해 인문학을 넘어 다학제적 고찰과 토론을 도모한다. <AI와 나 >는 수학, 문학, 경제 학, 법학, 과학기술학 전공 교수들과 함께 AI 관련 쟁점들을 탐구하는 다학제 융합 강좌이다."
  },
  {
    "courseCode": "GS2823",
    "courseDescription": "Computation(Logos, Calculus, Numbers) has played a vital role for humans in recognizing and understanding the na -ture and society. In the process, methods of computation have made a remarkable development and progress is still ongoing. Classical binary system equipped with the code true/false is used to analyze Big Data and predict the future.  Furthermore, data compression technique has derived from classical notion such as numeration system, logarithm, differentiation etc. We review how computation has developed throughout history and what sorts of techniques are currently used and discuss how we can go further from this."
  },
  {
    "courseCode": "GS2824",
    "courseDescription": "인류의 역사를 통하여 수학은 정신세계와 문명발전의 원동력이 되어 왔다.  이 강좌를 통하여 수학적 사고방식이 예술과 사회, 철학과 사상, 과학과 기술 등 다방면에 끼친 영향을 이해하고, 인류 문명을 수학적인 관점에서 조감해보는 것이 그 목표이다."
  },
  {
    "courseCode": "GS2832",
    "courseDescription": "이 강의는 과학기술학(STS)에 기대어 워드프로세서, 스마트폰, 소셜미디어, 공유 플랫폼, 로봇과 아바타 등 다양한 디지털 기술들을 다루면서 다음의 질문을 하고 답해보고자 한다. 우리는 어떻게 기술을 정의해야 할까? 기술과 사회의 관계를 이해하기 위한 이론으로는 어떤 것들이 있을까? 기술은 우리의 사고, 공동체의 문화, 노동, 인간관계, 주의와 같은 정신능력, 젠더 관계 등 다양한 일상에 어떻게 관여하고 있을까? 기술혁신이 갖는 문화적 특성이 무엇이고 사용자가 기술에서 갖는 의미는 무엇인가? 이 강의를 통해 우리는 기술이 무엇을 할 수 있는지 또 무엇을 할 수 없는지 이해함으로써 기술을 개발하는 엔지니어나 혹은 기술을 사용하는 시민으로서 현대 과학기술과 적절한 관계를 설정하는 법을 배울 것이다"
  },
  {
    "courseCode": "GS2833",
    "courseDescription": "이 강의에서는 과학기술학(STS)의 문제의식과 디자인의 물질적 실행력을 결합하는 시도를 한다. 학생들은 인공물이 갖는 정치성을 이해하고 대안적인 가치를 실현할 수 있는 대안적인 인공물을 직접 디자인하고 3D 프린팅으로 제작하는 실습을 할 것이다. 강의는 교수의 이론 강의, 실습강사와 함께 하는 스튜디오 실습강의로 구성된다. 학생들은 이 강의를 통해 기술이 갖는 사회적, 정치적, 문화적 성격을 이해하고 우리가 선호하는 가치를 갖는 대안적인 기술을 디자인하는 방법을 이해하게 될 것이다."
  },
  {
    "courseCode": "GS2834",
    "courseDescription": "현대 사회에서 과학은 높은 인식적, 사회적 권위를 누리고 있다. 과학은 언제부터 이런 권위를 누려왔을까? 이 강의는 고대 그리스의 자연철학부터 유럽의 과학혁명을 거쳐 현대 물리학과 분자생물학의 부상까지 과학의 오랜 역사를 살피면서 과학지식이 어떻게 사회문화와 조응하면서 현재의 모습을 형성해왔는지 탐색한다. 이 강의를 통해 학생들은 보편성을 주장하는 서구의 과학지식이 실은 특수한 역사적 맥락에서 생성된 지식과 실천임을 이해할 수 있을 것이다."
  },
  {
    "courseCode": "GS2839",
    "courseDescription": "이 강의는 기후위기와 불평등을 다루는 현대 저작들을 살펴보면서 인류의 미래를 함께 논의할 것이다. 우리는 다음과 같은 주제를 다룰 것이다. 인류세란 무엇인가? 기후위기와 자본주의는 어떤 관계인가? 기술은 기후위기로부터 우리를 구원할수 있는가? 탈성장과 커먼즈는 대안이 될 수 있는가? 자동화와 디지털화는 불평등을 양산하는가? 능력주의는 불평등문제에 대한 해답이 될 수 있는가? 기본소득이 가능하고 필요한 것일까? 이를 위해 우리는 장르를 넘나들며 주요 저작들을함께 읽고 수업시간에 토론할 것이다."
  },
  {
    "courseCode": "GS2922",
    "courseDescription": "“스페인의 문화와 언어”를 수강한 학생이나 스페인어에 대한 기초지식이 있는 학생을 대상으로 스페인어 언어사용 능력을 키우고, 교재의 내용과 관련된 스페인 및 중남미 각국의 사정 등에 대해서 알아보며 세계화 시대에 발맞추어 타 문화권에 대한 이해와 관심을 제고한다."
  },
  {
    "courseCode": "GS2931",
    "courseDescription": "독일은 역사적으로 다양한 분야에서 선진 시스템을 갖추고 있으며, 특히 과학기술 분야의 학문적 성과는 그 영향력이 매우 강력하다. 이 과목 은 초급 수준 독일어 의사소통 능력의 습득을 목표로 한다. 독일과 유럽의 다양한 문화를 이해함으로써 글로벌 역량을 강화하도록 도와준다. 대학과 학생들의 요구를 반영하여 수업을 설계할 것이며, 예를 들어 과학기술 독일어나 융합학문 등도 포함될 수 있다."
  },
  {
    "courseCode": "GS2932",
    "courseDescription": "독일과 유럽은 여러 부문에서 세계적인 수준의 학문적 역량을 보유하고 있으며, 특히 과학의 역사와 철학에 지대한 영향을 끼친 바 있는 기초 과학 분야의 학술적 업적은 그 가치를 인정받고 있다. 이 과목은 초급 수준의 독일어 의사소통 능력의 활용을 목표로 한다. 독일과 유럽의 주제별 문화를 탐구하고 상호문화 능력을 증진시킴으로써 글로벌 인재로 성장하는 것을 도와준다. 수강생들과의 협의를 통해 학습 내용을 결정 하며, 예를 들어 유럽연합의 과학기술 정책이나 미디어 문화 등도 다룰 수 있다."
  },
  {
    "courseCode": "GS2933",
    "courseDescription": "일본어 초급을 배운 학생들이 중급수준의 어휘력을 기르는 기회를 제공. 일본어를 배운 적이 없지만 한자를 이해하는 학습자를 위한 인텐시브 코스"
  },
  {
    "courseCode": "GS3001",
    "courseDescription": "실함수론의 체계적인 내용을 다루는 교과과정으로, 실수의 체계, 실함수의 극한, 연속, 미분, 적분과 리만적분 외의 내용을 배운다. ε - δ 을 이용한 정리의 증명을 이해하고 해석학의 근본 개념을 배운다. 이 교과를 통하여 수학적/해석적 논리를 전개하고 증명을 독해/ 작문의 능력을 키운다. 더불어, 실함수 해석학으로 가능한 응용을 학습한다."
  },
  {
    "courseCode": "GS3012",
    "courseDescription": "2016년 여름학기 미국 유수 Liberal Arts College 중 공학대학인 Harvey Mudd College 의 Rachel Levy 교수님을 초빙하여 수학-공학 융합 과목을 GIST 학부학생들을 대상으로 개설. 현 Harvey Mudd College에서 개설되고 있는 Engineering Mathematics (E72) 과목을 바탕으로 설계된 이 강좌에서는 실질적인 공학문제의 demonstration 과 mathematical modeling 의 배경이 되는 수학 논리의 mini-lecture 및 이해도를 높이기 위한 group work, 그리고 Matlab 프로그래밍을 통한 수치해석까지 공학에서 필수적인 내용을 포괄적으로 학습함. 수학적 기법과 응용성을 학습하며, 특히 이 과목을 통하여 ‘수학적 자신감, 공학 문제에 적절한 수리 도구 구별력, 계산적 해의 정확성에 대한 판별력, 해석적, 전산적 기량 습득, 복잡한 문제해결의 필수요소인 인내력’과 같은 덕목을 기르는 것을 목표로 한다."
  },
  {
    "courseCode": "GS3015",
    "courseDescription": "대학 과정 이수에 필요한 정성적/정량적 자료 분석을 위한 통계적 사고의 기초를 학습한다. 또한 수학, 통계학, 또는 계량적 분석을 많이 요구하는 학문을 전공하고자 하는 학생들에게는 과학적 분석방법의 수리적 토대를 갖추도록 하여 상위 교과목을 수강할 수 있는 능력을 기르도록 한다."
  },
  {
    "courseCode": "GS3301",
    "courseDescription": "학생들에게 정량적 모델을 사용하여 생물학적 문제를 해결 하는 경험을 쌓게 하는 것이 이 과목의 주요 목적이다. “Order of magnitude biol -ogy”를 사 용하여 생물계의 여러 가지 현상을 간단한 estimate 으로 탐구하는 방법을 연습하고, 수많은 생물학적 질문에 통계역학을 사용하여 모델링하는 방법을 배우며 실습한다. 그리고 이 과목의 주요 목적중의 한 가지는 생물현상을 분자세포생물학적 관점에서 접근 했을 때 아무런 연관관계가 없어보이던 주제들이, 근본적으로 다른 접근방법인 Physical biology 관점에서 접근 했을 때 어떻게 그 주제들이 연관되어지고 유기적인 형태로 조직되어지는가를 배우게 된다."
  },
  {
    "courseCode": "GS3311",
    "courseDescription": "유전자발현 및 분석은 학생들에게 유전자발현과 분석이라는 과정을 통해 학생들이 독립적으로 가설을 세우고 실험을 설계하여, 실험을 수행하고 얻은 결과를 분석하고 결론을 유추한 후, 다음 실험 가설을 세우는, 일련의 연구과정을 스스로 수행하면서, 동료학생들과 Oral pre- sentation 통해 서로의 결과에 대해 Communication 하는 것을 훈련 할 수 있도록 설계 되었다. 이와 함께, 얻은 실험결과는 동료들과 영 어 학술지에 발 표할 수 있는 논문쓰기를 연습하고, 영어 원어민 강사의 공동 수업으로 논문자료 Search, Outline 쓰기, 몇 번의 다시쓰기 를 스스로 훈련함으 로서, 독립적 연구자로서의 면모를 갖출 수 있도록 학생들을 지도함을 목적으로 한다"
  },
  {
    "courseCode": "GS3401",
    "courseDescription": "Students will learn how to build beautiful, interactive websites by learning the fundamentals of HTML, CSS, and Ja -vaScript — three common coding languages on which all modern websites are built. By the end of this class, students will have all the skills required to build their own websites. This course is accessed from https://teamtreehouse.com/tracks/front-end-web-development."
  },
  {
    "courseCode": "GS3402",
    "courseDescription": "Learn how to reduce the time complexity of the normal brute force approach from 0(n2) to O(n) and O(logn) by using stack, heap, binary tree, DP, sliding window etc. with the help of 50 popular LeetCode examples.Learn some more classic algorithm including Floyd-Warshall algorithm, Diameter of a Tree, sliding window, Robin-Karp Matching Algorithm, Knuth-Morris-Pratt, K Queens and Graph Coloring.Learn Computational Geometry problems and Concepts of Integer Liner ProgrammingLearn concept of NP-Complete and NP-Hard."
  },
  {
    "courseCode": "GS3501",
    "courseDescription": "예술과 과학이 융합된 이상(李箱) 문학을 폭넓게 이해하기 위해 다각적인 접근이 필요하다. 이 과목에서는 과학적 관점으로 그의 시와 소설을 분석하고 연구한다."
  },
  {
    "courseCode": "GS3502",
    "courseDescription": "수강생들은 이 과목을 통해 시 창작에 필요한 제반 논의들을 배울 것이며, 매주 시를 창작하고 합평할 것이다."
  },
  {
    "courseCode": "GS3504",
    "courseDescription": "이 강좌는 작가론의 주요 이론들을 토대로 하여, 한국 근현대 작가에 대한 견문을 넓히는 것을 목적으로 한다. 기존의 작가 연구사를 검토하고, 한국 근현대 작가에 초점을 맞추어 문학 텍스트를 분석하고 탐구한다. 아울러 이를 통해 한국 근현대 소설사에 대한 이해의 깊이를 도모한다."
  },
  {
    "courseCode": "GS3505",
    "courseDescription": "이 교과목은 20세기 중후반 한국 여성 작가의 ‘첫 책’(첫 창작집과 첫 장편소설)을 중심으로, 당시 한국 사회에서 여성이 작가가 된다는 것의 의미를 탐구한다. 해당 학기별로 채택된 작가들의 소설을 정밀하게 분석하고, 이를 상호텍스트적으로 독해하여 한국 여성 작가의 지형과 계보를 탐색한다. 아울러 당대의 사회문화적 배경과 담론적 환경을 함께 검토함으로써, 한국 사회와 한국 문학계가 여성의 저자성을 어떻게 구성하고 배치해 왔는가를 고찰해 본다."
  },
  {
    "courseCode": "GS3506",
    "courseDescription": "양식화된 연극의 시초로 간주되는 고대 그리스 연극에서부터 전통적 관습을 탈피한 양식의 현대 연극에 이르는 역사적 과정을 살펴본다. 서양 연극의 시대별 특징을 연극미학, 연극기호학 등 다양한 관점으로 접근함으로써 연극에 대한 시야를 넓힌다."
  },
  {
    "courseCode": "GS3507",
    "courseDescription": "우리가 일상에서 접하는 수많은 콘텐츠들은 어떤 아이디어로부터 출발해 어떤 과정을 거치며 만들어 지는가? 그 중에서 사람들의 선호가 나타나는 이유는 무엇일까? 본 과목은 이러한 문제를 중심으로 콘텐츠를 구성하는 여러 요소들에 대해 살펴보고 기획과 제작을 통해 인문학적 사고와 상상력을 키우는데 목표를 둔다."
  },
  {
    "courseCode": "GS3601",
    "courseDescription": "강대국에 대한 관심은 누구에게나 공통적이다. 역사학의 기본과목을 이수한 학생들과 함께, 역사적으로 세계제국을 이루었던 나라들의 흥기, 쇠망의 역사를 요인별로 검토하여 본다. 특히 중세 이후 21세기 오늘에 이르기 까지 강성했던 동서양 제국의 흥망형태를 문화, 군사, 경제, 해외확장의 면에서 살펴본다."
  },
  {
    "courseCode": "GS3602",
    "courseDescription": "한국사 연구에 사용되는 사료의 종류와 성격을 검토하기 위한 수업이다. 우리가 알고 있는 다양한 역사 사료의 성립 배경과 내용을 확인함으로써, 사료의 중요성과 한계에 대해 비판적으로 고찰해보는 것이 본 수업의 목표이다. 수강생들에게 사료의 원문번역을 요구하지 않으며,번역된 사료를 제공할 예정이다."
  },
  {
    "courseCode": "GS3603",
    "courseDescription": "본 강좌는 학생들이 서양사의 주요 주제들에 관련된 원자료, 즉 사료를 읽고, 이를 비판적으로 해석하며, 나아가 이들에 대한 새로운 시각을 제시하는 훈련을 위한 수업이다. 학생들은 국문과 영문 사료를 소화하고 소논문을 쓰게 된다. 홀로코스트, 소련 정치체제, 그리고 냉전과 같은 굵직한 역사적 사건 또는 국면들에 관련된 사료들이 주를 이룰 것이다."
  },
  {
    "courseCode": "GS3604",
    "courseDescription": "서양사의 핵심 연구주제들 중 하나를 선택해서 그와 관련된 주요 연구서 및 연구 논문을 세미나 형식으로 함께 학습하는 수업이다. 학생들은 이 학습 결과를 토대로 소논문을 작성하게 된다. 후발 제국주의 주자로서 19세기 말부터 시작된 미국의 팽창은 서양사 및 세계사에 거대한 영향을 끼쳤다. 학생들은 이 과정과 이에 대한 도전을 체계적으로 연구할 기회가 될 것이다.GS3605 조선시대 의례사 Rituals and Ceremonies of Joseon Dynasty 조선에서 시행되었던 국가의례는 나라를 통치하는 하나의 방법이었고, 의례는 조선시대를 이해하는 매우 중요한 키워드이다. 조선의 왕실의례 시행사례와 시대적 상황에 대해 검토해보면서, 형벌과는 상반되는 의례로 국가를 통치했던 방식이 우리에게 주는 의미가 무엇인지 살펴보는 것이 수업의 목표이다."
  },
  {
    "courseCode": "GS3621",
    "courseDescription": "철학적으로 20세기는 과거와는 근본적으로 구별된다. 서구와 비서구적 타자, 계몽과 반계몽, 이성과 반이성, 의식과 무의식 등, 20세기의 철학에 의해 제기된 사상적 과제는 21세기를 이해하는 데에도 여전히 의미 있는 주제로 남아 있다. 이 강좌는 20세기의 철학적 과제를 이해하고 그것을 근거로 21세기의 사상적 방향을 전망하는 것을 목표로 삼는다."
  },
  {
    "courseCode": "GS3623",
    "courseDescription": "동양철학고전 중에서 도가사상을 대표하는 장자를 통독하면서, 동양철학의 중요한 하나의 입장을 이해하는 기회를 가질 것이다. 특히, 이번 철학고전강독 시간에는 장자를 단순히 철학적 이론의 관점에서 이해하는데 머무르지 않고 사상을 표현하는 담론에 대한 상징 해석학의 가능성에 대해서도 토론할 것이다."
  },
  {
    "courseCode": "GS3624",
    "courseDescription": "<주역>은 의심할 여지없이 세계 종교사에서 가장 중요한 책 중의 하나이다. <주역>은 한자 문화권의 전통 지식인에게 삶의 의미를 생각하고 통찰력을 얻는 원천이었다. 그러나 현대인에게 주역은 그저 신비한 기호의 집성에 불과하다. 훈련받지 않은 사람이 <주역>을 읽고 의미를 찾아내는 일은 쉽지 않다. 이 강의는 학생들에게 <주역> 이해의 ‘실마리’를 제시하고, 스스로 동양적인 사유의 길에 다가가 새롭게 생각할 수 있는 기회를 제공하려고 한다."
  },
  {
    "courseCode": "GS3626",
    "courseDescription": "최근 우리는 미국과 중국이라는 두 강대국의 충돌을 피부로 체감하는 나날을 경험하고 있다. 단순히 친미-반미, 친중-반중이라는 일차원적 반응의 차원을 넘어서는 심화된 동아시아 이해, 태평양 이해가 절실하게 요구되는 현 시점에서, 현대 중국이 만들어내는 세계사적 격변의 내실을 깊이 사고할 필요가 있다. 그런 격변을 지정학적인 관점에서 풀어보고자 하는 것이 본 강좌의 목표다."
  },
  {
    "courseCode": "GS3631",
    "courseDescription": "인간이 아닌 기계도 생각하고 느낄 수 있을까? 컴퓨터는 의식을 가질 수 있을까? 전통적으로 마음에 대한 탐구는 몸과 마음의 관계를 중심으로 철학의 영역에서 논의되어 왔으나, 20세기 중반 인지과학이라는 학제간 학문의 등장과 더불어 마음을 일종의 컴퓨터로 이해하고자 하는 접근이 새로운 패러다임이 되었다. 본 강의는 현대 심리철학에서 논의되는 주요 쟁점들에 대한 개괄적 이해와 함께 인지과학 및 인공지능 연 구에서의 기본적 가정들을 검토함으로써, 마음의 본성에 대한 철학적이면서 포괄적인 성찰의 기회를 제공하고자 한다."
  },
  {
    "courseCode": "GS3632",
    "courseDescription": "귀납논리와 의사결정이론은 주어진 상황에서 증거에 비추어 어떤 믿음을 갖는 것이 합리적인지, 어떤 선택을 하는 것이 합리적인지를 다루는 분야이다. 본 강의는 먼저 귀납논리와 의사결정이론을 소개한 후, 이들 분야의 기본적 가정과 실제적 응용을 살펴볼 것이다. 게임과 집단선택의 상황을 포함하여 의사결정 상황에서 발생하는 여러 퍼즐들을 검토함으로써 합리성에 대한 보다 나은 이해를 얻는 것이 교과 목표중 하나 다. 강의의 전반부는 담당 교수의 강의를 중심으로 후반부는 발표와 토론을 중심으로 이루어질 것이다."
  },
  {
    "courseCode": "GS3633",
    "courseDescription": "본 교과는 설명과 이해의 본성에 대해, 특히 인간 행위의 설명에 대해 비판적으로 고찰하는 세미나 형식의 수업이다. 과학에서나 일상적 맥락에서나 위는 세계와 인간에 대한 설명과 이해를 추구한다. 본 강의는 무언가를 설명한다는 것은 무엇인지, 특히 우리가 서로의 행위를 이해하고 설명한다는 것은 무엇인지 묻는다. 우리는 먼저 과학적 설명에 대한 헴펠의 고전적 저작에서 출발하여, 행위 설명에 대한 데이빗슨의 인과 이론을 거쳐, 합리성과 공감을 강조하는 최근의 규범적 접근에 이르기까지의 주요 연구서 및 논문을 직접 읽고 토론함으로써 이 질문에 대한 가장 그럴듯한 답을 찾는다."
  },
  {
    "courseCode": "GS3651",
    "courseDescription": "Undergraduate students have the opportunity to gather their knowledge and skills into a final thesis. Over the dura -tion of the course, students will hone the skills used to write a basic academic research paper. This course will cover methods ranging from choosing research questions to self-and peer-editing. Students who participate in this course will be assisted in completing their own short paper by the end of the course."
  },
  {
    "courseCode": "GS3662",
    "courseDescription": "동아시아의 역사적 전개를 중심축으로 삼으면서, 북아시아, 중앙아시아, 동아시아의 역사적 발전과 상호 교류를 사고하는 기회를 제공한다. 자민족중심주의 역사관을 극복하는 좋은 기회가 될 것이다."
  },
  {
    "courseCode": "GS3663",
    "courseDescription": "과학이 종교가 되려는 열망이 분출하는 현대의 시대적 분위기 안에서, 전통적으로 인간의 정신을 형성하고 인생의 방향을 설정하는 길잡이 역할을 해 왔던 종교는 그 역할을 다했는가? 본 강좌는 근대 과학의 탄생과 더불어 성장해 온 근대 과학적 세계관과 그것의 연장선상에 있는 인공지능, 그리고 그런 과학적 사고에 의해 배척 혹은 배격 당했던 종교적 세계관 및 인간의 정신성의 차이를 점검하면서, 미래의 과학의 존재 방식, 나아가 인간의 가능성을 다시 생각해보고자 하는 수업이다. 기독교와 과학, 동양종교와 과학의 관계, 대화 및 충돌의 여러 양상을 검토하면서, 과학과 종교라는 오래된 문제를 현재적으로 다시 생각하는 기회를 가질 것이다."
  },
  {
    "courseCode": "GS3721",
    "courseDescription": "교육은 개인과 사회의 자원(돈, 시간, 노력 등)을 들여 사람을 보다 나은 방향으로 변화시키는 것이어야 한다. 이 과목은 자원 배분 과정으로 바라본 교육을 경제학적 시각으로 평가하며, 한국 사회에서 왜 교육이 최고의 난제가 되었는지, 어떤 방식의 해결이 가능한지를 탐구한다. 교육에 관한 경제학 이론과 다양한 실증연구의 학습, 발표, 토론으로 교육에 대한 식견과 실천 역량의 함양을 목표로 한다."
  },
  {
    "courseCode": "GS3722",
    "courseDescription": "이 과목은 미시경제학의 중요한 이론을 이해하고 현실 세계에 적용하는 것을 목표로 한다. 구체적으로, 시장의 수요와 공급, 소비자이론과 생산자이론, 경쟁과 독점, 게임이론과 전략적 행태, 위험과 정보, 시장 실패와 정부 역할 등을 탐구한다. 흥미로운 실제 사례들이 분석될 것이며, STAR-MOOC 온라인 강의영상을 통한 예습을 바탕으로 질의응답과 토론, 협력적 문제해결 등 상호작용이 풍부한 플립드 러닝 수업이 전개될 것이다."
  },
  {
    "courseCode": "GS3725",
    "courseDescription": "정부의 복지국가 지향에 있어서 사회복지정책의 내용과 문제점을 학습. 사회복지제도가 작동하게 되는 기본원리, 국민기초생활보장제도와 사회보험제도를 포함한 다양한 현행 제도의 내용 및 재원조달 방법을 학습하고 우리나라 제도의 한계를 학습함. 특히 제도의 장기 지속가능성에 대해 자세히 살펴봄."
  },
  {
    "courseCode": "GS3728",
    "courseDescription": "세계화 시대에는 시장의 역할이 증가하는 반면 정부의 역할은 감소하는 경향이 있다. 본 강의에서는 세계화의 경제적 특징과 경제적 파급효과를 학습하게 된다. 2008년에 발생한 글로벌 금융위기의 발생원인, 파급경로 및 파급효과를 학습하는 것은 세계화를 이해하고 대비책을 준비하는 차원에서 중요하다. 경제정책의 성과를 측정하는 척도의 구체적인 내용을 학습하게 된다. 또한 시장이 실패하는 원인과 이를 보완하기 위해 정부가 개입하는 이론적 근거를 배우게 된다. 자본주의를 앵글로색슨형 자본주의, 북유럽 자본주의 및 대륙식 자본주의로 분류할 수 있는데, 이러한 체제별 경제정책의 내용과 성과를 학습하게 된다. 이러한 과정을 통해 바람직한 한국경제 시스템과 경제정책을 도출하도록 한다."
  },
  {
    "courseCode": "GS3735",
    "courseDescription": "1960년대 이후 우리나라의 산업화 과정을 체계적으로 학습함으로써 경제개발정책의 성과와 한계를 명확하게 이해할 수 있도록 한다. 많은 후진국과 달리 우리나라의 경제개발정책이 성공할 수 있었던 원인을 규명하고, 경제개발 과정에서 발생한 부작용을 학습하여 현재 한국 경제가 직면한 문제가 과거의 경제개발정책과 연관되어 있음을 알도록 한다. 문재인 정부 경제정책의 성과 평가로 마무리한다. The purpose of this lecture is to let students understand the performances and limitations of economic development policy in Korea, specifically by learning about industrialization process since the 1960s. It is interesting to find out the reasons why economic develop -ment policy could succeed in Korea, unlike in most of other developing countries. By learning side effects caused by the industrialization process, students can get to know that the current economic problems are connected to the past economic development policies. This lecture ends by evaluating the economic performance of Moon Jae-in govern -ment."
  },
  {
    "courseCode": "GS3736",
    "courseDescription": "독일은 분단 40년 만에 통일을 달성한 후 많은 어려움을 극복하고 내적 통일인 사회통합을 이루어가고 있다. 평화통일의 유일한 모범사례인 독일을 벤치마킹하여 한반도에서 평화통일을 달성할 수 있는 방법을 고찰한다. 이는 우리의 현실 문제를 해결하기 위한 많은 시사점을 제공할 것이다. 통일 시나리오별 실현 가능성, 통일비용 및 경제에 미치는 영향 등을 학습한다. Germany achieved unification after 40 years of division and is accomplishing social integration by overcoming the difficulties connected with unification. This course studies the German case which is a unique peaceful unification. It will provide insights to us, that can help us achieve peaceful unification in Korea. For each scenario of unification of North and South Korea, students will get to know its impact on the possibility of realization, unification costs, and the economy etc."
  },
  {
    "courseCode": "GS3737",
    "courseDescription": "이 과목은 ‘거시경제학 원론’ 강의를 수강한 것을 전제로 중급 수준의 거시경제학을 배우게 된다. 거시경제학의 주요 내용인 경제순환, 국민소득 구성요소, 재정정책과 통화정책의 이론적 배경을 학습하게 된다. 특히 인플레이션, 투자, 경기변동, 경제성장, 저축, 실업, 이자율,통화량을 배우고 이들 중요 변수간의 관계를 이론적으로 학습한다. 또한 세계화가 진행되는 상황에서 개방경제 거시경제의 주요 내용을 학습한다."
  },
  {
    "courseCode": "GS3751",
    "courseDescription": "조직 및 경영이론에 있어 기업행동의 선행요인과 결과에 대한 식별은 매우 중요한 학문적 위치를 차지한다. 최근 들어, 소셜 네트워크 분석은 이와 같은 식별을 도와주는 도구로서 많은 학문적 관심을 받게 되었는데, 이는 기업이 사회적 진공상태가 아닌 끈끈한 사회적 관계 즉 소셜 네트워크 속에 배태되어 있음을 인식하게 되었기 때문이다. 이 과목을 통하여 학생들은 소셜 네트워크 이론을 기업이라는 맥락 속에서 이해하고, 이 이론이 실제 상황에서 어떻게 적용될 수 있는지에 대하여 배우게 된다. 궁극적으로 이 과목의 목표는 소셜 네트워크가 기업의 전략적 의사결정에 어떻게 영향을 미치고, 또 이 결정이 사회적, 경제적 성과로 변환되는 과정에 어떻게 관여하는지에 대한 지식을 갖추는 데에 있다."
  },
  {
    "courseCode": "GS3752",
    "courseDescription": "전략경영은 기업이 어떻게 지속가능한 경쟁우위를 획득하는지에 대한 학문으로 크게 사업전략과 기업전략으로 구성된다. 사업전략이 하나의 사업에 대한 전략만을 고려한다면, 기업전략은 하나 이상의 사업을 영위할 때 발생하는 여러 문제들과 기회들에 대하여 다루며, 대부분의 기업들이 사실상 하나 이상의 사업을 영위하고 있다는 점에서 그 중요성이 더욱 크다. 이 과목의 목표는 여러 거대기업들의 전략적 행동들과 이 의 경영학적 함의, 그리고 그 전략적 행동들이 기업들의 성패에 기여하는 메커니즘에 대한 확실한 이해를 갖추는 데에 있다."
  },
  {
    "courseCode": "GS3753",
    "courseDescription": "Business groups are ubiquitous around the world and take a substantial fraction of industrial output. Any attempt to analyze firm behavior to the exclusion of business groups, thus, is unavoidably partial and incomplete. This course offers diverse theoretical lenses through which to better understand why business groups are prevalent around the world in general and in Korea in particular and how they shape and regulate the performance of the national economy and business landscape therein."
  },
  {
    "courseCode": "GS3762",
    "courseDescription": "본 교과는 법사상의 주요 현대적 고전들을 강독하는 교과이다. 주요 사상가들의 대표 저작들을 발췌하여 강독하고 해제하고자 한다. 학기별로 텍스트는 달리 선정될 수 있다. 주로 켈젠(Hans Kelsen)의 순수법학(The Pure Theory of Law), 하트(H.L.A. Hart)의 법의 개념 (The Concept of Law), 풀러(Lon L. Fuller)의 법의 도덕성(The Morality of Law), 드워킨(Ronald Dworkin) 법과 권리(Taking Rights Seriously), 법의 제국(Law's Empire) 등이 강독의 대상이 될 것이다. 그리하여 본 교과는 법사상 혹은 법철학에 대한 기초 소양 을 제공함은 물론, 고전적 학술서를 정밀하게 독해해 나가는 훈련을 기회를 제공할 것이다."
  },
  {
    "courseCode": "GS3763",
    "courseDescription": "본 과목은 현대 법사상 혹은 법철학의 기초적이고도 전반적인 이해를 위한 것이다. 시대나 인물에 따른 접근이 아니라, 주요 주제별로 접근하고자 한다. 법실증주의와 자연법론 간의 논쟁과 같은 전통적 쟁점에서부터, 법적 추론과 해석의 문제, 법치주의 등 상대적으로 실무적인 쟁점들까지 살펴 볼 것이다. 그리하여 법사상 혹은 법철학에 대한 기초 소양을 제공함은 물론, 실정 법률과 제도를 성찰적으로 이해하는 데에도 유익할 것이다."
  },
  {
    "courseCode": "GS3764",
    "courseDescription": "This course explores the cognitive and neural processes that are involved in human information processes such as attention, vision, language, motor control, executive control, memory, and emotion. It introduces basic neuro- anatomy, cognitive neu -roscientific techniques, and behavioral measures of cognition, and discusses how to infer the relationship between brain and cognition. We consider evidence from patients with neurological diseases and from normal human participants."
  },
  {
    "courseCode": "GS3765",
    "courseDescription": "재정학, 다른 말로 공공경제학은 가계와 기업 외의 제3의 경제주체인 정부의 행위에 대해 분석하는 학문으로서, 다음 세 가지 측면에 관심을 둔다. 첫째, 정부가 어떤 행동을 하고 있으며, 그 행동은 어떤 의사결정과정을 거쳐 나오는지를 분석한다. 둘째, 정부의 행동이 경제에 어떤 결과를 가져올지 예측한다. 셋째, 여러 정책대안들 중 어떤 것이 효율성과 형평성 측면에서 더 좋고 나쁜지를 평가한다. 이 과목에서는 공적 자원배분과 소득분배, 사회보험, 정부지출과 비용편익분석, 조세제도와 국가재정 등에 관해 학습한다. 각 주제와 관련된 현실의 정책 문제들에 대한 생생한 토론이 진행될 것이다."
  },
  {
    "courseCode": "GS3766",
    "courseDescription": "본 교과목에서 다루는 내용은 지각, 주의, 기억, 학습, 지식 표상, 언어, 문제 해결, 의사결정, 정서 등 인간의 정신 과정 전반에 관한 것이다. 본 교과목은 강의와 팀 프로젝트로 구성된다. 강의를 통해 앞에서 언급한 인간의 정신 과정에 대한 심리학적 이해를 높일 수 있다. 팀 프로젝트에서는 학생들이 실제로 인지심리학적 실험 연구를 수행함으로써 인지심리학을 비롯한 행동과학에 대한 전반적인 이해를 높일 수 있다. 학생들은 본 교과목의 수강을 통해 인지심리학에 대한 학문적 이해뿐만 아니라 일상생활에서 인지심리학적 원리들이 어떻게 적용되는지 배울 수 있다."
  },
  {
    "courseCode": "GS3767",
    "courseDescription": "본 과목은 최첨단의 과학기술이라 할 인공지능과 로봇기술을 둘러싼 윤리적 쟁점들을 다룬다. 우리가 현재 맞이하고 있고 향후 도래할 인공지능과 로봇의 사회에서 당면하게 될 여러 심각한 윤리적 쟁점들을 고민해 보는 중요한 기회를 가질 것이다. 학기 전반부에는 인공지능 로봇기술 및 그 윤리적 문제 전반을 개괄하는 한편 주요 \"개별적인\" 윤리적 문제들 다루고, 학기 후반부에는 인공지능 로봇기술을 둘러싼 \"일반적\" 문제들을 다룰 것이다. This course deals with the ethical issues in AI and robotics. Mostly, the course surveys the ethical issues of the technologies including military, medical, social robots and self-driving cars. Additionally and finally, the course deals with the general and fundamental topics such as the normative/moral status of robots."
  },
  {
    "courseCode": "GS3785",
    "courseDescription": "본 과목은 우리가 살고 있는 자본주의적 민주주의 하에서 사회질서를 조직하는 세 가지 원리, ‘국가의 지배’(국가), ‘시민의 지배’(민주주의와 시민사회), ‘자본의 지배’(자본주의와 시장) 중 국가와 시민사회의 조직 원리와 작동원리 그리고 국가와 시민사회의 관계를 논의한다. 물론 시장과 자본의 지배가 민주주의와 국가자율성과 어떻게 갈등하면서 공존하는가를 논의할 것이다. 그러나 초점은 국가와 시민사회의 관계에 맞추어져 있고, 국가, 시민사회, 자본(시장)의 관계는 [정치경제론] 과목에서 중점적으로 다루어질 것이다."
  },
  {
    "courseCode": "GS3786",
    "courseDescription": "현대 자본주의 정치경제하에서 정치현상과 경제현상 간의 경계가 무너지면서 독자적 영역, 관심, 방법론을 가진 별개의 분야로 존재해 왔던 정치와 경제가 정치경제로 통합되고 있다. 이 과목은 정치와 경제, 구체적으로는 국가, 민주주의(시민사회), 자본 (시장)의 관계에 관한 다양 한 이론들을 이해하는 것을 주목적으로 하고 있다. 먼저 정치의 경제적 현상, 경제의 정치적 현상을 분석하는 접근방법인 정치경제학적 접 근방법과 정치사회학적 접근방법을 살펴본다. 연후에 민주주의와 자본주의, 사회주의의 실패와 개혁, 자본주의 국가 하에서 계급타협의 조 직, 세계화와 민주주의의 관계를 분석한다."
  },
  {
    "courseCode": "GS3801",
    "courseDescription": "이 강좌는 근대 과학의 탄생을 둘러싸고 역사적으로 구성되어 오늘에 이르기까지 다양한 형태로 과학기술 전 분야를 지배하고 있는 ‘젠더’ 문제에 대한 인식을 일깨우기 위한 심화 융합 강좌이다. 과학기술과 젠더의 다양한 쟁점을 여러 학문 분야의 관점에서 심층적으로 분석하고 토론하되, 이를 통해 전지구적 교육 현장의 주요 가치 중 하나인 ‘다양성 교육’(diversity education)의 토대를 마련하는 것까지 목표로 한다."
  },
  {
    "courseCode": "GS3802",
    "courseDescription": "이 강좌는 르네상스 시대부터 현대에 이르기까지 (오늘날의 명칭으로) ‘과학자’를 주인공으로 하는 다양한 문학작품을 통해, 지식의 추구라는 근원적 의미의 ‘스키엔티아’(scientia)와 근대 과학 및 과학자에 대한 관점 및 그를 둘러싼 쟁점들을 통시적, 공시적으로 분석하고 토론함으로써, 현대과학이 지향/신봉하는 주요 가치에 대한 자기성찰을 도모하는 것을 목표로 한다."
  },
  {
    "courseCode": "GS3803",
    "courseDescription": "이 강좌는 세계 문학의 고전 윌리엄 셰익스피어의 희곡 중 오늘날 비판적 포스트휴머니즘(critical posthumanism)의 관점에서 중요한 시사성을 가지는 주요작들을 읽고, 이들 작품에 등장하는 (포스트)휴먼이 18-21세기까지 회화, 연극, 영화 등 다양한 미디어에서 어떻게 재현되어 왔는가를 비교 토론함으로써, (1) 포스트휴먼의 개념과 비판적 포스트휴머니즘의 쟁점들을 이해하고 (2) 그와 동시에 텍스트와 미디어에 대한 고급 문해력(literacy)과 비판적 사고력을 함양하는 것을 목표로 한다."
  },
  {
    "courseCode": "GS3804",
    "courseDescription": "최근의 많은 과학적 발전은 고급기기의 개발과 함께 병행되어 생체현상 규명, 화학물질의 변환, 재료의 구조분석 등이 과거와는 차별되게 결과물로 제시되고 이론들이 규명되고 있다. 특히, 본 과목에서 다루게 될 고급분석 분야인 분광분석, 표면분석, 질량분석, 원소분석, 이미지 분석 등은 현대 과학의 연구에서 없어서는 안 될 기초, 필수 분야로 인식되고 있다. 학생들은 고급기기의 원리와 응용에 대해 이론적 수업을 거쳐, 실제 기기를 다루면서 장비활용에 대한 이해를 넓혀 개개인의 연구에 적용할 수 있는 지식을 습득하게 된다. 총 6개 분야로 나누어 이론과 실습을 하게 되고 최종적으로 활용기기에 대한 연구결과를 발표하게 된다."
  },
  {
    "courseCode": "GS4004",
    "courseDescription": "이  과목은 현대대수학의 기본 개념이 되는 group theory, ring theory, 그리고 field theory에 대하여 배운다. 추상화를 좀 더 체계적으로 배우는 과목이며 여러 다른 분야에서 쓰이고 있는 group(군)이나 field(체)의 응용에 대해서 소개한다."
  },
  {
    "courseCode": "GS4005",
    "courseDescription": "이 과목은 기본적인 프로그래밍 언어(C, C++ 언어 등)를 배운 후에, 계산과학을 수행하는 데 필요한 고성능 계산(High Performance Com -puting)을 위한 UNIX OS의 기본적 이해, 가시화, 등 과학계산 환경과 몇 가지 실례를 통해 과학계산 프로그래밍 기초를 배운다."
  },
  {
    "courseCode": "GS4006",
    "courseDescription": "이 과목은 전통적인 기초정수론의 기본 개념과 응용, 그리고 소수정리의 바탕이 되는 해석적 정수론의 기초를 학습한다."
  },
  {
    "courseCode": "GS4007",
    "courseDescription": "미적분학과 선형대수학을 기반으로 하여 유클리드 기하와 비유클리드 기하의 이해를 목표로 한다. 특히 곡면 기하를 익히기 위해서는 미분방정식에 대한 기본적인 이해가 필요하며 등거리 변환의 이해를 위해서는 대칭군이 필요하다."
  },
  {
    "courseCode": "GS4008",
    "courseDescription": "이 과목은 과학계산 과목의 심화 과목으로 나노 시대에 필요한 (동력학적) 몬테카를로 방법론 기초, 그리고 그 방법론의 특성과 여러 실레를 통한 몬테카를로 과학 연구 응용에 대해 공부한다."
  },
  {
    "courseCode": "GS4009",
    "courseDescription": "이 과목에서는 컴퓨터이론과 네트워크 이론의 토대가 되는 그래프의 여러 가지 수학적 성질에 대하여 배운다. 그래프와 그에 관련한 여러 가지 기본 개념들, 트리구조, Matching, Factor, Connectivity, Coloring, Planar Graphs, Ramsey Theory등을 엄밀한 증명을 토대 로 배우며 Algebraic method, probabilistic method와 같은 방법론도 공부한다. 또한, 실제로 응용되는 분야의 example도 다룬다."
  },
  {
    "courseCode": "GS4010",
    "courseDescription": "이 과목에서는 컴퓨터이론의 토대가 되는 이산구조의 원리와 이산구조를 다루는 다양한 방법을 다룬다. 또한, 수학적 사고가 필요한 기본 논리와 formal mathematical proof에 대한 개념, 방법을 배운다."
  },
  {
    "courseCode": "GS4015",
    "courseDescription": "본 강좌는 자연과학과 공학 전공 학생들 중 계산과학에 관심이 있는 학생들이 선택할 수 있는 수학 기초과목들 중 선택 과목이다. 과학계산 과목은 일명 수치해석이라고도 불린다. 계산과학의 수학적 언어인 과학계산의 소개로부터 시작하여 필수적 개념, 응용문제들을 다룬다. 과학계산의 기본 문제들인 유한요소법의 초기치 문제, 경계치 문제, 연립 선형방정식 풀이 방법, 비선형 문제 등에 대하여 학습한다. 추가로 유한요소법 외에 확률론적 방법론인 몬테카알로 (Monte Carlo)를 소개한다."
  },
  {
    "courseCode": "GS4016",
    "courseDescription": "The course is aimed to offer a basic introduction to topological properties of spaces, like continuity, convergence, compactness, metric spaces and metrizability. If time permits(although unlikely), the concept of the fundamental group will be discussed."
  },
  {
    "courseCode": "GS4017",
    "courseDescription": "이 과목에서는 Mathematica를 이용한 기호 계산과 이를 응용하여 수학, 과학 및 공학에서 흔히 접하게 되는 다양한 문제 의 해법을 익힌다. 주요 주제로는 공식의 변환, 방정식 해법, 미분학, 벡터 해석, 이산 수학, 연산자 해석, 비쥬얼 및 그래픽스 등이 있다. 이를 바탕으로 기호 계산을 응용하여 연결된 시스템 이론, 전자기학, 신호 처리 등을 다룬다.은 현대 과학의 연구에서 없어서는 안 될 기초, 필수 분야로 인식되고 있다. 학생들은 고급기기의 원리와 응용에 대해 이론적 수업을 거쳐, 실제 기기를 다루면서 장비활용에 대한 이해를 넓혀 개개인의 연구에 적용할 수 있는 지식을 습득하게 된다. 총 6개 분야로 나누어 이론과 실습을 하게 되고 최종적으로 활용기기에 대한 연구결과를 발표하게 된다.GS3831 과학기술학의 이해: 과학사회논쟁의 쟁점과 윤리 Understanding of STS): Issues and ethics in socio-technological controversies [3:0:3]Today we are witnessing that science and technologies become more and more the heart of political life as they are increasingly and fiercely contended in pubic sphere. This course, navigating the diverse controversies on science and technology, aims to understand major themes of STS(Science and Technology Studies, or Science, Technology and So -ciety). This course help student develop the understanding of the nature of science and technology and its role in society, exploring the blending moral, economic and social issues of the socio-technological controversies."
  },
  {
    "courseCode": "GS3838",
    "courseDescription": "Science and technology intersect with public policy in multiple ways. Why do societies fund science? How do they gov -ern it? Who is the best judge of the value of scientific research programs? How should policy-decision be made? What is the role of citizens in science policy? This course introduces theories and issues for S&T policy analyis. Students will learn a short history of S&T policy-making, the rationale of R&D funding, innovation policy, policy for bioethics, and the relationship of science and democracy."
  },
  {
    "courseCode": "GS3839",
    "courseDescription": "이 강의는 의료인류학의 주요 주제들과 과학기술학의 관련 주제들을 함께 다루면서 기초적인 내용을 제공할 것이다. 우리는 다음과 같은 여러 영역을 탐색하면서 건강, 질병, 생의학, 전염병 등을 이해하려고 시작할 것이다: 몸과 자아는 질병을 겪으면서 어떻게 재구성되는가? 건강과 질병이라는 아이디어는 어떻게 순환하는가? 어떻게 사회 제도들은 사회적 불평등을 건강 불평등으로 바꾸어내는가? 우리는 의료인류학과 의료사회학의 현대 저작들을 읽고 수업시간에 토론할 것이다."
  },
  {
    "courseCode": "GS3861",
    "courseDescription": "신경과학/뇌과학은 21세기 과학기술의 핵심 분야로서, 절학, 의학, 법학으로까지 그 연구가 연결 및 확장되고 있다. 뇌과학을 통해, 뇌와 정 신적 과정이 어떻게 기능하며 그것이 어떻게 인간 인지/행위의 기반을 이루는가에 대한 새로운 이해가 가능해지며, 그 결과 인간 존재에 대한 우리의 철학적, 의학적, 그리고 법적 이해와 대응도 크게 달라질 것이다. 이에 본 강좌는 현재 뇌과학이 법의 이론과 실무에서 어떻게 활용되고 있는지, 그리고 이 때 제기되는 주요 쟁점들이 무엇인지에 대한 이해를 제공할 것이다. 나아가 신경법학의 미래 전망까지도 짚어 볼 것이다."
  },
  {
    "courseCode": "GS3901",
    "courseDescription": "일본은 우리와 뗄 수 없는 관계에 있는 나라이지만 가까워지기에는 먼 나라이다. 이는 역사적으로 가해자와 피해자의 관계를 심정적으로 극복하지 못했기 때문이다. 더구나 일본이 앞으로도 세계의 선진국으로 존재가치를 유지할 수 있을 것이 가는 우리의 관심거리이다. 이를 보다 깊이 있게, 객관적으로 접근하려면 일본문화의 본질적인 면부터 검토하는 것이 필요할 것이다."
  },
  {
    "courseCode": "GS4002",
    "courseDescription": "복소해석학은 수론, 응용수학을 포함한 수학의 여러 분야뿐 아니라 물리학에서도 응용을 찾을 수 있다. 이 과목에서는 복소수의 연산을 기반으로 여러 종류의 복소변수 함수와 그 연속성, 미분성, 해석적 등의 정의를 학습하며 테일러 급수, 로랑 급수, 리우빌의 정리, 코시 정리, 해석적 접속, 리만 사상 정리 등 복소해석학의 가장 중요한 결과들을 익히고 푸리에 변환 등 복소함수의 적분과 의미, 응용에 대해 배운다."
  },
  {
    "courseCode": "GS4003",
    "courseDescription": "편미분 방정식은 수학, 과학 및 공학에서 널리 사용되어지는 분야로 미분과 미분방정식에 대한 지식을 기반으로 모델링과 시뮬레이션에 적용 할 수 있는 능력을 기르는 것을 목표로 한다."
  },
  {
    "courseCode": "GS4018",
    "courseDescription": "The aim of the course is understanding the topics in mathematical sciences and the application of Mathematica in- cluding the symbolica package. At the end of each topic, students are required to solve given problems using Math- ematica and present the solutions. The first topic is the modelling in mathematical biology, namely Keller Segel model in chemotaxis. The second topic is simple models in general relativity descibed using differential geometry. The third topic is fluid dy -namics, aiming to understand the Navier Stokes equation which is regarded as the most challenging PDE. To understand these topics, knowledges in vector calculus and differential equations are required."
  },
  {
    "courseCode": "GS4019",
    "courseDescription": "이 과목은 측도론을 기반으로 하여 확률 이론을 배우는 과정이다. 확률의 명확한 이해를 위해 측도론의 학습이 필수적이다. 기본적인 측도론 을 먼저 배우고 이를 확률공간에 적용하여 다양한 성질들을 유도하고 관련된 응용을 소개한다."
  },
  {
    "courseCode": "GS4301",
    "courseDescription": "이 과목은 계절학기 단기집중강좌의 하나로, 현대생물학의 근간이 되는 진화에 대해 역사적 배경부터 유전학적, 분자생물학적 방법을 통해 어떻게 진화가 이해되고 설명되어지는지에 대해 심화 강의 및 실험을 통해 논의된다. 그리고 Wallace Line 의 큰 축을 이루는 Lombok 섬으로 현장강의 및 실험실습을 감으로써 강의실 강의와 현장강의, 강의와 실험을 혼합하여 교육효과를 극대화한다."
  },
  {
    "courseCode": "GS4471",
    "courseDescription": "우리는 현재 지구의 생물학적, 화학적, 지질학적 과정에서 인간의 영향력이 크게 미치고 있는 새로운 지질 시대인 인류세(Anthropocene)에 살고 있다. 본 과목에서는 우리 행성의 현재 직면한 상황들과 앞으로의 전망에 대한 철저한 연구와 종합적인 개관을 논의함으로서 인간과 자연과 기술이 어떻게 상호 작용하는지에 대해 이해한다. 또한 생태적 지속 가능성, 경제적 번영, 정치적 측면에서의 정의 및 문화적 활력의 균형 등에 관한 논의도 함께 포함 하고자 한다."
  },
  {
    "courseCode": "GS4741",
    "courseDescription": "본 과목은 학생들에게 인간의 삶이 과학과 기술에 의해 어떠한 영향을 받는지에 대한 이해를 제공하기 위하여 계획되었다. 본 교과의 주된 내용은 과학과 기술이 인간의 기본적 정보처리과정에서부터 인터넷 중독, 사이버 왕따 등의 사회적 문제까지 얼마나 다양하게 인간의 마음과 행동에 영향을 줄 수 있는지에 대한 연구를 소개하고 논의하는 것들이다. 본 수업은 수업자료를 미리 숙지하고 실제 수업은 100% 토론 에 의해서 진행될 것이다."
  },
  {
    "courseCode": "GS4761",
    "courseDescription": "본 과목은 최첨단의 과학기술이라 할 로봇기술을 둘러싼 윤리적 쟁점들을 다룬다. 우리가 현재 맞이하고 있고 향후 도래할 로봇 및 사이보그의 사회에서 당면하게 될 여러 심각한 윤리적 쟁점들을 고민해 보는 중요한 기회를 갖고자 한다. 학기 전반부에는 로봇기술 전반의 개괄 및 로봇의 자율성과 책임 등 로봇윤리의 일반적 문제들을 주로 다루고, 학기 후반부에는 로봇시대에 당면할 개별적인 윤리적 문제들을 다룰 것이다."
  },
  {
    "courseCode": "GS4762",
    "courseDescription": "본 과목은 최첨단의 과학기술이라 할 로봇기술을 둘러싼 법적 쟁점들을 다룬다. 학기 전반부에서는 인공지능 로봇 기술의 적용 범주별(의료 용, 군사용, 사회적 로봇, 자율차 등)로 법적 쟁점들을 개괄한 후, 후반부에서는 각종 법적 문제들을 보다 각론적으로 (가령, 로봇의 헌법적 지위, 로봇의 행위와 관련한 민사손해배상의 책임, 범죄 및 형사적 책임 등) 다룰 것이다."
  },
  {
    "courseCode": "GS4837",
    "courseDescription": "Micro dust, Artificial intelligence, Robot, GMO and climate change are often called “Hybrid entities” as society is in -separably intertwined with science within them. Those hybrid entities increasingly become important part of our ever -day life and so new ideas or social theories are urgently needed to undertand their nature and workings. This course explores major concepts and ideas about Actor-Network theory, one of theories to aims to address the hybrid entities. Students are required to read the articles related to ANT theory, especially Bruno Latour’s ones and encouraged to have discussion about them with each other. This course offers students a unique and creative perspective to help understand the modern world."
  },
  {
    "courseCode": "GS1901",
    "courseDescription": "<GIST 새내기>는 GIST대학 신입생들이 대학생활에 적응하고 학문 탐구의 기본 태도를 갖춰 전공 선택과 진로 설계를 잘 할 수 있도록 돕는 강좌이다. 또한 지스트인으로서의 정체성과 자긍심, 시민적 소양과 책임감을 갖춘 성숙한 과학기술인재로 성장하도록 돕는 GIST 교육 첫 단계이다. <GIST 새내기>는 1학점 공통필수 교과과목으로 운영한다. GIST 101 is designed to help GIST first-years to successfully integrate into college life and acquire essential academic skills required to explore their academic major and future career. This orientation course also purposes to nourish the students with the proud identity as member of the GIST community and a strong sense of citizenship and responsibility towards society, so that they mature as future talents and leaders in science and engineering. GIST 101 is a mandatory one-credit course."
  },
  {
    "courseCode": "UC0201",
    "courseDescription": "사회봉사 활동을 통하여 소외계층의 신체적ㆍ심리적 역정을 함께 경험하게 함으로써 그들을 이해하고 더불어 살아가는 사회를 만드는데 사회봉사의 중요성과 의미를 일깨워 주고자 한다."
  },
  {
    "courseCode": "UC0202",
    "courseDescription": "본 과목은 학부생들의 ‘무한도전 프로젝트’ 창의함양 프로그램 참여를 독려하여 제4차 산업혁명 도래 등 변화하는 사회적 패러다임을 적극적으로 수영하고, 시대가 요구하는 창의성, 의사소통 능력, 협동 능력 및 문제 해결 능력(3C1P)를 갖춘 창의적인 융합형 인재로 성장할 수 있도록 돕는다."
  },
  {
    "courseCode": "UC0203",
    "courseDescription": "본 과목은 ‘GIST-NIA 공동파견 월드프렌즈 ICT봉사단’ 등의 해외봉사 파견 프로그램 참여를 통해 희생과 봉사 정신의 가치를 깨닫고 실천할 수 있는 기회를 제공한다. 이로써 타인의 삶을 이해하고 존중할 줄 아는 글로벌 과학기술인으로 성장할 수 있도록 돕는다.※ ‘월드프렌즈 ICT봉사단’ 등 해당 사업이 요구하는 이수 기준을 충족하고, 32시간 이상의 봉사활동을 수행해야 한다."
  },
  {
    "courseCode": "UC0301",
    "courseDescription": "현대사회에서 겪게 되는 적응상의 여러 문제들에 대해 상담심리학적 지식을 적용하여, 보다 나은 적응과 자기성장을 이룰 수 있도록 현실적인 접근을 시도한다.  주요 주제로는 자기이해, 자기존중감, 성격, 의사소통, 우정과 사랑, 진로, 스트레스 관리, 주요 정신장애에 대한 이해, 삶과 죽음 등을 들 수 있다."
  },
  {
    "courseCode": "UC0901",
    "courseDescription": "The economic and social impact of science and technology is addressed. Especially the subject that most economic growth is elicited by technology innovation is covered. Most topics having to do with technology entrepreneurship are dealt with by technology entrepreneurs who are pursuing, have pursued or pursued technology ventures ranging from large companies to small or medium sized companies. The inspiration given by their experiences is beneficial to future scientists and technologists who want to get involved in R&D or to create their own technology ventures."
  },
  {
    "courseCode": "UC0902",
    "courseDescription": ""
  },
  {
    "courseCode": "UC9331",
    "courseDescription": "전공 각 분야와 관련된 최근의 연구 활동 및 앞으로의 연구방향에 대하여 내외부전문가들을 초청하여 강의를 듣고 관심사항들에 대하여 토론을 한다. "
  },
  {
    "courseCode": "EC2105",
    "courseDescription": "본 과목은 축전기, 모터, 발전기 및 변압기, 미세전자기계시스템 등 공학적 응용들에서의 필요한 정전자기 현상 들을 살펴본다. 전하, 전기장 및 자기장, 전기 포텐셜, 벡터 포텐셜, 전류 밀도 등의 기본적인 개념을 소개한다."
  },
  {
    "courseCode": "EC2201",
    "courseDescription": "전기 및 컴퓨터 공학을 이해하기 위한 기초소양을 닦는 것을 목표로 한다. 전기 및 전자회로, 전력전자, 통신회로의 구현, 제어 시스템 등가 모델 구현을 위해 필수적인 저항, 축전기, 인덕터, 전압원, 전류원 등의 추상화된 소자를 이해하고, 이러한 소자들로 이루어진 전기회로의 과도상태 및 정상상태 해석, 주파수 응답해석, 다이오드, 트랜지스터, 연산증폭기를 활용한 기본 회로를 이해하고 설계한다."
  },
  {
    "courseCode": "EC2202",
    "courseDescription": "이 교과목은 데이터 구조와 객체 지향 프로그래밍 대한 핵심적인 기본 원리를 소개 한다. 이 교과목에서는 상속, 추상 클래스, 캡슐화 등의 고급 객체 지향 프로그래밍 기법들과 어레이, 링크드 리스트, 스택, 큐, 트리, 맵, 그래프 등의 자료 구조를 배운다. 또한, 서치 트리, 정렬 등의 알고리즘과 대규모 프로그램의 디자인과 구현을 위한 소프트웨어 프로그래밍의 기본 개념들을 배우게 된다."
  },
  {
    "courseCode": "EC2203",
    "courseDescription": "이 교과목은 디지털 하드웨어 시스템을 설계하고 구현하는데 필요한 핵심적인 기본 원리와 기술들을 다루는 디지털 논리 회로의 입문 교과목으로, 특히 숫자 체계, 논리 게이트, 고정 소수점 표현법, 불 함수, 불 대수, 조합 및 , 순서 논리 회로, 플립플롭, 레지스터, 프로그래머블 논리 소자 등의 기본 원리를 다룬다. 또한 다양한 디지털 기능을 구현하기 위한 기본 구 성 요소를 소개하고 학생들이 컴퓨터 시스템 설계와 관련된 상급 교과목을 수강하는데 필요한 기반 지식을 제공하게 된다."
  },
  {
    "courseCode": "EC2204",
    "courseDescription": "컴퓨터의 명령어 집합을 기반으로 기본적인 구조와 동작 및 설계 원리를 이해시킨다. 특히 컴퓨터의 성능을 중심으로 내용을 전개하고, 컴퓨터의 성능 향상에 사용되는 최신 고급 기술인 파이프라이닝, 캐시 메모리, I/O장치 등을 학습한다."
  },
  {
    "courseCode": "EC2205",
    "courseDescription": "본 과목에서는 정전자기장에 대한 기존의 이해를 바탕으로, 시간에 따라 변화하는 전자기장에 대한 기본적인 특성을 이해하고자 하는데 특히 전자기파의 공학적인 응용에 초점을 맞춘다. 가장 간단한 평면파를 통해 Maxwell 방정식과 전자기파의 기본 특성을 이해한다. 전송선 로에서의 신호 및 파워의 전달과 임피던스 정합을 학습한다. 또한 광도파로의 역할과 도파모드의 형성에 대한 개념을 공부한다."
  },
  {
    "courseCode": "EC2206",
    "courseDescription": "이 교과목은 전산 알고리즘에 핵심적인 원리를 소개 한다. 이 교과목에서는 그래프, 분할정복, 동적계획, 탐욕 알고리즘, 되추적, 분기한 정법, 계산복잡도, NP 이론, 휴리스틱 알고리즘에 대한 개념을 배우게 된다."
  },
  {
    "courseCode": "EC3101",
    "courseDescription": "본 실험교과목은 전자 소자 및 회로 과목의 실습 과목으로 이론에 대한 실제 실험을 통해 전자소자 및 회로에 대 한 동작 원리에 대하여 이해함을 목표로 한다. 본 교과목은 전반부에서는 전자 소자 및 기초 회로에 해당하는 다이오드, BJT, MOSFET과 같은 기초 전자 소자에 대한 동작 원리를 이해하고 이를 이용한 오디오 증폭기를 직 접 설계, 구현함으로써 전자 소자 및 회로 동작 원리에 대하여 이해한다. 후반부에서는 수강 학생들이 직접 전자 회로에 대한 주제를 선정하여 프로젝트를 진행하고 이를 수행함으로써 실제 연구 및 산업계에서 발생할 수 있는 연구 수행 및 문제 해결 능력을 배양한다."
  },
  {
    "courseCode": "EC3102",
    "courseDescription": "컴퓨터 시스템 전반에 걸친 시스템 차원의 이해와 실제적인 프로그래밍 경험을 하도록 지도하는 교과목이다. 컴퓨터 시스템에 관한 다양한 이슈들을 운영체제, 컴퓨터 네트워킹 측면과 연계하여 이해하도록 도모한다. 또한 다 양한 컴퓨터 시스템에 대한 하드웨어 및 소프트웨어의 구조에 대한 이해를 실증적으로 체험하여 컴퓨터 시스템에 대한 자유로운 활용이 가능하도록 실습도 병행한다. 미래형 ICT 인프라가 제공하는 Cloud 및 Big Data 대응 컴퓨터 시스템에 대한 전반적인 의미를 실증적으로 확인하도록 실습 주제를 선택하고 학생 각 개인이 모두 개별적으로 자신만의 컴퓨터 시스템을 구축/운용하는 실습 방식으로 진행하는 것을 목표로 한다."
  },
  {
    "courseCode": "EC3202",
    "courseDescription": "본 과목에서는 연속 및 이산 선형시 불변 신호의 해석과 이들 신호와 시스템과의 상호작용에 대한 기초를 다룬다. 이를 위해 푸리에 급수 와 변환을 포한하는 복소수 주파수분석, 라플라스와 Z-변환, 충격응답, 샘플링, 필터링, 변조 및 컨볼루션에 대한 개념과 그 방법을 이 해한다."
  },
  {
    "courseCode": "EC3204",
    "courseDescription": "본 교과목에서는 프로그래밍 언어의 동작 원리를 이해함을 목표로 한다. 구체적으로 다루게 될 주제들은 언어 설계상의 요소들 (이름, 값, 타 입, 제어 흐롬 및 추상화), 구현 기술 (구문 분석, 의미 분석, 해석, 컴파일 및 최적화) 및 주요 언어 설계 패러다임 (순서중심, 물건중심, 함 수중심l)들이다. 수업 과제를 통하여 프로그래밍 언어를 설계하고 및 구현하는 과정에서 발생하는 현실적인 문제들을 직접 이해하도록 한다."
  },
  {
    "courseCode": "EC3206",
    "courseDescription": "이 교과목에서는, 반도체 소재 및 소자의 전기적, 광학적 특성을 이해하는 데 필요한 물리학적 기저를 양자역학과 고체 물리학의 개념을 기반으로 다룬다. 수업 과정을 통해 학부 과정 수준의 전기 소자의 작동 원리를 다루고, 이에 따른 실제 활용 방법을 설명한다. 구체적으로 다 를 수업 주제는 고체 결정 구조, 에너지 띠 이론, 전하의 분포와 결합, p-n접합 구조, 광소자를 아우르는 작동 원리와 더불어 바이폴라 접 합 트랜지스터와 모스 전계 효과 트랜지스터를 다룬다."
  },
  {
    "courseCode": "EC3207",
    "courseDescription": "본 과목은 반도체 소자에 기초하여 아날로그, 디지털 집적회로 설계를 위한 1단 증폭기, 캐스코드 증폭기, 차동 증폭기 그리고 연산 증폭기 에 대해서 강의한다. 또한 집적 회로 증폭기의 주파수 응답을 해석하고 설계하는 방법과 증폭기의 잡음 특성, 그리고 궤환 회로에 대한 해석 과 설계에 대해서 강의한다. 또한 증폭기의 대신호 특성에 매우 중요한 집적회로의 비선형성 해석에 대하여 강의한다."
  },
  {
    "courseCode": "EC3212",
    "courseDescription": "기본적인 MOS 트랜지스터의 동작을 리뷰하고 단일단 증폭기, cascode 증폭기, 차동 증폭기, operational amplifier등을 설계한다. 주파수 영역에서의 회로 특성을 분석한다. 피드백 회로에서 주파수 응답 특성을 분석하고 위상 마진을 위한 주파수 보상 기법을 배운다. 트랜지스터 회로의 비선형성 및 노이즈를 배우고 이를 줄이는 회로 기법을 배운다. 또한 안정적이 기준 전압 및 전류 발생 회로를 배운다."
  },
  {
    "courseCode": "EC3214",
    "courseDescription": "본 강의는 크게 3가지로 구성된다. 첫번째 파트는 마이크로프로세서(ARM 프로세서)의 기본구조, registers, 메모리, 케시 등의 구조와 입출력 작동, 기본적인 assembly language에 의한 프로세서의 구동 방법을 배운다. 두번째 파트는 ARM 기반의 마이크로프로세서 및 프로세서 사용법을 실습수업을 통하여 학습한다. 마지막으로 수강에 참여한 학생들은 ARM 프로세서 기반으로 이동로봇 등의 임베디드시스템 구현을 통하여 프로젝트를 수행하게 된다. 수행한 프로젝트는 중간고사 전후 및 기말고사 전후에 공개 데모를 수행하여 평가받게 된다."
  },
  {
    "courseCode": "EC3215",
    "courseDescription": "본 과목은 다른 소프트웨어 개발을 도와주는 소프트웨어(시스템 소프트웨어)를 학습한다. 시스템 소프트웨어는 컴파일러(기계어/링커), 운영체제, 과학계산 프로그램, 게임 엔진, 산업 자동화와 같이 응용 프로그램에 서비스를 제공하는 소프트웨어이다. 시스템 소프트웨어는 응용 프로그램과 하드웨어 중간에 위치하여 응용 프로그램과 하드웨어를 연결한다. 본 과목을 통해서 컴퓨터 무대 뒤에서 일어나는 상황을 이해할 수 있다."
  },
  {
    "courseCode": "EC3216",
    "courseDescription": "컴퓨터공학의 전반 분야에서 기초가 되는 형식 언어, 오토마타, 문법, 계산 복잡도 등의 주요 이론 및 개념들을 소개한다. 소개되는 주요 내 용들은 유한 오토마타, 정규 언어, 문맥 무관 문법, 푸쉬다운 오토마타, 펌핑 렘마, 튜링 머신, 촘스키 계층, 순환적 열거 기능언어, 결정 성/비결정성, 풀 수 없는 문제, 계산 복잡도 등으로 요약할 수 있다."
  },
  {
    "courseCode": "EC3218",
    "courseDescription": "통신공학을 이론교육과 디자인 교육을 적절히 혼합하여 소개하는 것을 목표로 한다.안테나를 통한 신호전달과정, 아날로그 및 디지털 변조, AM/FM 신호, 신호 검출, 라인코드, 광대역통신, 셀룰라 네트워크, 다중접속방법 등, 통신시스템 설계를 위한 주요 이론들을 이해하고, MATLAB 모의시험 및 소프트웨어 래디오를 통하여 간단한 통신시스템을 설계한다."
  },
  {
    "courseCode": "EC3219",
    "courseDescription": "In order to understand the various physical systems such as hydraulic, mechanical, electrical, magnetic, and thermal systems in terms of energy or power exchange, a bond graph modeling technique is introduced. Con -ventional control theory in the time and frequency domains are covered with the consideration of sensor and actuator, voltage and current amplifier, and various signal processing techniques. Not only the basic knowl -edge related to control techniques but also control engineering sense based on the experimental works are emphasized."
  },
  {
    "courseCode": "EC3220",
    "courseDescription": "이 과목에서는 산업응용에서 널리 사용되는 여러 가지 기본적인 회로 구성에 대해서 설명한다. 덧붙여, 산업용 회로 동작을 이해하기 위해서 기본적인 구성과 관련된 관련 개념들에 대해서도 논의한다. 이 과목을 통해 배운 개념들은 다른 전력 관련 교과들에 대한 기본적인 배경을 제공할 수 있다."
  },
  {
    "courseCode": "EC4202",
    "courseDescription": "본 과목은 CMOS공정을 이용한 디지털 집적회로를 설계하고 분석하는데 필요한 기초지식을 습득하는 것을 목표로 한다. 학생들은 현재 대부분의 디지털 집적 회로를 구성하는 기본회로인 조합/순차 로직회로, 다이나믹 로직회로, 반도체 메모리회로 등을 설계하고 분석하는 방법을 배울 것이다. 이와 더불어 실제 집적회로를 구성할 때 고려해야 할 공정 변화, 각종 기생 회로 성분 및 전달 지연 등도 심도 있게 논의 될 것이다."
  },
  {
    "courseCode": "EC4203",
    "courseDescription": "초고주파 및 RF 기술, 회로망 해석 및 합성은 무선통신 시스템, 초고주파 회로를 이해하는 기본이 된다. 본 강좌에서는 맥스웰 방정식에서 초고주파 전송선 이론을 유도하는 것으로부터 시작하여 전자파 발생, 자유공간 및 도파로를 통한 전파 특성을 공부한다. 집중정수회로 및 분포회로를 이용한 임피던스 변환기, 필터, 전력 분배 기 및 결합기를 설계하고 해석하며, 스미스 차트와 S-파라메터를 이용한 초고주파 회로를 설계 방법론을 이해하고 컴퓨터 설계 도구를 이용한 설계 실습을 수행한다."
  },
  {
    "courseCode": "EC4204",
    "courseDescription": "데이터베이스를 구성하는 기본적인 개념과 데이터베이스 구현에 관한 주제들을 다룬다. 본 강좌에서는 데이터베이스 구조, 개념적인 데이터 모델링, 데이터베이스 질의 언어, 관계형 데이터베이스, 객체지향 데이터베이스, 트랜잭션, 동시성 제어 및 회복에 관련된 주제들을 다룬다."
  },
  {
    "courseCode": "EC4205",
    "courseDescription": "본 강좌는 범용적인 컴퓨터에서 사용되는 운영체제의 개념 및 디자인에 관한 내용을 다룬다. 주요 토픽은 프로세스, 쓰레드, 프로세스 스케줄링, 프로세스 동기화, 멀티-프로세싱, 데드락 회피, 파일 시스템, 메모리 관리 및 보안이다. 주요 개념들은 다양한 운영 체제에서 사용 하는 예제를 사용하여 설명하며, 이 개념들 사이의 연관성에 대한 이해를 높이는데 중점을 둔다."
  },
  {
    "courseCode": "EC4206",
    "courseDescription": "컴퓨터 기반의 데이터통신의 기초와 최신 기술발전에 대해 이해하는 것을 목표로 한다. 네트워크 프로토콜, 구조에 대해 다양한 기술을 공부하게 되는데, 이러한 기술은 IP기반의 네트웍 구조 설계를 위한 원리, 전송 프로토콜, 인터넷 라우팅 기초, 라우터 설계, 네트워크 소스 관리, 네트워크 안전, P-to-P 네트워크 등을 포함한다."
  },
  {
    "courseCode": "EC4207",
    "courseDescription": "그래프이론은 전산학의 이론적 토대를 이루는 학문이다. 또한 그래프이론의 체계적 학습을 통하여 수학적 사고 훈련을 할 수 있다. 이 과목 에서는 그래프이론의 기초가 되는 개념과 알려진 결과를 소개하고 그 응용에 대하여 배운다."
  },
  {
    "courseCode": "EC4209",
    "courseDescription": "The module introduces the basic concepts in search and knowledge representation as well as to a number of sub-areas of artificial intelligence. It focuses on covering the essential concepts in AI. The module covers intel -ligent agents; uninformed/blind search: breadth- first search, uniform-cost search, depth-first search, depth-limited search, iterative deepening search; informed/heuristic search: greedy best-first search, A* algorithm; local search: hill climbing and simulated annealing; adversarial search: minimax algorithm and alpha-beta pruning; constraint satisfaction problems: backtracking search, constraint propagation, local search; logical agents: propositional logic, first-order logic, logical inference; uncertainty: Bayes’ rule, Bayesian inference, independence and conditional independence, Bayesian networks; fuzzy logic; neural networks; machine learning: decision tree learning, naive Bayes classifier."
  },
  {
    "courseCode": "EC4210",
    "courseDescription": "This course aims at providing the fundamental concepts of random processes for electrical engineering and computer science. Topics include probability and random variables; random processes and sequences; response of linear systems to random inputs; correlation; power spectral density; and specific random processes such as Wiener process, Poisson process, and Markov process. Students are expected to be able to apply the fundamental concepts of random process to the problems related with communication, signal processing, and networking research areas, upon completion of this course."
  },
  {
    "courseCode": "EC4211",
    "courseDescription": "In this course, we study the fundamentals of discrete-time signals, systems, modern digital processing algo -rithms and applications. The main topics to be covered in this course are: Discrete-Time Signals and Systems, Frequency Analysis of Signals and Systems, The z-Transform, DFT and FFT, Digital Filter Design, Sampling and Reconstruction of Signals, Multi-Rate Digital Signal Processing."
  },
  {
    "courseCode": "EC4212",
    "courseDescription": "본 교과목에서는 실수 같이 연속적인 성질이 있는 대상이 아니라 주로 정수, 그래프, 논리 연산 같이 서로 구분되는 값을 가지는 대상을 학 습한다. 더 구체적으로는 논리구조, 증명방법, 정수론, 그래프, 트리구조 및 이산 확률에 대한 내용을 다룬다."
  },
  {
    "courseCode": "EC4213",
    "courseDescription": "The main concerns of this course are the fundamental machine learning theories including the Bayasian, the ar -tificial neural networks, the Support vector machines, and several clustering algorithms. Applications to speech recognition, face recognition, biomedical data mining, and image segmentation/classification will also be con -sidered to for the term projects."
  },
  {
    "courseCode": "EC4214",
    "courseDescription": "본 교과목은 현재 기술에 있어 빛의 이용과 응용에 관한 광공학의 기본개념을 소개하는데 다음과 같은 네 개의 주제를 논의한다 : 1. 빛의 특성, 2. 빛의 발생, 3. 빛의 검출, 4. 빛의 응용. 강의 범위는 빛의 고전적 특성은 물론 양자적 특성도 포함한다."
  },
  {
    "courseCode": "EC4215",
    "courseDescription": "Introduction to 2D and 3D graphics, rasterization, representation of curve/surface/solid, shading, and graphics hardware will be discussed."
  },
  {
    "courseCode": "EC4216",
    "courseDescription": "Research in computer vision has been booming over 20 years, and has been expected to apply for various in -dustries such as autonomous driving, augmented reality and AI system. In this course, we study breakthrough computer vision algorithms from traditional approaches to recent machine learning-based approaches. The goal of this course is that students have research interests in computer vision field and they design new research topics motivated by the breakthrough algorithms. All students will be evaluated by three programming assign -ments and one research project presentation."
  },
  {
    "courseCode": "EC4218",
    "courseDescription": "Visualization refers to the encoding of information into visual forms and its communication to others for purposes of understanding and knowledge acquisition. Visualization is a defining quality of humanity with about 30% of the brain's cortex along with subcortical structures devoted to visual processing. Visualization is used daily across all human endeavors. It is often crucial to be able to quickly, efficiently and effectively communicate complex information to people, especially in time, mission and resource critical applications. This course covers the fun -damentals of visualization; from information encoding into visual forms to its presentation. Students will complete scientific and information visualization presentations using a variety of visualization software including Paraview."
  },
  {
    "courseCode": "EC4219",
    "courseDescription": "This course introduces software engineering and covers fundamental topics in software engineering. Major top -ics include: software development ethics; software process models; the roles of design, implementation, testing and evolution; Agile software development; requirements, introduction to UML; systems modeling and design; and implementation and testing."
  },
  {
    "courseCode": "EC4220",
    "courseDescription": ""
  },
  {
    "courseCode": "EC4301",
    "courseDescription": ""
  },
  {
    "courseCode": "EC4302",
    "courseDescription": ""
  },
  {
    "courseCode": "EC4304",
    "courseDescription": "Power electronics considers power conversion and its control by modulating power-semiconductors. This course aims at understanding the fundamental circuit operations in power electronics. Various fundamental circuits are introduced and explained with their steady-state operations."
  },
  {
    "courseCode": "EC4306",
    "courseDescription": "This course provides students with an introduction to the basic concepts of power systems. Basic features of electric power systems including phasor, complex power, and three-phase circuits are presented in the first place of the course. To offer students with the capability of transmission system analysis, the key knowledge about power transformer, transmission line parameters, and power flow analysis are provided in the course. The fundamental economic operation of power systems is illustrated in terms of minimizing fuel cost of generation systems. Fault analysis and brief introduction to distribution system are also studied in this course."
  },
  {
    "courseCode": "EC4307",
    "courseDescription": "본 강의에서는 배전시스템계획, 부하특성, 배전변압기, 선로설계, 배전변전소, 1차 및 2차 배전시스템에 대해서 다룬다. 전압 강하 및 전력손실계산, 커패시터의 적용 방안, 고조파, 전압규정, 시스템 보호, 신뢰도 및 전력 품질의 이슈들도 포함하고 있다. 관련된 이슈들을 이해하기 위해 새로운 주제, 예제, 문제들을 다룬다."
  },
  {
    "courseCode": "EC4308",
    "courseDescription": "이 과목은 수강생들 에게 CMOS 공정의 전반적인 이론 및 장비를 활용한 실습 기술을 제공하고자 함. 수강생들은 먼저 기초적인 MOSFET에 관련된 소자 이론을 배우고, MOSFET을 제작할 수 있는 기본적인 CMOS 공정의 이론을 배우게 됨. 이후에, EECS 반도체 공정실의 공정 실험 장비 및 측정 장비를 통한 실습을 진행하게 됨."
  },
  {
    "courseCode": "EC4309",
    "courseDescription": "집적회로를 설계하는 과정을 가르치는 과목이다. 이 과목의 목표는 아날로그 회로 및 디지털 회로의 설계 과정을 이해하고 경험하는 것이다. 아날로그 회로를 시뮬레이션하고, 레이아웃하여 구현하는 것부터 베릴로그 코드를 합성하고, place-and-route하여 디지털 회로를 설계하는 과정까지 배우게 된다."
  },
  {
    "courseCode": "EC4310",
    "courseDescription": "정보 이론 입문; 다루는 주제에는 엔트로피, 상호 정보, 점근적 등분할 이론, 엔트로피 비율, 데이터 압축, 노이즈 채널 용량, 채널 코딩 정리가 포함된다. 블록체인, 기계학습 및 분류, 부호 및 암호화에 대한 기본 정보 이론적 아이디어의 적용."
  },
  {
    "courseCode": "EC9101",
    "courseDescription": "2010~2014학번 학생들의 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "EC9102",
    "courseDescription": "2015학번, 이상 학생들의 학사학위 논문을 준비하기 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성하여야 한다."
  },
  {
    "courseCode": "EC9103",
    "courseDescription": "2015학번 이상 학생들의 최종 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "MA2101",
    "courseDescription": "재료 전반에 관한 기초 이론과 함께 재료의 구조, 특성 및 응용에 대한 폭넓은 지식을 습득하는 것을 목적으로 한다. 다양한 재료들의 구조와 특성을 공부하면서, 재료의 결정구조, 고체 결함 및 확산, 상평형도를 이 해하는 기초를 제공하고자 한다. 또한, 재료의 전기적, 열적, 자기적, 광학적 특성을 이해하여 신소재를 제 조하고 다양한 분야에 응용할 수 있는 능력을 배양하고자 한다."
  },
  {
    "courseCode": "MA2102",
    "courseDescription": "열역학 제1, 제2, 제3 법칙에 대해 기본적인 개념을 공부한다. Gibbs free energy 개념을 도입하고 이를 기반으로 상평형의 의미와 상평형 도형을 공부한다. 기본적인 통계 열역학 개념과 partition function을 매개로 하여 고전 열역학과의 관계를 살펴본다."
  },
  {
    "courseCode": "MA2103",
    "courseDescription": "이 과목은 신소재 전공자들의 유기재료 설계 및 합성을 위해 유기분자의 구조 및 결합에 관한 기초 개념을 바탕으로 다양한 작용기들의 특성과 반응성, 반응경로, 작용기간 전환반응에 대한 이해를 돕고자 개설되었다."
  },
  {
    "courseCode": "MA2201",
    "courseDescription": "본 교과목은 거시적 열역학과 미시적 양자화학을 연결하는 통합적 개념을 바탕으로 재료과학에서 물질의 성질에 대한 이해에 필요한 물리화학적 기본 지식을 확립하는 것을 목적으로 한다. 열역학 및 양자화학의 기본 개념 요약, 통계열역학, 반응속도론, 반응동력학, 분자간인력, 고분자 및 고체, 표면 및 촉매 화학의 주제를 포괄적으로 다룬다."
  },
  {
    "courseCode": "MA2202",
    "courseDescription": "본 교과목은 전자의 거동 및 재료의 전자물리적 이해를 위한 기본 개념 확립과 관련 심화 분야 소개를 목표로 한다. 전자 재료의 기초 원리라 할 수 있는 파장의 입자성, 입자의 파장성, 양자 역학, 원자 모형, 고체 상태, 결정 구조, 밴드 이론, 반도체 등을 개론식으로 다룬다."
  },
  {
    "courseCode": "MA3104",
    "courseDescription": "본 실험교과는 다양한 재료과학 및 재료공학 연구 분야에서 필요한 기본적인 실험기술 및 데이터 분석에 대한 내용을 제공한다. 본 실험 교과를 수강하는 학부 대학생들은 재료박막 합성, 반도체 및 에너지전극 재료의 합성 및 물리화학적 특성분석에 대해 배우고 실험한다."
  },
  {
    "courseCode": "MA3105",
    "courseDescription": "본 실험교과는 다양한 재료과학 및 재료공학 연구 분야에서 필요한 기본적인 실험기술 및 데이터 분석에 대한 내용을 제공한다. 본 실험교과를 수강하는 학부 대학생들은 고분자 유기재료의 합성법을 배우고, 생체재료 및 광전소재의 물리화학적 특성분석과 적용에 대해 실험한다."
  },
  {
    "courseCode": "MA3203",
    "courseDescription": "재료의 물리적, 기계적, 화학적, 전자기적, 광학적 성질 등은 재료를 구성하는 원자의 종류와 이 원자의 배열인 결정 구조에 의해 정 해진다. 따라서 새로운 재료를 개발하거나, 혹은 재료의 성질을 규명하거나 이해하는 데 있어서 결정 구조에 대한 지식과 이해가 필수적으로 요구된다. 따라서 본 과목을 통해 결정학적 지식에 기반한 재료의 결정 구조를 학습하고 또한 재료의 결정 구조와 다양한 물성간의 상관관계, 나아가 X선 회절의 원리에 대해 이해하고자 한다."
  },
  {
    "courseCode": "MA3204",
    "courseDescription": "상변태 과목에서는 재료에 관련된 열역학, 상태도, 확산, 결정계면, 미세조직, 핵생성과 성장 등에 대한 기본적인 이론을 다룬다. 궁극적으로 이러한 이론을 바탕으로 원하는 재료의 구조를 제작하고, 이 구조의 열역학적 그리고 운동학적인 상태를 조절하는 것을 목적으로 한다."
  },
  {
    "courseCode": "MA3207",
    "courseDescription": "본 과목은 전기화학의 기초 원리 및 지식을 습득하며 전극이나 전해질 등의 재료적 측면의 특성과 원리를 이해한다. 응용으로서 전기 화학 시스템의 이해 및 활용되는 재료들에 대해서 고찰한다."
  },
  {
    "courseCode": "MA3208",
    "courseDescription": "본 과목은 재료공학 분야의 학부과정 학생에게 생체재료와 응용에 관한 기초적인 지식을 습득할 수 있도록 함을 목적으로 한다. 본 과 목의 초기 7주 동안은 생체재료의 기초적인 요소와 역할, 바이오시스템과의 상호적용을 공부하며, 이후 3주간은 다양한 생체재료와 이의 특성들, 나머지 기간 동안은 생체재료기반의 응용에 관하여 과목이 진행될 것이다."
  },
  {
    "courseCode": "MA3209",
    "courseDescription": "본 수업에서는 응력과 변형의 관계-거시적인 기계적 특성이 어떻게 재료의 구조 및 미세구조와 관련되어 있는지를 원자, 분자부터 연속체 수준까지 다룬다. 본 수업을 통해 탄성, 비탄성 변성 및 결함, 피로, 분쇄 현상을 금속, 세라믹, 고분자, 복합체를 아울러 배우며, 원하는 기계적 특성을 얻기 위한 재료의 디자인 및 공정에 대해 배운다."
  },
  {
    "courseCode": "MA3210",
    "courseDescription": "기초과학 기본 지식을 갖춘 재료과학, 화학, 화학 공학 분야의 학생들을 대상으로 한 고분자화학 및 기술에 대한 입문 과목으로서, 고 분자의 종류 및 합성, 반응, 개질, 및 특성 등의 주제를 다룬다."
  },
  {
    "courseCode": "MA3211",
    "courseDescription": "본 교과목은 기기를 이용한 화학적/전기화학적 측정법과 분리 분석법의 원리와 응용을 배우고, 이를 통하여 복잡한 화학물 (특히 유기물 기반)의 구조 및 특성을 해석하고 이해하는 것을 목적으로 한다. NMR, IR, UV-vis, mass spectrometry, cyclic voltam- metry 등의 기기와 chromatography 등의 분리법을 포괄적으로 공부한다."
  },
  {
    "courseCode": "MA3212",
    "courseDescription": "나노기술은 나노단위의 물질이 가지는 고유의 특성을 이해하고 사용할 수 있게 한다. 본 강의는 나노물질의 가본적인 특성과 나노소재 및 소자 제작을 위한 전통적/비전통적 공정법, 나노단위 소재의 특성 분석법 및 전자소자로의 응용을 소개하며 기본적인 나노과학의 개념을 학습하는데 목적이 있다. 학생들은 다양한 차원의 나노물질을 위한 building block의 개념과 각 차원의 나노 물질이 가지는 효과적인 물리, 화학, 기계적, 광학적 특성을 이해하며 나노센서와 나노소자로 응용할 수 있는 방법들을 고찰하게 될 것이다."
  },
  {
    "courseCode": "MA4202",
    "courseDescription": "본 강의에서는 진공 시스템의 운용,고체 박막의 성장과 식각을 위한 다양한 물리 및 화학적 방법들에 대해서 소개한다.진공기술에서는 진공의 생성, 측정, 진공시스템의 운용에 관하여 설명한다. 박막의 성장 및 식각 공정에서는 증발 증착,스퍼터링,이온 빔 프로세스,화학기상증착,다양한 플라즈마 증착 및 식각 프로세스 및 모니터링 기술의 원리 및 응용을 소개한다.또한,고체 박막과 박막 표면의 구조적, 전기적,광학적,화학적 특성을 분석하기 위해 사용되는 다양한 방법 및 원리에 대해서도 설명한다."
  },
  {
    "courseCode": "MA4203",
    "courseDescription": "반도체는 정보사업의 근간이 되는 각종 광소자와 전자소자에 활용되기 때문에 다른 어떤 소재보다도 가장 많이 연구되어온 핵심소재이다. 이 과목은 반도체 기초 물성, 소자제작공정, 소자 (pn 접합, contact, MOSFET)에 대한 기초 개념을 습득하는 것을 목표로 하고 있다."
  },
  {
    "courseCode": "MA4205",
    "courseDescription": "이 과목은 대학교 3, 4학년 학생들을 대상으로 사슬 반응중합 및 단계 반응중합 등의 다양한 중합 방법들과 중합반응에서의 반응속도론과 반응 메카니즘의 차이를 이해하는 것을 목적으로 한다. 동시에 다양한 중합 방법과 그 중합으로부터 합성된 고분자들을 소개하고 이들의 중합 특성을 알아본다."
  },
  {
    "courseCode": "MA4207",
    "courseDescription": "이 과목은 의료용으로 사용되어온 다양한 고분자들 및 그들의 응용예를 소개한다. 합성/천연 고분자, 가수분해/효소분해, 고형/수화 젤/나노시스템 등의 다양한 기준에 따른 고분자 물질을 소개한다."
  },
  {
    "courseCode": "MA4208",
    "courseDescription": "금속이나 반도체 등 물질의 기본 물성은 그 물체 안에 존재하는 전자들의 성질에 따라 결정된다. 이 과목에서는 물질의 특별한 구조 에서 전자들이 어떻게 행동하는지 고찰 할 것이다. 그 결과 나타나는 물질의 전기적, 자기적, 광학적, 및 열적인 성질들이 어떻게 기술되는지 살펴 볼 것이다."
  },
  {
    "courseCode": "MA4209",
    "courseDescription": "나노재료 및 바이오재료는 융합을 통해 전 세계적인 재생 에너지 문제와 보건 부분에서 놀라운 성취를 보인 굉장히 중요한 재료들이 다. 특히, 촉매재료에 의한 재생 에너지 및 연료의 제조 및 약물 전달에 의한 질병 치료는 나노바이오공학에서도 중요한 부분이다. 따라서 이 과목에서는 나노생촉매전환과 나노메디신 부분에 초점을 맞추고 있다. 이를 위해 이 과목에서는 촉매, 생촉매, 나노생촉매, 나노크기의 이미징재료, 그리고 나노 크기의 약물전달 물질에 대해 다룰 예정이다."
  },
  {
    "courseCode": "MA4211",
    "courseDescription": "플라스틱 전자재료를 이용하는 플라스틱 전자공학은 저가형, 경량형의 플렉서블 전자소자를 구현할 수 있는 연구 분야이다. 따라서 고품질의 플라스틱 전자재료 개발은 소자의 성능에 굉장히 중요하다. 본 과목에서는 플라스틱 전자공학에서 연구되고 있는 다양한 전자소자와 이와 연관된 전자재료들을 다룰 예정이다."
  },
  {
    "courseCode": "MA4212",
    "courseDescription": "전산재료과학의 기초에 관한 학부 수준의 강의이다. 주요 강의내용은, 수치 미분/적분, 미분 방정식의 수치해, 선형대수, 분자동역학, 몬테카를로 방법 등이다."
  },
  {
    "courseCode": "MA4213",
    "courseDescription": "물질의 구조, 전자구조, 광학특성, 전기특성을 원자 스케일에서 이해하기 위한 양자역학의 기초 습득 (1) 양자역학의 탄생 배경, 역사, 가설, 기본 개념 습득 (2) 슈뢰딩거 방정식을 이용한 입자의 기본 운동 기술 (3) 양자역학 발전의 직접적 계기가 된 수소 원자 이해 (4) 고체의 전자구조, 광학특성, 전기특성 이해를 위한 선행 과목 (5) 전산 물리 및 전산 재료과학 연구를 위한 선행 과목"
  },
  {
    "courseCode": "MA4214",
    "courseDescription": "본 수업에서는 파동의 간섭부터 원소/구조 분석에 이르는 재료분석 이론과 방법론을 다룬다. 크리스탈 및 비정질 금속과 세라믹 폴리머의 구조 및 이미징의 원리를 배우며, 원자에서 분자단위에 이르기까지 정밀한 재료 분석법을 익힌다."
  },
  {
    "courseCode": "MA4217",
    "courseDescription": "본 과목은 연료전지 (고분자전해질, 고체산화물, 인산염, 용융탄산염 연료전지 등) 및 배터리 (리튬-이온, 리튬공기, 리튬황, 플로 우전지 등), 수소 생산 및 저장 재료/시스템, 전기화학적 캐패시터 등의 에너지 저장 및 전환 시스템 및 그에 필요한 소재에 대하여 심도 있게 이해하는데 그 목표가 있다. 게다가 각 에너지 시스템 및 소재의 작동 원리를 잘 이해하기 위하여 구동원리인 전기화학 기본에 대한 내용도 포함한다. 뿐만 아니라, CV 및 EIS 등 실용적인 전기화학적인 에너지 소재 및 시스템 분석기법도 포함할 것이다."
  },
  {
    "courseCode": "MA4218",
    "courseDescription": "각종 재료와 소자에서 여러가지 물리, 화학, 전기적인 물성에 크게 영향을 미치는 고체 표면에 대한 내용을 소개한다.고체의 표면 구조를 규명하는 방법과표면 및 계면의 물리적 화학적 특성을 측정하고 분석하는 다양한 방법에 대한 원리와 간단한 응용에 대해서 설명한다. 양자역학, 통계열역학 및 열역학적인 지식을 이용하여 2차원 고체표면과 관련된 다양한 구조 및 물리적, 화학적, 전기적인 특성을 설명한다. 표면의 열역학적인 특성, 흡착 및 탈착,등온선, 표면 확산, 촉매,반도체 및 고분자 표면 및 계면, 표면 화학반응의 메커니즘과 속도론에 대해서도 소개한다."
  },
  {
    "courseCode": "MA4219",
    "courseDescription": "The main purpose of this course is to understand basic concepts, mechanisms, and current issues in recent “Flexible and Printable Electronics”(FPEs), which utilizes novel metallic and semiconducting materials pro -cessed from solution. This course will cover the whole aspects for future FPEs, including flexible substrates, flexible and transparent electrodes, flexible encapsulation layer, printable photoactive layers, printable functional layers, and various printing technologies. After covering the basic issues for FPEs, this course will focus on the materials and device issues for ‘flexible and printable organic solar cells’ and ‘hybrid perovskite solar cells’."
  },
  {
    "courseCode": "MA4220",
    "courseDescription": "The main purpose of this course is to collect and organize understanding of the relationships between struc -ture, properties and applications of polymer materials. The important polymer properties such as process -ability, mechanical, thermal, electrical, optical, acoustic, chemical and surface properties will be discussed from various aspects of polymer structures."
  },
  {
    "courseCode": "MA4221",
    "courseDescription": "The lecture introduces basic principles of statistical mechanics. The classical and quantum statistical me -chanics will be discussed and applied to various statistical thermodynamic phenomena of ideal solids, gases, and quantum particles. Phase transitions will also be discussed in terms of statistical mechanics."
  },
  {
    "courseCode": "MA4222",
    "courseDescription": "이 과목은 대학교 3, 4학년 학생들을 대상으로 상품화된 기존의 고분자나 새롭게 합성한 고분자의 분석 방법을 소개하고 분석 결과를 이해하는데 중점을 둔다. 특히 고분자의 화학구조, 분자량, 분자량 분포, 열 특성을 중심으로 고분자를 분석하고 그 결과를 논의한다. 또한 고분자로부터 제조된 필름이나 복합체의 표면 및 단면의 구조를 분석하고 해석한다."
  },
  {
    "courseCode": "MA4223",
    "courseDescription": "이 과목은 재료과학에서 필요한 생화학 원리들을 가르치고자 한다. 주요 내용은 생체물질들, 면역 시스템, 상처치료, 생체적합성 들을 포함한다."
  },
  {
    "courseCode": "MA9101",
    "courseDescription": "2010~2014학번, 학생들의 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별 적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "MA9102",
    "courseDescription": "2015학번 이상 학생들의 학사학위 논문을 준비하기 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성하여야 한다."
  },
  {
    "courseCode": "MA9103",
    "courseDescription": "2015학번 이상 학생들의 최종 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "MC2100",
    "courseDescription": "열역학은 열과 일 및 에너지 상호 변환을 다루는 학문으로, 본 과목에서는 기초적인 열역학의 개념을 배우고, 가스 터빈, 증기 기관, 냉각 기관 등의 대표적인 열기관을 통해 기본 개념의 응용을 배우게 된다."
  },
  {
    "courseCode": "MC2101",
    "courseDescription": "이 과목에서는 스트레스 스트레인, 변형, 탄성, 변형 에너지, 빔의 처짐 등의 기본적 개념과 함께 기본 기계 구조들의 텐션, 압축, 뒤틀림, 굽힘 등을 다룬다. 이 과목은 기계 구조물에 작용하는 힘과 이에 따른 변형에 대한 내용을 다룸으로써 기계적 구조 해석 및 설계에 유용하게 이용될 수 있다."
  },
  {
    "courseCode": "MC2102",
    "courseDescription": "This course introduces fundamentals of fluid mechanics and applications to several flow systems. Course topics in the lecture include the characteristics of fluid, fluid statics, fluid kinematics, mass and momentum conservation, the governing equations of fluid flows, dimensional analysis, and viscous flow. In the experi -ment class, students are expected to learn flow visualization methods in various flow conditions and obtain hands-on experience in measuring flow quantities."
  },
  {
    "courseCode": "MC2103",
    "courseDescription": "이 과목은 자동차, 항공기, 로봇 등과 같은 기계시스템에서 외력이 작용하였을 때 물체의 움직임 (위치/방향, 속도, 가속도)를 해석하기 위한 방법을 학습하는 것을 목표로 한다. 이를 위해, 입자와 강성체에서 뉴톤 동역학 이론, 일과 에너지 이론, 충격량과 운동 량 등을 학습한다."
  },
  {
    "courseCode": "MC2201",
    "courseDescription": "This course aims to study basic mathematics for mechanical engineers. In this course, students will learn ba -sics of ordinary differential equations and linear algebra required for mechanical engineering. Details include first-order, second-order, and higher-order differential equations, series solutions of differential equations, and Laplace transforms. Second part of the course include linear algebra: materices, vectors, determinants, vector differential calculus, and vector integral calculus."
  },
  {
    "courseCode": "MC2202",
    "courseDescription": "This course aims to study basic mathematics for mechanical engineers. In this course, students will learn basics of Fourier analysis and partial differential equations, and complex analysis required for mechanical engineering. Details include Four series, integrals, transforms, and partial differential equations. Second part of the course include complex numbers, complex integrals, power sereis."
  },
  {
    "courseCode": "MC2203",
    "courseDescription": "This course aims to study basic programming skills for mechanical engineers. Specifically, student will learn the basic usage of (1) engineering software - MATLAB, and (2) programming language Python. In MATLAB, students will learn how to treat arrays and functions,  write scripts, and plot the graph. In addtion, students will learn how to solve engineering mathematical problems using Python programming."
  },
  {
    "courseCode": "MC2204",
    "courseDescription": "This course mainly focuses on enhancing the understanding of thermodynamic theories learned from the basic thermodynamics course by showing a variety examples and practicing student with analysis of actual thermal systems. Students should leave the class with better understanding of the meaning of the fundamental thermo -dynamics relations and ability solving the actual thermodynamic problems with systematic approaches."
  },
  {
    "courseCode": "MC2205",
    "courseDescription": "This course aims to extend theoretical knowledge that was studied in MC2101. Specifically, it covers stress and strain transformation, deflections, elastic stability,  energy methods, and material behaviors (failure). In addition, practical analysis and design problem will be treated to consolidate theoretical knowledge and improve practical ability."
  },
  {
    "courseCode": "MC3106",
    "courseDescription": "본 실험과목은 기계공학에서 중요한 주제 중에서 세 가지인 전기전자 기초, 고체 역학, 동역학을 배울 수 있도록 설계되었다. 전기전자 분야에서는 계측기 사용법, 전자회로 실험 및 LabVIEW를 사용한 신호처리 실험을 수행한다. 고체 역학에서는 UTM을 사용한 재료 시험과 스트레인 게이지 실험을, 동역학에서는 회전관성 및 물리진자에 관련된 다양한 실험을 수행하며 이론치와 비교, 분석한다."
  },
  {
    "courseCode": "MC3107",
    "courseDescription": "This course is designed to learn three important subjects in mechanical engineering, i.e. thermodynamics, fluid mechanics and CAD/CAM. In the field of thermodynamics, standard refrigeration experiment and heat transfer experiment using TEG are carried out. Reynolds and Venturi meter experiments in the field of fluid mechanics, and 3D design & printing and CNC milling experiments in the field of CAD/CAM are carried out. The results from experiments will be compared and analyzed with theoretical values."
  },
  {
    "courseCode": "MC3201",
    "courseDescription": "본 교과목은 열전달의 세 가지 모드인 전도, 대류, 복사를 소개한다. 전도에서는 유체 분자의 임의운동, 고체에서는 격자진동이나 전자의 움직임에 의해 열전달이 이루어진다. 반면 대류에서는 유체분자 각각의 임의 움직임이 아닌 집단 움직임에 의해 물질전달 과 함께 열전달이 이루어지는 게 특징이다. 전도나 대류와는 다르게 복사에서는 전자기파가 직접 열에너지를 전달하기 때문에 어떠한 매질도 필요로 하지 않는다. 열전달 지식은 자동차 엔지, 에어컨디셔너, 인공위성과 같은 다양한 기계시스템에 적용되고 있다."
  },
  {
    "courseCode": "MC3202",
    "courseDescription": "This course provides fundamental background of vibration phenomena. It covers from single DOF to multi DOF and theory as well as numerical and experimental methods. It deals various subjects: Lagrange equation, Laplace transformation, Fourier transformation, mode superposition, finite element method, experimental modal analysis. This course also introduces basic concepts of sound, acoustic wave, impedance, sound pressure level (SPL), acoustic wave equation, sound transmission and reflection, mass law, and acoustic devices such as Helmholtz resonator and muffler. Since the limitation of class time, the only general concepts are covered in this class."
  },
  {
    "courseCode": "MC3203",
    "courseDescription": "In order to understand the various physical systems such as hydraulic, mechanical, electrical, magnetic, and thermal systems in terms of energy or power exchange, a bond graph modeling technique is introduced. Conven -tional control theory in the time and frequency domains are covered with the consideration of sensor and actuator, voltage and current amplifier, and various signal processing techniques. Not only the basic knowledge related to control techniques but also control engineering sense based on the experimental works are emphasized."
  },
  {
    "courseCode": "MC3204",
    "courseDescription": "이 과목에서는 과학 및 공학에서 자주 사용되는 수치 해석의 기본 도구 및 방법을 학습한다. C 언어, 컴퓨터 프로그래밍을 위한 Python, 다양한 시뮬레이션을 위한 Matlab 등이 포함된다. 또한 하나의 변수를 가진 방정식 해 구하기, 수치 미분 및 적분, ODE 솔루션, 선형 시스템 해 구하기 및 PDE의 해를 구하는 방법을 공부한다. 연습문제를 통해 이론 및 방법을 이해하고 보다 어려운 문제를 해결하도록 동기를 부여하고자 한다."
  },
  {
    "courseCode": "MC3205",
    "courseDescription": "본 강의는 크게 3가지로 구성된다. 첫번째 파트는 마이크로프로세서(ARM 프로세서)의 기본구조, registers, 메모리, 케시 등의 구조와 입출력 작동, 기본적인 assembly language에 의한 프로세서의 구동 방법을 배운다. 두번째 파트는 ARM 기반의 마이크로프로세서 및 프로세서 사용법을 실습수업을 통하여 학습한다. 마지막으로 수강에 참여한 학생들은 ARM 프로세서 기반으로 이동로봇 등의 임베디드시스템 구현을 통하여 프로젝트를 수행하게 된다. 수행한 프로젝트는 중간고사 전후 및 기말고사 전후에 공개 데모를 수행하여 평가받게 된다."
  },
  {
    "courseCode": "MC3206",
    "courseDescription": "재료 전반에 관한 기초 이론과 함께 재료의 구조, 특성 및 응용에 대한 폭넓은 지식을 습득하는 것을 목적으로 한다. 다양한 재료들의 구조와 특성을 공부하면서, 재료의 결정구조, 고체 결함 및 확산, 상평형도를 이해하는 기초를 제공하고자 한다. 또한, 재료의 전기적, 열적, 자기적, 광학적 특성을 이해하여 신소재를 제조하고 다양한 분야에 응용할 수 있는 능력을 배양하고자 한다."
  },
  {
    "courseCode": "MC3208",
    "courseDescription": "The course provides systematic method of engineering design covering major design procedures from con -ceptual design to product design. Some detailed design techniques such as generation of conceptual ideas, detailed concept development & evaluation, and product generation with realization. Students would expe- rience integration of mechanical engineering knowledges, design methods and product design processes."
  },
  {
    "courseCode": "MC3209",
    "courseDescription": "The course deals with creativity, creative problem(CP) finding and solving, and problem solving(PS) proce -dures combined with C efforts systematically. CPS integrates CP recognition, CP definition and analysis, and synthesis. C methods for C idea generation individually or in a group are introduced."
  },
  {
    "courseCode": "MC3211",
    "courseDescription": "컴퓨터 화면상에서 기계설계가 가능한 소프트웨어를 이루는 기초적인 수학이론과 실재 사용법을 배운다, 전반부에서는 부품형상을 생성하기 위한 기하모델링의 기본적인 수학과 이를 이용한 파트들의 형상 설계에 대해 배우고, 이론적인 지식을 상용 캐드 소프트웨어를 통해 연습한다. 후반부에서는 컴퓨터를 이용하여 곡면과 형상을 자동 가공하는데 필요한 자동툴 경로 생성기술과 실제 기계 구동에 의한 생산방법에 대해 배운다."
  },
  {
    "courseCode": "MC3213",
    "courseDescription": "This course covers basic design knowledge of essential elements in a mechanical design, which includes working principle, selection of commercially available parts, life expectancy and reliability,  Shaft, bear -ings, fluid bearing, gear, belt, screw, ball screw , springs, brake and flywheel are introduced based on the engineering mechanics. Students are trained for design through a flip learning in this course, Each group of students will prepare and conduct the student teaching based on the guidance. Two times of sub-unit design project such as power transmission and positioning stage will be conducted."
  },
  {
    "courseCode": "MC3214",
    "courseDescription": "This course is the 2nd course for Fluid Mechanics. Students will learn fundamentals not covered in the 1st course MC2102, including potential flow and compressible flow. Appplied topics such as open-channel flow and turbomachinery will be covered in this course. It is expected that students will learn fundamentals of fluid mechacincs in details from both the MC2102 and this course."
  },
  {
    "courseCode": "MC3215",
    "courseDescription": "This course deals with the fundamentals of the analysis of signals and how they interact with the systems, focusing on continuous and discrete linear time-invariant (LTI) signals and systems. It features complex fre -quency analysis including Fourier series and transforms, Laplace and Z-transforms, impulse response, sampling theorem, convolution. Mechanical engineering examples will be handled."
  },
  {
    "courseCode": "MC3216",
    "courseDescription": "자동제어는 제어이론 중에 처음으로 듣게 되는 과목으로 주로 연속시간 제어 시스템의 해석과 설계를 다룬다. 특히 수업에서는 라플라스 변환, 시스템의 모델링,초기 및 안정된 반응의 해석, 루트 로커스 해석 및 이를 이용한 제어 시스템 설계, 주파수 반응의 해석 및 이를 이용한 제어 시스템 설계 등을 다룬다. 이 과목을 통해서 학생들은 자동주행 자동차나, 무인항공기 및 로봇 등의 동적 시스템 제어기 설 계에 필요한 간단하면서도 유용한 방법을 배우게 된다."
  },
  {
    "courseCode": "MC4202",
    "courseDescription": "이 과목은 유한 요소법(FEM)의 기본 개념을 소개한다. 강성 방법을 사용하여 트러스, 빔, 선형 변형 삼각 방정식 및 축 대칭 요 소 방정식을 유도하고, 아이웨어 도구를 사용하여 간단한 엔지니어링 문제를 해결함으로써 FEM 이론에 대한 실습을 진행한다."
  },
  {
    "courseCode": "MC4204",
    "courseDescription": "로봇에 필요한 전반적인 이론들과 Actuator, Design, 센서, 동역학, 제어, AI, Navigation 등의 기술이 소개된다. 로봇에 대 한 general view를 제공할 목적으로, 로봇 메커니즘뿐 아니라 관련 assistive technology (가령, 로봇을 위한 센싱과 액츄에이터, AI등을 활용한 로봇 intellingence)에 대해 학습한다. 로봇 개발용 소프트웨어 프레임웍으로 이루어진 ROS(로봇 OS)를 주로 사용하며 6축 로봇 팔을 사용한 다양한 응용(application)을 스스로 제작해보는 내용도 포함한다."
  },
  {
    "courseCode": "MC4205",
    "courseDescription": "기계장치는 재료역학, 동역학, 진동, 제어, 계측센싱 및 열전달까지 여러가지 물리현상의 종합설계로 항상 이루어지며, 이러한 커다란 장치가 엔진실린더, 크랭크샤프트, 카메라렌즈, 반도체등의 정밀부품을 제조하기 위하여 서브미크론 수준의 초정밀 위치제어를 달성하기 위해 기본적인 설계 및 제어량 측정원리를 비롯하여, 위의 기계제조분야에서 장치 설계 시에 자주 등장하는 기술주제에 대해 강론함으로써 학생들로 하여금 실험장치 설계를 비롯하여 실재 기계장치 개발에 필요한 설계 소양을 배양한다."
  },
  {
    "courseCode": "MC4206",
    "courseDescription": "MEMS(Micro Electro Mechanical Systems) is one of the key technologies for man-machine interface in the 21st-century of information society. This course will deal with MEMS material, micro/nano fabrication pro -cess, electromechanical principles and applications as shown below. - Introduction to MEMS and materials properties - Microfabrication technologies and its principles - Micromechanics and scaling effects- Applications of micro sensor & actuator for IoT and mobile devices"
  },
  {
    "courseCode": "MC4208",
    "courseDescription": "기계공학을 포함한 다양한 연구 분야에서 양질의 데이터 확보, 분석, 제어능력 배양은 기계공학전공 학부생들을 포함한 재원들이 고급 연구자로서 자질을 확보하는데 필수적이다. 본 과목에서는 상기 소양을 LabVIEW를 통해 습득하고, 연구 및 산업현장에 적용할 수 있도록 유도하고자 한다."
  },
  {
    "courseCode": "MC4210",
    "courseDescription": "In this course, students will learn fundamentals of computational fluid dynamics. This course covers widely-used numerical methods to simulate fluid flows, including finite difference methods, finite volume methods, iterative methods for linear and non-linear systems, and time-marching schemes for unsteady problems. Students will conduct an individual term project to obtain hands-on experience in applying numerical meth -ods for solving Navier-Stokes equations."
  },
  {
    "courseCode": "MC4212",
    "courseDescription": "This course covers problem formulation and concepts of optimum design , mathmatical program- ing includ -ing linear and nonlinear ; design sensitivity analysis ; trade off analysis ; recent research topics in design optimization."
  },
  {
    "courseCode": "MC4214",
    "courseDescription": "This course is a graduate-level course in collaboration between physics, mathematics, and fluid dynamics.  The principal purpose of hydrodynamic stability is to present fundamental stability theories that have wide ap -plication in almost all engineering sciences; e.g. aeromechanics, thermal & combustion dynamics, and, of course, fluid dynamics.  Until recently the boundary-layer transition from laminar to turbulent flow has been largely beyond the reach of both theory and experiment. By utilizing less intrusive modern measuring tech -niques with more accuracy, and advanced theories supported by numerical analysis for linear and nonlinear dynamics, this field had gone through rapid development in the past few decades. In this class, transition pre -diction based on classical, yet still state-of-art, linear stability theory for subsonic and supersonic flows will be discussed first, followed by the introduction on modern development toward an absolute amplitude approach."
  },
  {
    "courseCode": "MC4215",
    "courseDescription": "In this course, mechatronics system signal analysis and circuit design are covered. It includes concepts on circuit and energy, semiconductor devices, digital logic, time-frequency analysis, robots and electromagnetic sensors."
  },
  {
    "courseCode": "MC4220",
    "courseDescription": "This is a graduate-level course on Gas Turbines and Jet Engines.  The aerodynamic and thermodynamic design of modern engines for civil passenger aircraft and military aircraft will be discussed.  This course plans to cover: Principles of gas turbines and jet engines, elementary compressible aerodynamics, introduction to combustor design, bypass ratio selection, scaling and dimensional analysis, turbine and compressor design and matching, design optimization, aircraft requirements, as well as off-design performance.  Students are assumed to have sound familiarity with basic fluid mechanical and thermodynamical background.  Subjects introduced in this course are highly relevant to ground-based turbine engines used in power (electricity) generation industry.  All students must participate in at least one term project with a written report and in-class presentation."
  },
  {
    "courseCode": "MC4221",
    "courseDescription": "이 과목은 기계공학 전공자에게 인공지능의 기초를 제공하고자 한다. 회귀, 분류, 군집을 포함하며, 특히 kNN, decision tree, perceptron, MLP, ANN, and CNN 등의 인공지능 알고리즘에 대해 알아본다. 기계시스템에서 인공지능과 도메인 지식의 활 용 측면에서 강의가 진행된다."
  },
  {
    "courseCode": "MC4222",
    "courseDescription": "This class covers the basic principles of the fuel cell system such as thermodynamics, electrochemical reac -tion, and heat and mass transfer. This class is designed for the senior undergraduate students or graduate students who desire to learn how to develop the optimal design of the fuel cell system."
  },
  {
    "courseCode": "MC4223",
    "courseDescription": "This course focuses on the finite volume method and its use in the analysis of fluid dynamics, heat and mass transfer problems. A general framework for the discretization of convection-diffusion equation is developed for both structured and unstructured meshes. Issues of accuracy, stability and convergence are addressed. Techniques for the solution of linear algebraic systems are presented for both structured and unstructured discretization.  The computation of fluid flow and issues of pressure-velocity coupling for incompressible flows are addressed next, with an emphasis on sequential techniques. The course involves hands-on code development as well as use of a commercial code for solving a variety of practical engineering problems."
  },
  {
    "courseCode": "MC4224",
    "courseDescription": "Microfluidics is the study of flow phenomena at small length scales with characteristic channel dimensions typi -cally less than the diameter of a human hair. Small length scale effects become important as surface forces such as viscous drag and surface tension govern flow behavior rather than body forces (inertia) as seen in macroscale fluid mechanics. Miniaturization of fluid handling systems also allows the development of micro Total Analysis Systems (μTAS) or so called \"lab on a chip\" which combines biological sample preparation, separation and analysis in a single device. Topics explored in this class include: fundamental understanding and derivation of constitutive balances in fluid mechanics, exploration of electrokinetic flow phenomena for electrophoresis, overview of (μTAS) systems including capillary electrophoresis, dielectrophoresis, magnetophoresis."
  },
  {
    "courseCode": "MC4225",
    "courseDescription": "This course provides the science of flight dynamics – the response of flight vehicles to perturbations arisen from sources in the atmosphere, and control inputs. The course introduces students to the performance, stability, and control of airborne fixed-wing vehicles.  Attention is given to the use of stability derivatives when describing aerodynamic forces and moments in the governing relations.  Topics include equations of motion, analysis of linear systems, and stability of longitudinal/lateral/directional motions.  Aimed directly at senior undergraduate engineering students as well as those beginning graduate work.  MATLAB will be used."
  },
  {
    "courseCode": "MC4228",
    "courseDescription": "Integrative leadership based on convergence thinking is an essential competency for engineers in a rapidly changing future society. This course cultivates system integration and problem-solving skills based on me -chanical engineering knowledge. In particular, students will learn the multidisciplinary system design process that aims at market and consumer values, and develop design experience and insight into the future through success stories of technology convergence in various application fields. The theoretical background and ap -plied case studies are discussed, and topics that reflect changes and new trends are also covered."
  },
  {
    "courseCode": "MC4229",
    "courseDescription": "This course is designed to learn engineering design and implementation of mobile robots. Students will be able to learn how to make mobile robots such as unmanned ground or unmanned air vehicles to operate autonomously. This course requires intensive hands-on implementation, coding and outdoor experiments."
  },
  {
    "courseCode": "MC4230",
    "courseDescription": "자연은 인간이 만들어낸 기술적 해결책보다 현저히 적은 양의 에너지를 소비하면, 적은 물질로 다양한 구조를 창출해내는 고효율 최적화 시스템이다. 자연의 생물체 및 생체물질의 기본구조, 원리 및 메카니즘을 모방 및 응용하여 공학적으로 활용하는 자연모사기술을 소개하고, 연구동향과 상용화 사례에 대해서도 살펴본다. 자연에 대한 호기심과 관찰력, 그리고 창의적인 아이디어와 연구개발을 통해 다학제적인 융합기술 분야의 발전에 기여할 수 있는 소양을 키워 나갈 수 있을 것이다."
  },
  {
    "courseCode": "MC4231",
    "courseDescription": "유체역학에 대한 대학원 수준의 과정이다. 본 코스에서는 두 가지 주제를 다룬다. 유체역학적 안정성과 압축 가능한 흐름. 유체역학적 안정성의 주된 목적은 공학, 물리학, 응용 수학에 널리 적용되는 안정성의 기본이론을 제시하는 것이다. 경계층 흐름에서 층간에서 난류로의 전환에 특별한 초점을 둘 것이다. 압축 가능한 흐름 영역은 유체 밀도가 크게 변화하는 유체 현상을 포괄한다. 압축 가능한 흐름은 고속 항공기, 제트 엔진, 가스 파이프라인 및 많은 다른 분야와 관련이 있다. 압축 가능한 유체 역학의 기초와 외부 및 내부 흐름에 대한 적용이 설명될 것이다. 에어로 어쿠스틱의 개념이 포함될 것이다."
  },
  {
    "courseCode": "MC4232",
    "courseDescription": "This class covers the modeling & simulation technology using Matlab and Simulink for power generation sys -tem based on thermodynamics, heat and mass transfer, and fluid mechanics. This class is designed for the senior undergraduate students or graduate students who desire to learn how to develop the optimal design of the power & energy system."
  },
  {
    "courseCode": "MC4233",
    "courseDescription": "이 과정은 엔지니어링 시스템 최적화의 현대적 동향과 최근의 발전에 초점을 맞추고 있다. 학생들이 학습할 수 있도록 노출하고 최첨단 최적화 기법을 실제 공학 문제에 체계적으로 적용하기 위한 입문 수준의 과정이다. MATLAB을 사용한 실습 세션은 실내 하우스 코드와 MATLAB Toolbox를 사용하는 학생들을 위해 마련될 것이다."
  },
  {
    "courseCode": "MC4234",
    "courseDescription": "학부 고학년 학생과 대학원생을 위한 열전달 과목으로, 학부 열전달 내용을 심화하여 학습한다. 3가지 열전달모드인 전도, 복사, 대류를 균등한 비율로 커버한다. 수강 학생이 다음을 학습하는 것을 목표로 한다.- 열 및 물질전달의 기본 원리 이해- 복잡한 열전달 문제의 단순화 및 해석 능력 배양- 멀티 모드 열 및 물질전달의 이해 및 적용"
  },
  {
    "courseCode": "MC9101",
    "courseDescription": "2010~2014학번, 학생들의 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별 적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "MC9102",
    "courseDescription": "2015학번 이상 학생들의 학사학위 논문을 준비하기 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성하여야 한다."
  },
  {
    "courseCode": "MC9103",
    "courseDescription": "2015학번 이상 학생들의 최종 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "EV2208",
    "courseDescription": "본 과목은 화학과 과학의 여러 분야에서 사용되는 정성 분석과 정량 분석의 기본 원리에 대한 이해를 제공한다. 전반기에서는 과학적 측정을 통해 얻어지는 자료들을 해석하는 방법과 통계의 기본을 다룬다. 이후, 다양한 정성 분석 방법들의 배경 이론을 학습하고, 분석 화학이 화학 이외의 생명 과학이나 환경 과학에서 응용되는 사례들을 공부한다."
  },
  {
    "courseCode": "EV2209",
    "courseDescription": "이 과정은 환경 품질 모니터링에 사용되는 방법과 활동을 설명하는 것을 목표로 한다. 관련 규정과 정책에서, 학생들은 환경오염의 기본 원리를 배우게 되는데 예를 들어 물, 공기, 토양 및 폐수 환경에서 오염물질의 특정 사례를 체계적으로 모니터링 하는데 사용되는 다양한 계측과 기법을 배우게 될 것이다. 또한, 이 과정에는 현장 조사와 실습 과정이 포함되어 있어 학생들이 기본 개념과 방법론적 원칙에 대한 이해를 적용할 수 있는 기술을 제공한다. 또한 환경 데이터의 기록, 처리 및 보고, 건강 및 안전에 대한 모든 관련 고려사항에 대해 전반적인 교육이 제공될 것이다."
  },
  {
    "courseCode": "EV2210",
    "courseDescription": "본 과목에서는 유체역학의 기본개념과 대표적인 유동 시스템에 응용하는 방법을 다룬다. 주요 내용으로는 유체의 특성, 유동에 따른 기본적인 역학, 유동 지배방정식, 차원해석과 상사성, 점성 유체가 있다."
  },
  {
    "courseCode": "EV2211",
    "courseDescription": "이 과목은 기후. 기후변화의 전반에 관한 소개와 이해를 목표로 1) 전지구 에너지 균형, 2) 대기/해양의 순환, 3) 과거, 현재, 미래 기후에 관한 내용을 다룬다. 온라인 강의를 수강한 후 매주 오프라인 수업에서 요약 및 토론 등 의 순서로 진행될 예정이다."
  },
  {
    "courseCode": "EV2212",
    "courseDescription": "본 과목에서는 유전학의 기본 개념들에 대해 배우고, 분자, 세포, 다세포 등 다양한 수준에서 일어나는 복잡한 생명현상을 이해하기 위한 유전학의 적용에 대해 공부한다. 주요 학습 내용으로는 유전자의 구조와 기능, 염색체 및 유전체, 멘델의 유전법칙, 유전자 맵핑, 분자 유전학, 유전적 변이체, 군집유전학, 유전학 기법을 활용한 단백질 기능분석, 유전자 발현 분석, 및 유전성 질환에 대한 이해 등이 있다"
  },
  {
    "courseCode": "EV3101",
    "courseDescription": "물, 대기, 에너지를 다루는 환경공학 전반의 기본 개념에 대한 교과목으로 화학, 생물, 물리를 기반으로 환경적 문제들을 개선하고 해결하기 위하여 필요한 기초 이론을 다룬다. 질량/에너지 밸런스, 화학반응공학, 식수 및 폐수 처리공학, 대기공학, 현장정화, 에너지, 환경규제, 환경정책 및 윤리 등의 내용을 포함한다."
  },
  {
    "courseCode": "EV3106",
    "courseDescription": "환경분석실험Ⅰ 에서는 수업 및 과제에서 수행하는 상수 처리와 같은 기본적인 수처리 및 미세먼지와 같은 대기 오염 등의 환경문제에 대한 실험을 통해 환경공학의 기본 개념 및 공학자료 수집 및 분석에 대한 능력을 기르고자 한다."
  },
  {
    "courseCode": "EV3111",
    "courseDescription": "본 과목은 물리적 화학적 생물적 기작들이 상호작용을 하는 지구의 특성을 반영하여 여러 기초분야를 포함하도록 구성하였다. 특히 지구의 대기권과 수권의 연결성을 강조하기 위해서 대기열역학, 대기화학, 해양물리, 해양화학, 해양생명을 다룬 이후에 대기-해양 상호작용을 배우도록 구성하였다."
  },
  {
    "courseCode": "EV3205",
    "courseDescription": "환경 생태학은 환경 생태계의 구조와 기능, 특성 이해를 통해 환경문제의 특성과 해결방안을 학습하는 학문으로써 생태계의 기본 원리와 환경문제의 연계성 파악, 에너지-물질 등의 흐름과 지구환경과의 상호작용 이해, 생태복원 기법 등 자연환경 문제 해결역량을 키우는 것이 본 수업의 목표이다."
  },
  {
    "courseCode": "EV3214",
    "courseDescription": "이 과목의 전반부는 아미노산/단백질, 탄수화물/올리고당, 뉴클레오타이드/핵산 등 생체분자의 단량체와 생체고분자의 구조와 화학에 대해 다룬다. 이 생체분자의 생합성 경로 및 메카니즘을 이해하고, 효소와 보조인자가 관여하는 생체 내 반응에 대해 공부한다. 관련된 주제로 생 체모사 화학, 거대분자 화학, 의약화학에 대해 강의 후반부에 간략하게 소개한다."
  },
  {
    "courseCode": "EV3216",
    "courseDescription": "생화학은 생물체 내에서 일어나는 모든 화학적 현상에 대하여 배우는 과목이다. 생화학 과목은 I, II로 나누어 강의될 예정이며 [Bio -chem- istry (5e) by Garrett & Grisham] 을 주교재로 한다. 생화학II 에서는 생화학 I에서 배운 기초 지식을 바탕으로 보다 심화된 생명 현상의 화학적 원리를 소개한다. 본 과목은 세포 내에서 일어나는 생체 에너지 대사를 중심으로, 생체 에너지의 생성과 저장, 생합성, 분해 과정의 조절 등에 다룬다. 소주제는 1) 생체대사의 개념 이해, 2) 당의 생합성 및 저장, 3) 지질과 스테로이드의 생합성 및 생분해, 4) 아미노산 및 핵산의 생합성 등으로 구성된다. 또한 protein folding, gene expression/replication, 신호전달 등을 추가로 공부하여 관련 지식을 구체화한다. 본 과목은 보다 심화된 생물학 수업들 - 예를 들어, 분자생물학, 세포생물학, 약학, 의약화학, 화학생물학, 유전학 과목의 이 해에 필요한 기초를 제공할 것이다."
  },
  {
    "courseCode": "EV3217",
    "courseDescription": "미생물은 일반적으로 단세포로 이루어진 생명체를 의미하지만, 넓은 의미로는 진핵생물의 원생생물과 균류, 원핵생물, 그리고 바이러스를 포함한다. 실제, 미생물은 현미경으로 봐야지만 보일 수 있는 작은 생물이지만, 생물 환경에서 매우 중요한 역할을 수행하고 있다. 미생물 학 강좌에서는 우선, 미생물을 정의할 수 있는 특징에 대한 이해와 미생물의 특성에 따른 분류체계의 원리를 이해하는 데 그 초점이 있다. 일반적인 미생물의 특성에 대한 학습 이후에는, 미생물이 실제 환경과 단위 생물체에 끼치는 직접적 또는 간접적인 영향을 이해하는 것이 미생물학 강좌의 궁극적인 목표이다."
  },
  {
    "courseCode": "EV3219",
    "courseDescription": "수리 물리 기초와 중급에 해당하는 주제를 다양하게 다룬다. 산술 계산보다, 기본원리의 이해에 중점을 둔다. 좌표변환의 원리- 좌표변환에 따른 scalar field 와 vector field의 이해- 일반 좌표계에서 divergence, curl, gradient, Laplacian 등 - Sturm-Liouville system과 self-adjoint operator의 비교- Fourier, Laplace, Legendre 변환 등. 그들의 의미와 정리들 산술 계산보다 기본원리의 이해에 중점을 둔다."
  },
  {
    "courseCode": "EV3220",
    "courseDescription": "에너지화학은 에너지 효율을 포함한 에너지 저장과 변환 공정에 관련된 화학을 강의한다. 강의 내용은 에너지 신기술의 개요와 화학에너지와 전기에너지의 변환에 관련된 물리적, 전기화학적 원리, 열역학, 재료를 다루게 된다."
  },
  {
    "courseCode": "EV3221",
    "courseDescription": "지구환경 열역학에서는 자연계와 인공계에서 일어나는 거시적 성질을 논하기 위한 열역학의 기본 개념에서부터 에너지와 에너지 전달 및 분석, 반응속도론에 대해 공부하며, 이러한 지식을 바탕으로 다양한 환경인자의 상호반응 및 환경제어를 위한 반응 메커니즘을 이해하고자 한다."
  },
  {
    "courseCode": "EV4106",
    "courseDescription": "본 교과목은 전 지구적으로 일어나는 열, 물질, 운동량의 흐름에 대하여 이동현상의 기본 개념을 이용하여 배운다. 이동현상의 기초적이고 전반적인 내용을 학습하여 여러 환경시스템에 적용 가능한 능력을 배양 할 수 있도록 한다."
  },
  {
    "courseCode": "EV4107",
    "courseDescription": "환경분석실험Ⅱ 에서는 수업 및 과제에서 수행하는 하수 처리와 같은 기본적인 수처리 및 미생물을 활용한 환경 처리 공정에 대해 실험을 통해 환경공학의 기본 개념 및 공학자료 수집 및 분석에 대한 능력을 기르고자 한다."
  },
  {
    "courseCode": "EV4201",
    "courseDescription": "본 과목은 환경시스템을 최신 계산적 접근을 이용한 환경시스템을 모델링에 필요한 기본 수학 지식과, 환경 시스템 분석 및 최적화를 목표로 한다. 우선, 환경시스템 모델링의 기본 개념, 환경시스템을 이해하고 과학적으로 표현하기 위한 수학, 그리고 환경 시스템을 최적화하기 위 한 기본 최적화 기법에 대해 다룬다. 이를 통해 환경시스템에 대한 과학적 분석 방법과 모델의 구성 및 최적화에 대한 기초 지식을 배운다."
  },
  {
    "courseCode": "EV4202",
    "courseDescription": "본 과목은 생물학적, 물리학적, 화학적 현상으로 이루어진 지구의 동적 시스템에 대해 다룬다. 생지화학은 주로 생물권과 지권간의 에너지와 원소들의 순환에 대해 다루는데, 물, 탄소, 황, 질소의 순환이 그 대표적인 예다. 본 과목을 통해 학생들은 지구를 구성하고 있는 생물권과 지권의 생물학적, 물리학적, 화학적 역할 및 그에 대한 이해를 할 수 있다."
  },
  {
    "courseCode": "EV4203",
    "courseDescription": "해양물리학은 해양의 물리학적 특성 및 해류에 관한 기초이론, 해양 파랑 및 조석에 관한 기초이론 그리고 대기운동에 의한 해수 순환 등 해 양 환경에 대한 물리적인 요소들에 대한 이해를 위한 학문이다."
  },
  {
    "courseCode": "EV4204",
    "courseDescription": "환경공정 단위조작에서는 수처리 및 대기 중 유해물질 처리와 같은 환경 공정에서 각 단위 공정에 대한 원리 및 특성을 이해하고자 한다. 화학적, 생물학적 처리에 관한 기본적인 배경을 바탕으로, 물질전달 및 이동현상을 통해 각 공정 처리 및 운영 등과 관한 공학적 소양을 함양 하는 것을 목적으로 한다."
  },
  {
    "courseCode": "EV4205",
    "courseDescription": "환경공정 실험은 환경공정에 관한 기초 실험을 수행하고자 한다. 수처리 공정 및 여러 환경 공정에 대한 실험실 규모의 실험을 통해 환경 공학의 실무를 익히고, 이를 현장에 적용 및 연구할 수 있는 소양을 함양하고자 한다."
  },
  {
    "courseCode": "EV4209",
    "courseDescription": "이 수업에서는 산화와 환원이라는 전기화학의 기본원리를 이용하여 산업화된 분야를 설명하고자 한다. 구체적으로 에너지 및 반도체 공정에 사용되고 있는 전기도금, 오랜 역사가 있는 부식 및 방식, 전극을 이용한 폐수처리(촉매반응, 흡탈착 공정)와 살균공정, 미래의 에너지원인 화학전지(연료전지, 수전해) 그리고 우리의 실생활에서 사용되고 있는 배터리 등을 소개할 예정이다."
  },
  {
    "courseCode": "EV4211",
    "courseDescription": "국민보건 영향과 사회경제적 피해를 야기하는 대기오염 유발 물질에 대한 기초적 지식과 오염물질 발생, 측정 및 분석기술, 제거기술에 대해 논의하고자 한다."
  },
  {
    "courseCode": "EV4212",
    "courseDescription": "본 과목은 물에서의 무기 물질들의 기본 거동에 대해 다룬다. 주로 화학 평형에 대해 다루는데, 산-염기, 착화합물 형성, 석출-용해, 산화- 환원 반응이 그 대표적인 예다. 그리고 기본적인 반응속도론 역시 다룬다. 이 과목을 통해 주어진 수환경에서 평형상태의 물질 구성을 알아보는 능력을 가질 수 있고, 복잡한 시스템에서의 물질들의 거동에 대한 직관적인 능력 또한 함양할 수 있다."
  },
  {
    "courseCode": "EV4213",
    "courseDescription": "인간과 생태계에 위해요인인 오염물질이 환경 내에서의 거동과 화학변화에 따른 독성변화를 다룬다. 주요내용은 독성기작, 화학거동, 생태독성학, 독성오염물질 분류, 독성시험법, 그리고 위해성평가 등이다."
  },
  {
    "courseCode": "EV4214",
    "courseDescription": "본 과목은 지구 대기에서 일어나는 화학반응에 대해 집중적으로 다룬다. 주로 지구 대기권과 생물권간의 상호작용이 다뤄질 것이다. 본 과목 을 통해 자연 상태와 요염된 상태의 대기에 대한 이해와, 오존층 파괴, 산성비, 스모그, 기후변화 등 주목받고 있는 환경 이슈들에 대한 이해가 동반 될 것이다. 본 과목을 통해 여러 환경문제들의 원인과 그 메커니즘에 대해 이해할 수 있는 소양을 함양할 수 있다."
  },
  {
    "courseCode": "EV4215",
    "courseDescription": "본 과목에서는 지구환경을 통해 관측할 수 있는 현상에 대해, 여러 환경 데이터들을 처리하고 통계적으로 분석하는 방법을 배운다. 주로 데이터 간 상관관계를 분석하여 환경인자간의 영향을 통계적으로 접근하여 평가할 수 있다. 본 과목을 통해 환경 데이터 관리 및 처리 등 기본적인 소양을 함양하고, 다양한 환경인자가 공존하는 복잡한 환경시스템을 통계적으로 효과적으로 분석하는 법을 배운다."
  },
  {
    "courseCode": "EV4216",
    "courseDescription": "본 과목에서는 환경매체(물, 토양, 대기) 내에서 일어나고 있는 주요 화학반응 및 프로세스에 대한 기본적인 이해와 (유무기) 원소 및 화학 오염물의 거동 및 변환을 열역학적 및 화학반응 속도록적 방법을 통해 정량적으로 기술할 수 있는 능력을 배양한다."
  },
  {
    "courseCode": "EV4217",
    "courseDescription": "대기화학과 기후변화 II에서는 기존의 대기화학과 기후변화에서 다루었던 내용을 토대로 이를 보다 심화 학습하고, 대기화학과 관련된 기상 및 기후변화, global change까지를 포괄하는 내용을 강의하고자 한다."
  },
  {
    "courseCode": "EV4221",
    "courseDescription": "본 과목에서는 국민보건 영향과 사회경제적 피해를 야기하는 대기오염 유발 물질에 대한 기초적 지식과 오염물질 발생, 측정 및 분석기술, 제거기술에 대해 논의하고자 한다."
  },
  {
    "courseCode": "EV4222",
    "courseDescription": "본 과목은 대기질 연구에 있어 첨단 장비에 근거한 연구 최신 동향을 파악함으로서 세계적 수준의 지식을 함양함은 물론, 이러한 연구 과정을 이해함으로서 협업과 건설적인 비판의 중요성을 인지하기 위해 개설되었다. 이를 통해 목적에 맞는 대기질 연구를 설계할 수 있고, 실질적인 연구의 예를 통해 간단한 자료 분석 능력을 함양하고자 한다."
  },
  {
    "courseCode": "EV4223",
    "courseDescription": "이 과목은 학생들에게 현대 분석 기기장치의 작동 원리에 대한 기본적인 이해를 제공한다. 이 과목에서는 분광 광도법, 원자 분광법, 질량 분 석학, 그리고 기체 크로마토그래피, 액체 크로마토그래피, 모세관 전기 영동 등의 분리 분석법에 대해 학습하며, 기기 분석에 관한 연구 논문을 발표하는 기회를 갖는다."
  },
  {
    "courseCode": "EV4224",
    "courseDescription": "방대한 대기질 관련 정보의 홍수 속에 객관적으로 자료 이해하여 올바른 가치판단을 내릴 수 있는 전문가 양성을 위한 수업으로, 현 인류가 당면하고 있는 대기질 현안 소개는 물론, 전 세계적으로 활용할 수 있는 공개 자료(예: NASA, NOAA, 에어 코리아 등)를 분석하고 이해 함을 주 내용으로 한다. 이를 통해 변화하고 있는 대기 환경 및 대기질 저하 현상에 보다 능동적으로 대처할 수 있는 능력 함양을 본 수업의 목표로 한다."
  },
  {
    "courseCode": "EV4226",
    "courseDescription": "이 과정은 먼저 수문학적 사이클에 이어 식수와 관련된 단위 처리 프로세스를 설명한다. 식수처리 시스템 내에서 공정이 어떻게 서로 작동하는지를 상세하게 설명하고, 수처리 과정의 기본 개념을 조사한다. 이 과정은 수질 분석의 원칙, 이론, 관행과 그 처리 과정에 중점을 두고 있다."
  },
  {
    "courseCode": "EV4227",
    "courseDescription": "화학반응공학은 반응속도론, 화학양론 및 화학평형 등 반응공학의 기본적인 내용을 다룬다. 이를 통해 화학반응 시스템을 해석하는 역량을 키우는 것을 목표로 한다. 또한 이를 통해 반응속도론, 이동현상, 에너지 수지 등의 공학 개념을 종합하여 화학 반응기를 설계하고 평가하는데 활용하고자 한다."
  },
  {
    "courseCode": "EV9101",
    "courseDescription": "2010~2014학번, 학생들의 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별 적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "EV9102",
    "courseDescription": "2015학번 이상 학생들의 학사학위 논문을 준비하기 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성하여야 한다."
  },
  {
    "courseCode": "EV9103",
    "courseDescription": "2015학번 이상 학생들의 최종 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "BS2101",
    "courseDescription": "본 과목에서는 생명체의 구성 물질이자 우리 생활과 밀접한 관계를 갖고 있는 유기분자를 이해하기 위한 화학의 기본 개념을 소개한다. 이 과목의 중요한 목적은 유기분자의 구조와 반응성의 관계를 배우는 것으로 서, 화학결합, 명명법, 이성질체, 입체화학, 작용기, 분광법, 그리고 합성과 반응 메커니즘을 다룬다. 본 과목을 수강한 후 학생들은 다양한 과목에서 접하게 될 분자와 물질들에 대한 구조, 성질, 반응성 등을 이해하는데 기본적인 개념을 습득하게 된다."
  },
  {
    "courseCode": "BS2102",
    "courseDescription": "유전자란 무엇이고 어떻게 기능을 수행하며 이러한 유전자에 대한 연구는 어떻게 진행되어 왔는가? 유전자는 DNA로 구성되어있고 '센트럴도그마'에 따르면 유전정보는 DNA에서 RNA로, 이후 단백질로 전해진다고 알려져 있다. 본 분자생물학 교과목에서는 유전자의 정의, 유전자 연구사례, 원핵 및 진핵세포에서의 유전자발현에 대해 학습하고자 한다. 본 교과목의 목표는 DNA, RNA, 단백 질 수준에서의 분자생물학에 대한 이해이다. 더불어 생화학, 유전학적 수준에서의 유전자 구조, 기능에 대한 학습을 통해 유전자 전 반에 대한 심층이해를 도모하고자 한다."
  },
  {
    "courseCode": "BS2103",
    "courseDescription": "이 과목은 학생들에게 다양한 분자생물학적, 생화학적 실험실습을 소개하여 생체 내 상호 연관적인 핵심기작들을 이해하는데 도움이 되도록 설계 되어있다. 기본주제들은 유전자 전사 및 번역 조절, 단백질 합성 및 조절, 세포막내외의 이동, 세포골격형성 및 조절, 세포분열과 세포내 신호전달 등이다. 이러한 내용들은 다양한 분자생물학, 생화학적 테크닉, 그리고 현미경을 이용한 이미징 테크닉 을 통해 학생들이 직접 실험을 통해 접하게 된다."
  },
  {
    "courseCode": "BS2104",
    "courseDescription": "생화학은 생물체 내에서 일어나는 모든 화학적 현상에 대하여 배우는 과목이다. 생화학 과목은 I, II로 나누어 강의될 예정이며 [Bio- chemistry (5e) by Garrett & Grisham] 을 주교재로 한다. 생화학I 에서는 생명체를 이루는 생체 물질의 화학적 구조와 기능 및 물리적 특성을 소개한다. 본 과정은 수용액의 성질, 열역학적 원리와 같은 본질적인 주제를 간단히 다루고, 주요 생체구성물질인 아미노산, 단백질, 핵산, 탄수화물, 지질 등의 생화학적 기능 및 구조와 세포 내에서의 역할에 대해 중점적으로 논의한다. 또한 논문 검색 방법, DNA 및 단백질의 서열 비교 방법, 단백질 구조 분석 방법 등 생화학 연구에 필수적인 기초 생물정보학의 이용에 대해 강의 한다. 본 과목의 목표는 학생들이 생화학에 대한 기초 지식과 이를 규명한 다양한 실험기법에 대해 이해하기 쉽도록 소개하는 것이다."
  },
  {
    "courseCode": "BS2201",
    "courseDescription": "생명현상에 대한 보다 깊은 이해를 위해서 분자 및 세포 시스템에 대한 정량적인 이해와 실험데이터의 정량적 분석 기법이 필요하다. 이 교과목에서는 생명현상에 대한 정량적 분석으로 생명시스템의 통합적 이해를 제공해준다."
  },
  {
    "courseCode": "BS2202",
    "courseDescription": "본 과목에서는 유전학의 기본 개념들에 대해 배우고, 분자, 세포, 다세포 등 다양한 수준에서 일어나는 복잡한 생명현상을 이해하기 위한 유전학의 적용에 대해 공부한다. 주요 학습 내용으로는 유전자의 구조와 기능, 염색체 및 유전체, 멘델의 유전법칙, 유전자 맵핑, 분자 유전학, 유전적 변이체, 군집유전학, 유전학 기법을 활용한 단백질 기능분석, 유전자 발현 분석, 및 유전성 질환에 대한 이해 등이 있다."
  },
  {
    "courseCode": "BS2203",
    "courseDescription": "발생생물학은 동물발생에 대한 개체, 세포, 유전 및 분자적 관점을 통합하여, 주로 세포분화, 형태형성 및 성장에 관한 원리와 분자 기전에 대해 중점적으로 강의한다. 강의주제로는 난자생성, 정자생성, 수정, 배아분할, 낭배형성, 척추 및 무척추 동물의 초기발생, 패터닝, 기관형성, 줄기세포 등을 다룬다."
  },
  {
    "courseCode": "BS2204",
    "courseDescription": "이 과목의 목적은 생명과학을 공부하고자 하는 학생들에게 해부학과 조직학에 대한 기초 지식을 제공하고자 하는 것입니다. 학생들은 수업 참여(20%), 중간고사(40%) 및 기말고사 (40%)를 기준으로 평가됩니다. 자세한 강의 계획서는 강의 첫날에 제공됩니다."
  },
  {
    "courseCode": "BS2205",
    "courseDescription": "본 과목은 생명과학적 이해에 필요한 기본적인 바이오인포매틱스 원리들과 도구들을 배워, 습득한 이론과 실습을 통해서, 각자의 생명과학적 질문을 바이오인포매틱스 기법을 통해 해결하는 방법을 습득한다. 본 과목은 수업 참여 (20%),  중간고사(40%)및 기말 프로젝트 발표(40%)를 기준으로 평가된다."
  },
  {
    "courseCode": "BS3101",
    "courseDescription": "생화학은 생물체 내에서 일어나는 모든 화학적 현상에 대하여 배우는 과목이다. 생화학 과목은 I, II로 나누어 강의될 예정이며 [Bio- chemistry (5e) by Garrett & Grisham] 을 주교재로 한다. 생화학II 에서는 생화학 I에서 배운 기초 지식을 바탕으로 보다 심화 된 생명 현상의 화학적 원리를 소개한다. 본 과목은 세포 내에서 일어나는 생체 에너지 대사를 중심으로, 생체 에너지의 생성과 저장, 생합성, 분해 과정의 조절 등에 다룬다. 소주제는 1) 생체대사의 개념 이해, 2) 당의 생합성 및 저장, 3) 지질과 스테로이드의 생합성 및 생분해, 4) 아미노산 및 핵산의 생합성 등으로 구성된다. 또한 protein folding, gene expression/replication, 신호전달 등을 추가로 공부하여 관련 지식을 구체화한다. 본 과목은 보다 심화된 생물학 수업들 - 예를 들어, 분자생물학, 세포생물학, 약학, 의약화학, 화학생물학, 유전학 과목의 이해에 필요한 기초를 제공할 것이다."
  },
  {
    "courseCode": "BS3105",
    "courseDescription": "생명의 기본단위는 세포이다. 따라서 세포생물학은 모든 현대 생물학 및 의학 관련 학문의 근간이 된다. 전반부는 진핵세포를 이루 는 다양한 요소의 세부 구조 및 기능에 대해 학습한다. 여기에는 세포소기관 생성 및 유전, 세포내섭취, 세포외방출, 막수송, 단백질 이동, 세포 형태 및 극성 형성, 세포-세포간 상호작용 등의 소주제들이 있다. 후반부는 세포성장, 분화, 사멸 등에 초점을 두어 세포성장(체세포분열, 감수분열 포함)과 세포사멸 조절에 필수적인 세포 내 신호전달과 기능에 대해 학습한다. 세포성장과 사멸의 균형은 온전한 개체 발생을 위해 면밀히 조절되어야 하고, 이러한 조절의 변이는 비정상 발생 및 암을 유발할 수 있다는 점에서 본 과 목의 중요성이 있다. 본 과목의 목표는 학생들이 살아있는 세포의 구조와 기능에 대한 기초지식과 이를 규명한 다양한 실험기법을 습득하고, 주요 연구 및 실험 사례들을 통해 생명현상에 필요한 신호전달과 조절작용의 섬세한 균형에 대한 이해를 확보하는 것이다."
  },
  {
    "courseCode": "BS3112",
    "courseDescription": "본 과목은 학생들로 하여금 다양한 세포생물학 실험기법을 경험하게 하고 그 응용법을 배우는 하는 것을 목적으로 한다. 본 과목은 세포분획 및 세포골격의 단백질 성분의 확인, 현미경을 이용한 세포소기관 및 세포골격의 관찰, 그리고 사람세포를 배양하는데 필요한 기본적인 실험기법 등을 다룰 예정이다. 또한 본 과목은 학생들로 하여금 일반적인 과학논문에 준하는 형식의 실험보고서를 작성하게 할 것이다. 이러한 과정을 통하여, 본 과목을 수강한 학생들은 첫째, 세포생물학자들이 사용하는 실험기법의 기본 원리와 개념을 이 해하고, 둘째, 세포생물학분야의 논문을 이해하고, 데이터를 해석할 수 있으며, 셋째, 상세하고 정확한 실험보고서를 작성하여 실험 결과를 과학논문의 형식으로 제시할 수 있는 능력을 획득하게 될 것이다."
  },
  {
    "courseCode": "BS3201",
    "courseDescription": "미생물은 일반적으로 단세포로 이루어진 생명체를 의미하지만, 넓은 의미로는 진핵생물의 원생생물과 균류, 원핵생물, 그리고 바이러스를 포함한다. 실제, 미생물은 현미경으로 봐야지만 보일 수 있는 작은 생물이지만, 생물 환경에서 매우 중요한 역할을 수행하고 있다. 미생물학 강좌에서는 우선, 미생물을 정의할 수 있는 특징에 대한 이해와 미생물의 특성에 따른 분류체계의 원리를 이해하는 데 그 초점이 있다. 일반적인 미생물의 특성에 대한 학습 이후에는, 미생물이 실제 환경과 단위 생물체에 끼치는 직접적 또는 간접적 인 영향을 이해하는 것이 미생물학 강좌의 궁극적인 목표이다."
  },
  {
    "courseCode": "BS3204",
    "courseDescription": "본 과목에서는 세포와 분자 수준에서 일어나는 현상을 근본적으로 이해하기 위해 생물물리학적 원리를 화학적 관점으로 소개한다. 본 과목은 생물, 물리 화학의 주제를 이론적으로 접근함으로서 작동원리를 이해하려 한다. 이를 위해 열역학법칙, 분자간의 작용하는 힘, 효소 동력학, 분자간 상호작용 및 생체분자의 구조-기능관계를 배우게 된다. 본 과목을 통해 생명현상의 기능의 작동원리를 이론적 배경을 바탕으로 분자수준에서 이해할 수 있는 능력을 키워준다. 수학, 일반생물학, 일반화학, 생화학 또는 그에 준하는 과목을 선수과목으로 추천한다."
  },
  {
    "courseCode": "BS3205",
    "courseDescription": "생태학은 현재의 자연 생태계를 형성시킨 환경 인자들을 연구하고, 이를 통해 미래 변화된 환경이 자연 생태계에 미칠 영향을 예측한다. 본 강의에서는 생태계 형성에 작용하는 다양한 인자들, 즉 비생물적 환경 인자들과 생물 종들 사이의 상호 작용을 다룰 것이다. 이와 함께 현재 존재하는 다양한 형태의 군집과 생태계를 소개하고, 이들의 특성을 만들어내는 에너지와 물질 순환, 종 다양성에 대해 논할 것이다."
  },
  {
    "courseCode": "BS3206",
    "courseDescription": "모든 생물은 자신을 만들어내고 유지하기 위한 정보를 담은 게놈을 가지고 있다. 생물이 우리가 생각했던 것보다 훨씬 복잡하다는 것이 밝혀지면서, 과학자들은 개체를 하나의 시스템으로 이해하기 위해 대단위의 생물학 데이터를 분석하고 있다. 따라서, 생물학에서 컴퓨터를 이용한 접근이 필수적으로 되고 있다. 수강 완료 후, 학생들은 (1) 어떻게 게놈이 작동하고 조절되는지, (2) 어떻게 게놈이 복제되고 다음 세대로 전달되는지, (3) 어떻게 게놈을 연구하는지, (4) 유전체 데이터 분석 방법의 흐름을 이해하고 수행할 수 있으며, (5) 유전체 데이터를 어떻게 해석하는지 이해할 수 있을 수 있을 것이라고 기대한다."
  },
  {
    "courseCode": "BS3208",
    "courseDescription": "생명체를 외부의 병원성 인자 (병원성 생명체 및 병원성 물질)로부터 보호하는 면역시스템은 개체를 보호하고 유지하는데 매우 중요 한 역할을 한다. 이 과정에서, 생명체가 외부 병원성 인자를 인식하여야 하며, 인식 후 방어하는 기작이 있어야 한다. 방어 기작에 관여하는 시스템에는 선천면역 시스템과 척추동물에만 존재하는 후천면역 시스템이 있으며, 이 두 시스템은 병원성 인자를 방어하는데 있어 유기적 관계를 가지고 있다. 본 면역학 강좌에서는, 면역시스템에서 병원성 인자를 비 병원성 인자와 구분하는 원리와 선천면역 시스템에서 후천면역 시스템으로 연결되는 유기적 관계를 이해하는데 그 목적이 있다."
  },
  {
    "courseCode": "BS3209",
    "courseDescription": "생리학은 생물체의 기능을 물리·화학적 원리로 이해하고자 하는 학문이다. 생리학은 그 관심의 대상 및 분석의 수준에 따라 세분화 될 수 있으나, 본 과목은 동물 특히 인간을 대상으로 세포, 조직, 기관 및 기관계 수준에서 일어나는 생명현상을 이해하고자 한다. 타 과목과의 중복을 최소화하고 심도있는 학습을 위하여, 근육생리학, 심혈관계 순환, 호흡과 폐순환, 의장관 생리학, 내분비 생리학 및 생식 생리학 등이 중점적으로 다루어질 예정이다. 본 과목을 통해 인체 기능의 작동원리를 분자 및 세포 수준에서 이해할 수 있기를 기대한다."
  },
  {
    "courseCode": "BS3210",
    "courseDescription": "이 과목은 단백질 상호작용과정 및 세포 신호전달과정 중 힘에 의해 매개되는 세포-기계생물학 새로운 이론과 현상들을 공부하기 위해 개설된 과목이다. 과목의 목표는 힘이 세포에 작용했을 때 세포가 반응하는 원리를 분자 수준에서 세포 수준까지 이해하는 것이다. 이 과목은 아래와 같은 내용을 배운다. 1) 생물학적 열역학; 2) 효소 동역학 및 기능; 3) 세포에 작용하는 힘이 리간드-수용체를 통해 세포 내부로 전달되는 신호전달 과정; 4) 세포-세포 상호 작용에서의 힘에 의해 세포의 반응이 결정되는 과정(via conformational change of enzymes, focal adhesion formation, force transmission thru actin networks, force-dependent cel -lular responses, and receptor trafficking). 학생들은 세포의 분자 및 시냅스 복합체 수준에서 생명 과학의 세포반응 과정을 이해하는데 도움을 받을 것이다."
  },
  {
    "courseCode": "BS3211",
    "courseDescription": "실험 모델은 약물개발에 있어 매우 중요하다. 이 수업을 통하여, 많은 통상질환에 대한 다양한 실험모델에 대하여 이야기하려고 한다. 매주 각 실험 모델들을 기반으로 한 신약 개발에 관련 된 최신 연구 동향에 대하여 논의하는 형식의 강의가 진행될 예정이다."
  },
  {
    "courseCode": "BS4206",
    "courseDescription": "의약화학 (또는 약품화학) 과목은 신약개발을 위한 융합적인 지식을 습득할 수 있는 학문이다. 필수 선수과목인 유기화학, 생화학의 기본지식 및 생리학적인 지식을 기반으로 하여, 논리적인 신약개발의 추진원리에 대한 총론 및 각 의약물질의 실제적인 개발에 대한 각론적인 주제를 다루게 되며, 다음과 같은 분야에 대한 강의가 이루어진다. (1) 질병과 생체분자와의 연관성 (신약개발 표적 생체분자) (2) 신약후보 물질 발굴, 설계 및 최적화를 위한 전략 및 원리 (3) 각종 의약물질들의 작용기전 및 구체적인 개발과정"
  },
  {
    "courseCode": "BS4211",
    "courseDescription": "본 과목은 생명과학 전공학생 및 생명과학에 관심이 있는 타 전공 학생에게 기존 생명과학의 방법론 및 한계점을 소개하고 이를 극복하기 위한 새로운 시도인 합성생물학의 목적과 방법론을 소개한다. 또한 수강생들이 합성생물학적 방법론을 직접 체험할 수 있도록 합성생물학적 실험기법을 활용한 간단한 mission project를 수행하도록 한다."
  },
  {
    "courseCode": "BS4213",
    "courseDescription": "본 과목은 항원 항체의 분자 특성을 이해하고, 항원/항체 반응의 원리를 이해하여 이들을 이용한 질병의 진단 치료에 적용되는 사례를 학습한다."
  },
  {
    "courseCode": "BS4214",
    "courseDescription": "본 과목에서는 현대 구조생물학의 이론적 기초를 다룰 예정이다. 특히, 엑스선 결정학 기법을 이용하여 얻어진 구조 정보를 기반으로 다양한 단백질군의 작용 메커니즘을 분자 수준에서 이해하고자 한다."
  },
  {
    "courseCode": "BS4215",
    "courseDescription": "종양 대사학은 암세포가 생체 내에서 생존하기 위해 어떻게 대사과정을 교묘히 조절하고 재프로그래밍(metabolic reprograming) 하여, 이를 무한 증식에 활용하는지에 대한 심층적 이해를 최신연구 방법론과 최신기술 및 데이터 분석법을 활용하여 학생들이 스스로 이 분야의 key milestone 들이 된 논문들을 직접 읽고, 이해하며 최신 연구 동향을 습득하고 이해하는 것을 궁극적인 목표로 삼 고 있다. 특히, 암세포가 무한 증식에 필요한 에너지와 아미노산, 핵산과 같은 생체분자 공급을 원활히 받기 위해 어떻게 정상세포의 대사과정을 미세하게 분자적 수준에서 조작하고, 정상적인 생체분자들의 합성 대사과정을 교묘하게 유용하는 지를 다양한 생화학 및 분자세포학적인 방법으로 탐구한다."
  },
  {
    "courseCode": "BS4216",
    "courseDescription": "세포내에서 대부분의 기능을 수행하는 단백질의 생성, 성장, 변화, 이동, 분해 등 전 과정을 살펴보고 세포내 단백질의 양적 및 질적 관리 기작 및 인간질병과의 연관성을 고찰한다."
  },
  {
    "courseCode": "BS4217",
    "courseDescription": "생리학은 생물체의 기능을 물리·화학적 원리로 이해하고자 하는 학문이다. 생리학은 그 관심의 대상 및 분석의 수준에 따라 세분화 될 수 있으나, 본 과목은 동물 특히 인간을 대상으로 세포, 조직, 기관 및 기관계 수준에서 일어나는 생명현상을 이해하고자 한다. 타 과목과의 중복을 최소화하고 심도있는 학습을 위하여, 근육생리학, 심혈관계 순환, 호흡과 폐순환, 의장관 생리학, 내분비 생리 학 및 생식 생리학 등이 중점적으로 다루어질 예정이다. 본 과목을 통해 인체 기능의 작동원리를 분자 및 세포 수준에서 이해할 수 있기를 기대한다."
  },
  {
    "courseCode": "BS4218",
    "courseDescription": "리보핵산의 기능, 작용원리 및 실험방법을 체계적으로 다룬다."
  },
  {
    "courseCode": "BS4219",
    "courseDescription": "이 과목의 목적은 학생들이 해부학적, 생화학적, 생리학적, 분자생물학적 접근법을 통해 암 성장 및 전이의 메커니즘을 이해하고 암 치료법을 탐구하는 연구에 지식을 적용 할 수 있도록 하는 것입니다. 학생들은 수업 참여 (20 %), 중간고사 (40 %) 및 기말고사 (40 %)를 기준으로 평가됩니다. 자세한 강의 계획서는 강의 첫날에 제공됩니다."
  },
  {
    "courseCode": "BS4223",
    "courseDescription": "본 교과 과정은 바이러스에 의한 감염, 구조, 증식, 다양성 등 바이러스에 대한 모든 것을 학습하고자 한다. Retrovirus, herpes -viruses, HIV, Influenza 등 다양한 virus에 대해 학습하고 항바이러스 제재와 백신 개발을 위한 기초적 지식을 학습하는 것을 목표로 한다."
  },
  {
    "courseCode": "BS4240",
    "courseDescription": "본 과목은 생물학도들에게 주어지는 다양한 생명정보학 문제를 잘 해결하기 위하여 관련 기본 지식 및 스킬을 습득하기 위해 개설됨. R programming, 바이오 통계, 기계학습, 차세대유전체 분석 기법 등이 소개될 예정이다."
  },
  {
    "courseCode": "BS9101",
    "courseDescription": "2010~2014학번, 학생들의 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별 적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "BS9102",
    "courseDescription": "2015학번 이상 학생들의 학사학위 논문을 준비하기 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성하여야 한다."
  },
  {
    "courseCode": "BS9103",
    "courseDescription": "2015학번 이상 학생들의 최종 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "PS2101",
    "courseDescription": "본 교과목은 일반 물리를 수강한 학생들에게 학부 고전 역학에 대한 강의를 제공함으로써, 학생들이 장차 전공 학 습에 필요한 중요 개념 및 방법론을 익히도록 하는데 목적이 있으며, 별도의 연습 시간을 통해 응용력을 향상시킨다. 강의 내용은 뉴턴 역학, 에너지 및 운동량 보존, 해석 역학, 중력장 내에서의 운동, 진동, 강체의 운동 등 을 포함하며, 또한 물리학 연구에 있어서 고전 역학의 활용을 살펴본다."
  },
  {
    "courseCode": "PS2102",
    "courseDescription": "이 강좌는 높은 수준의 전자기학의 앞부분이다. 기존에 공부한 전기학, 자기학 부분이 좀 더 자세히 다뤄지며, 최종적으로 맥스웰 방정식으로 통합되어 진다. 이 과정에서 정전기학, 정자기학, 물질의 전기적 자기적인 특"
  },
  {
    "courseCode": "PS2103",
    "courseDescription": "이 과목은 기초교육학부과정에서 전자기학 및 연습 I을 이수한 학생들을 위한 전자기학 1년 과정의 두 번째 학기 과목이다. 이 과목에 서 다루어질 주요 주제는 진공에서 및 매질 내에서의 전자기파 거동, 속박된 영역에서의 전자기파 거동, 분산 및 흡수, 포텐셀 및 전자기장, 광복사, 전기동역학과 상대론 등이다."
  },
  {
    "courseCode": "PS2201",
    "courseDescription": "이 과목은 물리전공을 희망하는 학생들을 위한 1학기 과목으로서 양자물리학과 관련 응용분야에 대한 기본개념 을 소개한다. 본 과목에서 다루게 될 주요 주제는 특수상대성이론, 원자구조, 양자역학, 수소원자, 분자, 고체 물리학, 통계역학, 핵반응, 기본 입자들이며 이 주제들은 기초수준에서 소개하게 될 것이므로 관련분야에 대한 상대적 지식이 없는 학생들도 이 과목에서 다루는 주제들에 대한 이해력과 물리적 직관력을 배양할 수 있을 것이다."
  },
  {
    "courseCode": "PS2202",
    "courseDescription": "이 과목은 표준적인 대학 고전역학의 1년 과정 중 두 번째 학기 과목으로 일반 물리 I, II 및 고전역학 I을 수강한 학생을 대상으로 한다. 케플러 운동이나 러더퍼드 산란 등의 중심력에서의 입자의 운동, 많은 입자계의 운동, 특수 상대성 이론, 대칭성과 보존량의 관계, 강 체 운동, 진동자, 진동하는 끈, 파동 방정식 등을 다룬다."
  },
  {
    "courseCode": "PS3103",
    "courseDescription": "이 과목은 현대물리학을 이해하기 위해 반드시 필요한 양자역학의 기본 원리와 이론적 토대를 제공하게 된다. 이 과목에서 다루어질 주 요 주제는 고전역학과 그 한계점, 파동역학의 태동과 불확정성원리, 양자역학에서의 기본 가설, 슈뢰딩거 방정식, 고유함수 및 고유 값, 1차원 문제, 파동역학의 일반 구조, 양자역학의 연산자 방법, N-입자계 등이다."
  },
  {
    "courseCode": "PS3104",
    "courseDescription": "이 과목은 양자물리 I을 이수한 학생들을 위한 양자물리 1년 과정의 두 번째 학기 과목이다. 이 과목에서 다루어질 주요 주제는 3차 원 슈뢰딩거 방정식, 각운동량, 방사방정식, 수소원자, 3차원 주기진동, 전자기장내에서의 하전입자, 스핀, 동일입자, 각운동량의 합, 분자 및 분자구조, 비축퇴 및 축퇴 섭동이론, 시간에 무관한 및 의존하는 섭동이론, 충돌 이론, 매질에서의 방사광흡수 등이다."
  },
  {
    "courseCode": "P53105",
    "courseDescription": "이 과목은 열 및 통계 물리에 대한 기본 개념을 제공하게 될 것이다. 이 과목에서 다루어질 주요 주제는 확률, 통계역학 및 열역학에 대 한 소개, 마음대로걷기문제에서의 평균값계산, 가우시안 확률분포, 입자계의 통계적 묘사 (통계적 앙상블, 통계역학의 기본가정, 확률 계산), 열역학법칙, 고전 및 양자계에서의 확률분포, 미세정규, 정규 및 대정규 분배함수 및 관련된 열역학 포텐셜, 평형상태에서의 묽은 기체의 동역학이론, 상과 화학종간의 동역학, 이상기체의 양자통계학, 상호작용하는 입자계, 수송과정의 기초 동역학 이론 등 이다."
  },
  {
    "courseCode": "PS3106",
    "courseDescription": "본 과목에서는 Rutherford, Franck-Hertz, Hall, Doppler, Fraunhofer, Faraday, Compton, and Stern-Gerlach 등 물리학에서 유명한 과학자들과 관련된 현대물리학 원리의 많은 양상들을 검증하는데 도움이 되는 다양한 기본 실험들을 수행하게 된다. 실험들은 실험종목들을 선택해서 꾸며진 팀을 중심으로 수행되며 기본 실험기술, 데이터분석, 실험 결과에 대한 필기 및 발표 평가 등에 비중을 두어 평가하게 될 것이다."
  },
  {
    "courseCode": "PS3107",
    "courseDescription": "수리 물리 기초와 중급에 해당하는 주제를 다양하게 다룬다. 산술 계산보다, 기본원리의 이해에 중점을 둔다.   * 좌표변환의 원리- 좌표변환에 따른 scalar field 와 vector field의 이해- 일반 좌표계에서 divergence, curl, gradient, Laplacian 등 - Sturm-Liouville system과 self-adjoint operator의 비교- Fourier, Laplace, Legendre 변환 등. 그들의 의미와 정리들 산술 계산보다 기본원리의 이해에 중점을 둔다."
  },
  {
    "courseCode": "PS3202",
    "courseDescription": "이 과목은 아날로그 전자학을 강조하는 “작동하는” 전자학을 다루는 강의와 실험이 같이 이루어지는 과목이다. 본 강좌에서는 RC-회 로, 다이오드 회로, 트랜지스터 회로, 전기적 발진, OP 앰프, 논리 게이트, 플립-플롭 등을 공부한다."
  },
  {
    "courseCode": "PS3203",
    "courseDescription": "이 과목은 물리학 연구를 위하여 컴퓨터를 사용하는 능력을 증진시키기 위하여 개설되었다. 주요 주제들은 기본 수치 분석법, 몬테-카를로 방법, 기초 신호 분석법, 병렬 처리, 신경망 방법 및 컴퓨터 기기들의 기본 개념 등이다."
  },
  {
    "courseCode": "PS3205",
    "courseDescription": "본 강좌에서는 학생들에게 빛의 흡수, 굴절, 산란, 결맞음, 편광, 회절 등에 대한 빛의 성질에 대한 기본 지식을 제공한다. 아울러 빛의 특성과 전파를 기술하는 데에 필요한 맥스웰 방정식, 존스벡터 및 행렬, 빛살추적, 푸리에 변환 등을 공부한다."
  },
  {
    "courseCode": "PS3206",
    "courseDescription": "이 과목은 수리물리 I을 이수한 학생들을 위한 수리물리 1년 과정의 두 번째 학기 과목이다. 이 과목은 다음과 같은 수리물리의 다양 한 주제를 소개한다.- 상미분 방정식, 변분법, 텐서 해석학, 특수함수, 복소함수, 확률 및 통계"
  },
  {
    "courseCode": "PS4202",
    "courseDescription": "이 과목은 반도체의 전자구조, 수송 특성 및 광특성 등의 원리를 소개한다. p-n 접합, 쌍극자 트랜지스터, MOSFET, MESFET 및 관련 광전소자의 기본원리들을 공부한다. 또한 에너지 띠 이론, 운반자 생성, 재결합 및 양자 수송 등도 공부한다."
  },
  {
    "courseCode": "PS4203",
    "courseDescription": "생물물리학은 생물학적 시스템의 탐구를 위하여 물리학적 이론 및 방법을 적용하는 학문이다. 이 강좌에서는 분자생물학, 세포생물 학, 생물에너지학, 생물학적 형광, 생체막 생물물리학, 분자 생물물리학, 세포운동, 생체분자의 투과 및 수송 등에 관련된 다양한 물리학 및 화학 이론과 방법론 들을 소개한다."
  },
  {
    "courseCode": "PS4204",
    "courseDescription": "본 과목에서는 Rutherford, Franck-Hertz, Hall, Doppler, Fraunhofer, Faraday, Compton, and Stern-Gerlach 등 물리학에서 유명한 과학자들과 관련된 현대물리학 원리의 많은 양상들을 검증하는데 도움이 되는 다양한 기본 실험들을 수행하게 된다. 실험들은 실험종목 들을 선택해서 꾸며진 팀을 중심으로 수행되며 기본 실험기술, 데이터 분석, 실험결과에 대한 필기 및 발표 평가 등에 비중을 두어 평가하게 될 것이다."
  },
  {
    "courseCode": "PS4205",
    "courseDescription": "이 과목은 학생들에게 나노기술에서의 물리현상과 이의 응용에 대한 심층적 이해를 제공한다. 주요 주제들은 양자점, 나노선, 탄소나노튜브 등의 0- 차원, 1-차원, 2-차원 나노계의 제조 및 물리적 특성이며 나노영역의 광학 현미경기술, 근접장 광학 프로브 및 표면플라즈몬 등에 대하여 공부한다."
  },
  {
    "courseCode": "PS4206",
    "courseDescription": "이 강좌에서는 원자핵의 조성, 핵력의 주요 성질, 기본입자의 종류 와 상호작용, 대칭성, 대칭성 깨짐 현상 등을 공부한다. 본 강좌에는 핵물리와 입자물리학적인 기본 용어, 실험 장치, 원자핵모델, 핵반응, 렙톤과 강입자간 상호작용, 통일장이론의 최근 이슈 등이 포함된다."
  },
  {
    "courseCode": "PS4207",
    "courseDescription": "이 과목에서는 고체의 매질특성을 이해하기 위한 물리 개념을 소개한다. 결정구조, 역격자공간, 회절, 광자, 전자 띠구조, 페르미 면 등에 대해 다시 공부하며, 금속, 반도체, 자성물질 및 유전매질 등의 물리적 특성 등을 고체의 기본 개념을 바탕으로 논의한다."
  },
  {
    "courseCode": "PS4208",
    "courseDescription": "태양계, 은하계, 성간물질 및 우주와 관련된 물리학을 논의한다. 이 강의의 토픽으로는 위성과 별의 형성, 백색왜상, 중성자별 그리고 블랙홀로 이어지는 별의 진화과정을 포함한다. 우주론과 우주의 역사에 대한 논의가 포함된다."
  },
  {
    "courseCode": "PS4209",
    "courseDescription": "이 강좌에서는 특수상대론 전반, 텐서와 일반상대론에 대한 기본적인 내용을 다룬다. 이를 통해서, 타 물리학 과목에서 언급되었던 상대론에 대한 단편적인 지식들을 보충 및 강화할 수 있고, 일반상대론, 우주론 등의 심화과정에 대한 기초를 마련할 수 있다."
  },
  {
    "courseCode": "PS4211",
    "courseDescription": "본 강좌는 학사 고학년생과 대학원 물리 및 광과학과 1학년 과정을 위하여 개설하며 1) 최소 액션의 원리 2) 특수 상대성 이론 3) stress tensor 의 kinetic theory를 배우고, 각운동량과 고전 스핀과 양자스핀의 구분을 배운다."
  },
  {
    "courseCode": "PS4212",
    "courseDescription": "이 과목은 기본적 현상과 구조의 측면에서 연성물질들의 성질을 물리학의 기본적인 원리로 이해할 수 있는 지식을 제공할 것이다. 특히 생체에 있는 리포좀을 설명하기 위한 물질과 단분자(2-d) 막의 표면장력, 자기 조립하는 원리를 다룰 것이다. 또한 DNA같은 고분자 에 대한 기본적인 물리적 사고방식, anisotropic한 물체에 의한 새로운 구조, 제한된 공간에서 일어나는 현상 등을 소개할 것이다."
  },
  {
    "courseCode": "PS4213",
    "courseDescription": "많은 연성물질은 dynamic하고, 또한 non-equilibrium steady state를 갖는 system이다. 이러한 물질을 설명하기 위해서는 conventional한 approach로는 가능하지가 않다. 이 교과목에서는 여러 가지 active한 경우, Molecula motors, Molecular chaperons, Swimmers in low Reynolds number, Cell adhesion and mechanics, 그리고 Collective behavior in active systems를 설명하면서, 새로운 방법 및 실험방법을 소개할 예정이다."
  },
  {
    "courseCode": "PS4214",
    "courseDescription": "이 과목은 학부의 양자물리를 공부한 학생들을 위한 고급 과목이다. 내용은 크게 네 가지 주제로 이루어져 있다. 1) 양자역학에서의 대칭성과 군론의 응용2) 파인만 경로 적분 방법을 이용한 양자역학의 이해 3) 상대론적 양자역학과 디락의 이론4) 장의 양자화와 그것의 입자물리와 응집물질 물리에의 응용"
  },
  {
    "courseCode": "PS4215",
    "courseDescription": "이 과목은 초강력 레이저 과학, 천체물리, 핵융합 등의 다양한 분야에서 활용되는 플라즈마 물리학에 대한 입문 지식을 강의하고, 최 신 응용 연구를 소개한다."
  },
  {
    "courseCode": "PS4216",
    "courseDescription": "본 교과목을 통해 금속의 페르미면, 초전도 현상, 자성 현상, 유전체, 표면 및 계면 물리학, 나노 물리학 등의 현상과 기본적인 이론을 습득하고 구체적인 실험 방법에 대해 배울 수 있다. 대학원에 진학하여 응집 물질 물리학을 전공하고자 하는 학부생 또는 대학원 신입생에게 고체물리학의 다양한 연구 분야들의 기초 지식을 제공하는 것을 학습 목표로 삼는다."
  },
  {
    "courseCode": "PS4217",
    "courseDescription": "양자정보기술, 고체물리학, 분광학 등 현대과학의 많은 분야에서 빛과 매질의 상호작용에 대한 이해를 필요로 한다. 이 강의에서는 양자물리학을 수강한 학생들을 대상으로 양자광학 및 원자물리학의 기초를 강의하며, 이를 바탕으로 빛의 양자물리학적 성질과 원자-광자 상호작용에 대한 이해를 돕고자 한다."
  },
  {
    "courseCode": "PS4218",
    "courseDescription": "최근 많은 관심을 받는 양자컴퓨팅, 양자통신 등 양자정보기술의 핵심 원리를 이루는 물리학적 원리를 소개하여 학생들에게 새로운 분야에 대한 이해를 돕고자 하며 향후 관련 분야로 진출을 원하는 학생들에게 기본 소양을 갖추게 하고자 함."
  },
  {
    "courseCode": "PS4219",
    "courseDescription": "본 교과목은 “AI시대의 전산물리학Ⅰ”과 연결되는 과목으로서, 미분 방정식의 수치적 해법, 몬테칼로 방법, 확률적 데이터의 측정오차 다루는 법, 그리고 물리학 연구에 응용되고 있는 범위의 인공 신경망과 머신러닝에 대한 심화 지식을 교육하고 물리학과 3학년생이 배우는 범위의 양자역학 및 통계물리학에 대한 문제로써 AI 적용 예를 실습한다."
  },
  {
    "courseCode": "PS4220",
    "courseDescription": "이 과목에서 유체의 근본 물리를 학습하고 이를 이용하여 자연에서 일어하는 유체 현상, 유체 기계, 실험실과 천체의 플라즈마를 이해한다. 다루는 주제는 다음과 같다. 유체의 기본 개념, 보존 법칙, 이상 유체, 점성 유체, 압축성 유체, 불안정성, 난류, 상태 방정식, 열에너지 전달, 실험실과 천체의 플라즈마. 이 과목을 수강한 학생들은 기본적인 유체 물리에 대한 이해, 유체 현상과 유체 기계에 대한 지식, 그리고 유체를 다루는 수학적 능력을 얻게 될 것이다."
  },
  {
    "courseCode": "PS9101",
    "courseDescription": "2010~2014학번, 학생들의 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별 적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "PS9102",
    "courseDescription": "2015학번 이상 학생들의 학사학위 논문을 준비하기 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성하여야 한다."
  },
  {
    "courseCode": "PS9103",
    "courseDescription": "2015학번 이상 학생들의 최종 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "PS9104",
    "courseDescription": "이 강좌는 물리학과 교수님들에 의한 팀 강의로 이루어진다. 최신 물리학 연구의 다양한 주제들을 요약하고 각 연구 주제들의 현황을 검토한다. 이를 바탕으로 미래 물리학 연구의 방향에 대하여 토의한다."
  },
  {
    "courseCode": "CH2101",
    "courseDescription": "본 과목은 화학과 과학의 여러 분야에서 사용되는 정성 분석과 정량 분석의 기본 원리에 대한 이해를 제공한다. 과학적 측정을 통해 얻어지는 자료들을 해석하는 방법과 통계의 기본을 소개하고, 산염기 반응, 산화환원과 전지의 원 리 및 응용 등 다양한 정성/정량 분석법들의 배경 이론을 학습한다. 분석화학에서 익히는 이론 및 실험법은 모든 화학분야의 실험연구에 기초가 되며, 생명, 에너지, 환경 등 인접 분야의 교육 및 연구에도 매우 중요하게 활용된다."
  },
  {
    "courseCode": "CH2102",
    "courseDescription": "이 과목은 양자역학을 이용하여 원자 및 분자의 구성 원리 및 분광학을 이용한 실험법 등에 대해 다루고 있다. 양자역학의 기본적 이론을 익히고 수소 원자와 같은 단순한 시스템에서부터 다원자분자에 이르기까지 복 잡한 화합물에 적용하는 방법 등을 소개한다. 빛을 이용하여 분자의 구조 및 특성을 조사하는 분자분광학의 기본적인 이론과 실험에 대해서도 다루게 된다."
  },
  {
    "courseCode": "CH2103",
    "courseDescription": "본 과목에서는 생명체의 구성 물질이자 우리 생활과 밀접한 관계를 갖고 있는 유기분자를 이해하기 위한 화학의 기본 개념을 소개한다. 이 과목의 중요한 목적은 유기분자의 구조와 반응성의 관계를 배우는 것으로서, 화학결합, 명명법, 이성질체, 입체화학, 작용기, 분광법, 그리고 합성과 반응 메커니즘을 다룬다. 본 과목을 수강한 후 학생들은 다양한 과목에서 접하게 될 분자와 물질들에 대한 구조, 성질, 반응성 등을 이해하는데 기본적인 개념을 습득하게 된다."
  },
  {
    "courseCode": "CH2104",
    "courseDescription": "이 과목은 양자역학의 소개와 응용으로 이루어져 있다. 이 과목에서는 양자이론의 확립과정을 살피고 양자이론이 수소 원자와 같은 단순한 계에 어떻게 적용되는지 살펴본다. 이와 같은 논의를 확대시켜 분자 수준에서의 화학 결합을 이해하고 분자 분광학의 이론적 배경을 다진다."
  },
  {
    "courseCode": "CH2105",
    "courseDescription": "대표적인 무기 및 유기 화학물질을 실험실에서 합성하고 분석하는 과정을 습득하는 과목이다. 반응물과 생성물의 물리화학적 성질 이 해, 반응물의 준비, 반응기의 설치와 조작, 합성 생성물의 분석을 통해 반응 기작과 반응속도를 이해하게 된다."
  },
  {
    "courseCode": "CH2106",
    "courseDescription": "비전공자로서 유기화학의 기본 개념을 이해하고자 하는 학생들을 위한 유기화학 단학기 과정이다. 유기분자의 결합과 유기화학반응의 거동을 이해하고, 분자 내 작용기로 인해 드러나는 유기분자의 물리적, 화학적 특성과 반응성을 이해하고 예측할 수 있는 능력을 기르고자 한다. 화학전공(부전공)을 희망하는 학생은 이 과목을 들을 수 없다."
  },
  {
    "courseCode": "CH2201",
    "courseDescription": "이 과목은 유기화학 I에서 배운 내용을 바탕으로 유기분자의 구조와 반응성의 관계를 심화하여 다룬다. 방향족 화합물과 알코올, 에테르, 카르보닐기를 포함하는 화합물, 카르복실산 유도체, 아민 등의 작용기의 반응성에 대해 배우고, 학기 후반에는 탄수화물, 단백질, 핵산 등의 생체분자에 대해 소개한다. 이를 통하여 유기화합물의 반응성, 합성법, 그리고 기능에 대해 이해하게 된다."
  },
  {
    "courseCode": "CH2301",
    "courseDescription": "이 과목은 화학과 학생들이 전공과목을 본격적으로 시작하기에 앞서 물리화학, 양자화학, 계산화학, 열역학에서 사용하는 수학적 방법에 익숙해지도록 구성되어 있다."
  },
  {
    "courseCode": "CH3104",
    "courseDescription": "이 과목은 양자역학을 이용하여 원자 및 분자의 구성 원리 및 분광학을 이용한 실험법 등에 대해 다루고 있다. 양자역학의 기본적 이론을 익히고 수소 원자와 같은 단순한 시스템에서부터 다원자분자에 이르기까지 복잡한 화합물에 적용하는 방법 등을 소개한다. 빛을 이용하여 분자 의 구조 및 특성을 조사하는 분자분광학의 기본적인 이론과 실험에 대해서도 다루게 된다."
  },
  {
    "courseCode": "CH3106",
    "courseDescription": "이 과목은 생체 구성 물질의 화학적, 물리적 특성을 다룬다. 수용액의 성질, 열역학적 원리와 같은 본질적인 주제를 간단히 다루고, 아미노산, 단백질, 핵산, 탄수화물, 지질의 화학적 성질 및 구조, 세포 내에서의 역할 및 화학 반응을 중점적으로 논의한다. 생화학 연 구에 필수적인 기초 생물정보학의 이용에 대해 소개한다."
  },
  {
    "courseCode": "CH3107",
    "courseDescription": "이 과목은 무기화학의 기본 개념 및 이론을 이해하는 것을 목표로 한다. 그에 따라 강의 주제는 배위결합화학, 유기금속화학, 생무기 화학 분야에서 발견되는 분자 구조, 화학 결합, 고체 구조와 관련된 중요 이론과 내용을 포함한다."
  },
  {
    "courseCode": "CH3111",
    "courseDescription": "이 과목은 화학, 특히 유기 화학을 전공하는 학부 3,4학년을 위한 과정이다. 학생들은 일반화학 및 연습Ⅰ&Ⅱ와 유기화학 Ⅰ&Ⅱ를 선수과목으로 들어야 한다. 이번 과정에서는 Lewis Acids, 촉매 등 유기화학반응 및 화학합성에서 주요 그룹 금속원소(Group 1A-4A)의 다양한 역학에 대해 소개한다. 또한 전이 금속과 리간드 사이의 기본적인 결합 개념과 촉매 H-H와 H-X 첨가, 촉매 카보닐화, 촉매 C-C와 C-N 결합 반응과 같은 몇 가지 대표적인 균질 촉매 반응을 다루는 유기금속 화학에 대해 간략히 소개한다."
  },
  {
    "courseCode": "CH3205",
    "courseDescription": "화학결합과 오비탈 및 입체화학을 이용한 유기화학 반응 메커니즘을 이해한다."
  },
  {
    "courseCode": "CH3207",
    "courseDescription": "이 과목은 물리화학과 분석화학에 기반한 다양한 실험을 통해 물질의 물리·화학적인 성질을 측정하는 원리와 다양한 화학장비의 작동 원리 및 측정한 데이터의 분석법 등을 다룬다. FT-IR, Raman, 형광 등 기본적인 분광법과 전기화학적 분석을 통해 효소반응, 들뜬 상태 동력학 등 물질의 다양한 특성을 조사하며, 화학장비를 구성하는데 필요한 기본적인 장치의 구성 및 프로그래밍/작동법 등을 다 룸으로써 화학분야의 다양한 연구를 수행하는데 필수적인 기본 지식/기술을 얻을 수 있다."
  },
  {
    "courseCode": "CH3208",
    "courseDescription": "이 과목은 무기 복합체 및 화합물의 분자 구조와 특성에 중점을 둔다. 결합의 개념, 주기적인 특성의 경향, 분자 대칭 및 스펙트럼과의 관계, 고체 상태 등을 이해한다."
  },
  {
    "courseCode": "CH4201",
    "courseDescription": "이 과목은 복합유기화합물의 구조적 결정에 필수적인 자외선-vis, IR, MS, NMR 분광학의 원리를 배우고 실제 사례를 통해 실습하게 된다."
  },
  {
    "courseCode": "CH4205",
    "courseDescription": "이 과목의 전반부는 아미노산/단백질, 탄수화물/올리고당, 뉴클레오타이드/핵산 등 생체분자의 단량체와 생체고분자의 구조와 화학 에 대해 다룬다. 이 생체분자의 생합성 경로 및 메카니즘을 이해하고, 효소와 보조인자가 관여하는 생체 내 반응에 대해 공부한다. 관련된 주제로 생체모사 화학, 거대분자 화학, 의약화학에 대해 강의 후반부에 간략하게 소개한다."
  },
  {
    "courseCode": "CH4208",
    "courseDescription": "이 과목은 무기화학의 중요 원리를 다루고 있다. 강의 주제는 배위결합화합물, 유기금속화합물, 생무기화합물의 분자 구조, 화학 결합, 전자적 성질과 관련한 주요 개념과 이론을 포함하고 있다."
  },
  {
    "courseCode": "CH4211",
    "courseDescription": "이 과목은 학부수준의 통계역학 개론 과목으로 양자 역학과 열역학을 연결하는 물리화학의 중요한 과목이다. 통계역학은 여러 화학현상을 이해하는 중요한 도구로서 향후 물리화학을 전공하고자 하는 학생에게는 필수적인 과목이다."
  },
  {
    "courseCode": "CH4212",
    "courseDescription": "양자화학강의는 고학년 학부 학생들에게 화학을 위한 고급양자역학 지식을 전달하고, 원자 및 분자 모델링을 위한 계산방법을 소개한 다. 처음 한두 주간의 강의에서는 기초 양자역학 개념을 복습하고, 이후에는 홑전자 원자, 다전자 원자, 두 원자로 된 분자, 나아가 일반적인 분자의 전자구조를 이해하고 이를 위한 계산 방법을 다룬다."
  },
  {
    "courseCode": "CH4213",
    "courseDescription": "이 과목은 학생들에게 현대 분석 기기장치의 작동 원리에 대한 기본적인 이해를 제공한다. 이 과목에서는 분광 광도법, 원자 분광법, 질량 분석학, 그리고 기체 크로마토그래피, 액체 크로마토그래피, 모세관 전기 영동 등의 분리 분석법에 대해 학습하며, 기기 분석에 관한 연구 논문을 발표하는 기회를 갖는다."
  },
  {
    "courseCode": "CH4216",
    "courseDescription": "이 과목에서는 고전적인 천연물 전합성 예시를 통해 기본적인 유기합성 반응을 활용하여 복잡한 천연물을 합성하는 전략을 배운다."
  },
  {
    "courseCode": "CH4219",
    "courseDescription": "본 과목은 세포 내에서 일어나는 생체 에너지 대사를 중심으로, 생체 에너지의 생성과 저장, 생합성, 분해 과정의 조절 등에 다룬다. 과목은 1) 생체대사의 개념 이해, 2) 당의 생합성, 생분해 및 저장, 3) 지질과 스테로이드의 생합성 및 생분해, 4) 아미노산의 생합성, 5) 핵산의 생합성 및 6) 대사작용의 통합 등으로 구성되며, 이에 관련된 효소반응 및 관련 질병들을 소개한다."
  },
  {
    "courseCode": "CH4220",
    "courseDescription": "본 과제에서는 열역학과 양자 역학을 연결하는 통계역학, 반응의 속도를 다루는 반응속도론, 그리고 분자 수준에서 화학 결합의 형성 과 분해를 다루는 분자반응 동력학을 공부하게 될 것이다. 그리고 고체화학 및 표면화학과 같은 응용 분야도 간결하게 다룰 것이다."
  },
  {
    "courseCode": "CH4221",
    "courseDescription": "다전자 시스템에서 양자 화학 방법론을 이해하고 분자 구조 및 반응, 분자 분광학 및 스펙트럼 분석과 같은 다양한 화학 연구 주제에 전산 화학 방법을 적용한다."
  },
  {
    "courseCode": "CH4222",
    "courseDescription": "다양한 에너지와 전기에너지 간 상호 변환, 동종 에너지 간 특성 변환에 대한 이론적 기초를 제공하고, 효율적 에너지 변환 및 저장을 위한 소재, 디바이스와 시스템에 대해서 학습한다."
  },
  {
    "courseCode": "CH4223",
    "courseDescription": "세포, 유전자, 단백질 및 대사물질 등을 분석하는 다양한 광학, 크로마토그래피, 전기영동, 단분자 분석, 나노툴 등에 대해 다루며, 최신의 면역화학 분석법, 분자진단법, 바이오센서 및 생분석화학의 바이오인더스트리 응용 등에 대해서도 소개한다."
  },
  {
    "courseCode": "CH4224",
    "courseDescription": "이 과목은 재료과학화학을 전공하는 3학년 또는 4학년 학부생을 위해 만들어졌다. 이 과정은 나노과학 및 나노기술과 관련된 결정성 고체의 기본 원리에서 시작하여 화학의 최근 기술적인 발전에 중점을 두고 다양한 유형의 나노 구조의 합성에서 화학의 역할을 소개한다."
  },
  {
    "courseCode": "CH9101",
    "courseDescription": "2010~2014학번, 학생들의 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별 적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "CH9102",
    "courseDescription": "2015학번 이상 학생들의 학사학위 논문을 준비하기 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성하여야 한다."
  },
  {
    "courseCode": "CH9103",
    "courseDescription": "2015학번 이상 학생들의 최종 학사학위 논문 작성을 위한 과목으로 논문 지도교수의 승인을 받은 학사논문연구신청서를 근거로 개별적인 연구를 거쳐 학사학위 논문을 작성 및 제출하여 논문심사에 통과하여야 한다."
  },
  {
    "courseCode": "IR2201",
    "courseDescription": "이 과목은 기초학부, EECS 및 기타 전공 학생들에게 전기 회로 이론의 기본 요소를 소개한다. 이 과정에 서 다루는 회로 요소 및 분석은 회로 및 시스템, 전력 전자 장치, 제어 및 통신의 고급 분야를 이해하는 기 본 배경이 될 것이다. 회로 변수 및 요소, 회로 분석 기법, RLC 회로, 정현 정상 상태 분석, 회로 분석을 위한 라플라스 및 푸리에 변환 등의 주제가 포함된다."
  },
  {
    "courseCode": "IR2202",
    "courseDescription": "이 과목은 자동차, 항공기, 로봇 등과 같은 기계시스템에서 외력이 작용하였을 때 물체의 움직임 (위치/방 향, 속도, 가속도)를 해석하기 위한 방법을 학습하는 것을 목표로 한다. 이를 위해, 입자와 강성체에서 뉴 톤 동역학 이론, 일과 에너지 이론, 충격량과 운동량 등을 학습한다."
  },
  {
    "courseCode": "IR3202",
    "courseDescription": "In order to understand the various physical systems such as hydraulic, mechanical, electrical, magnetic, and thermal systems in terms of energy or power exchange, a bond graph modeling technique is introduced. The various physical system are ana -lyzed by using the bond graph and underlying similarities between them are under -stood. In modern engineering systems, it is common to have multiple systems com -bined with two or three physical systems. In addition to its modeling, the fundamental approach of system analysis is also studied in the time domain and frequency domain. Conventional control theory in frequency domains is covered with the consideration of control components. In conclusion, this course is aimed to give basic knowledges and physical meaning of modeling for design and control of physical systems."
  },
  {
    "courseCode": "IR3203",
    "courseDescription": "본 강의는 크게 3가지로 구성된다. 첫번째 파트는 마이크로프로세서(ARM 프로세서)의 기본구조, regis -ters, 메모리, 케시 등의 구조와 입출력 작동, 기본적인 assembly language에 의한 프로세서의 구동 방법을 배운다. 두번째 파트는 ARM 기반의 마이크로프로세서 및 프로세서 사용법을 실습수업을 통하여 학습한다. 마지막으로 수강에 참여한 학생들은 ARM 프로세서 기반으로 이동로봇 등의 임베디드시스템 구현을 통하여 프로젝트를 수행하게 된다. 수행한 프로젝트는 중간고사 전후 및 기말고사 전후에 공개 데모를 수행하여 평가받게 된다."
  },
  {
    "courseCode": "IR4201",
    "courseDescription": "사전 지식이 없는 수강생을 대상으로 기초적인 수학 도구부터 인공신경망, 다층퍼셉트론, 역전파 알고리즘, 심층 합성곱 신경망을 공부하고 선형 회귀 분석과 분류기 학습에 적용해 본다."
  },
  {
    "courseCode": "IR4202",
    "courseDescription": "본 강의는 Labview기반 설계 및 실험을 통한 통합 접근법으로 기계와 전자공학의 융합을 통해서 기계시스템을 설계할 수 있는 능력을 배양하는 것을 목적으로 한다. 강의 내용으로는 그래픽 기반 실시간 메카트로닉스 시스템 기능 구현을 위해서 하드웨어 인터페이스, 디지털 및 아날로그 인터페이스, 측정 및 센싱, 전자기 구동, 메카트로닉스 시스템의 제어 시스템을 다루고자 한다."
  },
  {
    "courseCode": "IR4203",
    "courseDescription": "본 과목에서는 '인간-컴퓨터 상호작용 (HCI)' 분야를 소개한다. 인터랙티브, 모바일, 웨어러블, 유비쿼터스, 인간-로봇 상호작용 등 다양한 학제간 융합 연구를 소개하고, HCI 연구기법, 도구와 장비, 인간대상실험에 대한 정보를 전달한다. HCI 전공이 아닌 대학, 대학원 생 모두가 수강할 수 있는 과목이다."
  },
  {
    "courseCode": "IR4206",
    "courseDescription": "본 강의에서는 4차 산업혁명시대에 대응하는 인재를 양성하기 위한 인공지능과 로봇 기술을 기반으로 하는 맞춤형 창의 혁신 교육을 실현하기 위해서  기획부터 제작까지의 전 과정을 Design Thinking Process를 통해서 체계적으로 교육하여 이 과정을 통해서 로봇 공학, 인공지능, 디지털 테크놀로지의 융합을 이루는 것을 목적으로 한다. 또한, 학생들의 도전의식 함양을 위해서 탁구 로봇 경진대회를 개최하여 이론을 실제에 적용하는 실험기반 교육을 통하여 창의적 사고 능력 배양 및 실무를 통한 지능로봇 기술의 학습 환경을 제공하는 것을 목표로 한다."
  },
  {
    "courseCode": "IR4207",
    "courseDescription": "자동제어는 제어이론 중에 처음으로 듣게 되는 과목으로 주로 연속시간 제어 시스템의 해석과 설계를 다룬다. 특히 수업에서는 라플라스 변환, 시스템의 모델링, 초기 및 안정된 반응의 해석, 루트로커스 해석 및 이를 이용한 제어 시스템 설계, 주파수 반응의 해 석 및 이를 이용한 제어시스템 설계 등을 다룬다. 이 과목을 통해서 학생들은 자동주행 자동차나, 무인항공기 및 로봇 등의 동적 시스템 제어기 설계에 필요한 간단하면서도 유용한 방법을 배우게 된다."
  },
  {
    "courseCode": "IR4208",
    "courseDescription": "본 강의에서는 간단한 4절링크, 다관절 로봇, 모바일 로봇, 모마일 매니퓰레이터, 휴머노이드로봇들의 운동학 및 모션 생성 기술 을 증진시키는 것을 목적으로 한다. 따라서 닫힌 형태의 4절링크 및 6절링크의 1자유도 및 5절 링크의 2자유도의 기구해석을 기초 로, 다자유도의 강체운동, 속도해석, 정적 해석 등의 운동해석을 수행하고 다양한 로봇의 현장적용을 위한 인공지능기반 지능형 운 동 생성기술을 포함한 강의를 진행한다."
  },
  {
    "courseCode": "IR4209",
    "courseDescription": "이 과목은 로봇제어를 위한 기초 기반 이론을 강의한다. Deep Reinforcement Learning-based 제어뿐만 아니라 PID, Inverse Dynamics, Adaptive, Robust, Force/Impedance, Vision-based, Passivity-based 제어 같은 기본적인 주제를 다룬다."
  },
  {
    "courseCode": "FE4310",
    "courseDescription": "본 과목에서는 사람과 AI-infused system의 상호작용에 관한 PBL (Project-Based Learning)을 수행한다. 매년 선정되는 국가 special topics를 다루며, 올해는 최근 부상하는 메타버스와 연계하여 Extended Reality and Digital Twin에 관한 프로젝트를 기획 및 제작한다. 구체적으로 RDW, 차량 XR, SR, NFT 연계 응용을 수행하며, 그 결과물에 대해 IR pitching을 목표로 한다."
  }
]